
#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьОтклики(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ПолучитьОтклики(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОткрытьФормуКандидата(СтруктураДанныхКандидатаССайта, Сайт, Вакансия, ИдентификаторРезюме) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОткрытьФормуКандидата(
		СтруктураДанныхКандидатаССайта, Сайт, Вакансия, ИдентификаторРезюме);
	
КонецПроцедуры

Процедура ЗагрузитьВакансииССайта(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ЗагрузитьВакансииССайта(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОпубликоватьНаСайте(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОпубликоватьНаСайте(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбновитьПубликациюНаСайте(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОбновитьПубликациюНаСайте(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура СнятьCПубликацииНаСайте(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.СнятьCПубликацииНаСайте(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура АвторизацияНаСайте(Сайт, ИмяПользователя, Пароль, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.АвторизацияНаСайте(Сайт, ИмяПользователя, Пароль, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОткрытьФормуАвторизации(Форма, Сайт) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОткрытьФормуАвторизации(Форма, Сайт);
	
КонецПроцедуры

Процедура ОбновитьКомандыРаботыСПубликацией(Форма) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОбновитьКомандыРаботыСПубликацией(Форма);
	
КонецПроцедуры

Процедура ОтобразитьПредупреждение(ТекстПредупреждения) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОтобразитьПредупреждение(ТекстПредупреждения);
	
КонецПроцедуры

Процедура АвторизацияИЗагрузкаКлассификаторовССайта(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.АвторизацияИЗагрузкаКлассификаторовССайта(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура СоздатьКандидатаПоСсылкеЗавершениеВводаСтроки(Сайт, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.СоздатьКандидатаПоСсылкеЗавершениеВводаСтроки(Сайт, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура СоздатьКандидатаПоСсылке(СтрокаИзБуфера, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.СоздатьКандидатаПоСсылке(СтрокаИзБуфера, ДополнительныеПараметры)
	
КонецПроцедуры

Функция ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы, Владелец, Оповещение, Модально) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы, Владелец, Оповещение, Модально);
	
КонецФункции

Процедура РегионНажатие(Форма, СтруктураПараметров) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.РегионНажатие(Форма, СтруктураПараметров);
	
КонецПроцедуры

Процедура НачалоОдиночногоВыбораИзСписка(Форма, СписокВыбора, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.НачалоОдиночногоВыбораИзСписка(Форма, СписокВыбора, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура НайтиВДлительнойОперации(Форма, ФормаДлительнойОперации, Результат, АдресХранилища, ПараметрыОбработчикаОжидания, ИдентификаторЗадания) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.НайтиВДлительнойОперации(Форма, ФормаДлительнойОперации, Результат, АдресХранилища, ПараметрыОбработчикаОжидания, ИдентификаторЗадания);	
	
КонецПроцедуры

Процедура КомандаПоискРезюмеВИнтернете(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.КомандаПоискРезюмеВИнтернете(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

Процедура КомандаПоискРезюмеВИнтернетеПоВакансии(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.КомандаПоискРезюмеВИнтернетеПоВакансии(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

Процедура ОпубликоватьВакансиюЗавершение(Форма) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОпубликоватьВакансиюЗавершение(Форма);
	
КонецПроцедуры

Процедура ОбновитьПубликациюВакансииЗавершение(Форма) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОбновитьПубликациюВакансииЗавершение(Форма);
	
КонецПроцедуры

Процедура ВыборИзДереваЗначений(Форма, СтруктураПараметров, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ВыборИзДереваЗначений(Форма, СтруктураПараметров, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОдиночныйВыборИзСписка(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.ОдиночныйВыборИзСписка(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура МножественныйВыборИзСписка(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.МножественныйВыборИзСписка(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура РедактированиеМногострочногоТекста(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.РедактированиеМногострочногоТекста(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура РедактированиеУровняВладенияЯзыками(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.РедактированиеУровняВладенияЯзыками(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура РедактированияСпискаТелефонов(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.РедактированияСпискаТелефонов(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура РедактированиеТекстаВHTML(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.РедактированиеТекстаВHTML(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура НачалоВыбораЗначения(Форма, ДополнительныеПараметры) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовКлиентРедакция3.НачалоВыбораЗначения(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
