#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьИзмененияНастроекСистемыБронирования(СистемаБронирования, ИспользоватьОтборПоПодразделениям = Истина) Экспорт

	Если СистемаБронирования = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.НастройкиСистемыБронированияКомандировок.СоздатьМенеджерЗаписи();
	Запись.СистемаБронирования = СистемаБронирования;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.ИспользоватьОтборПоПодразделениям = ИспользоватьОтборПоПодразделениям;
	Иначе
		Запись.СистемаБронирования = СистемаБронирования;
		Запись.ИспользоватьОтборПоПодразделениям = ИспользоватьОтборПоПодразделениям;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Запись.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ИспользуетсяОтборПоПодразделениям(СистемаБронирования) Экспорт

	Если СистемаБронирования = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запись = РегистрыСведений.НастройкиСистемыБронированияКомандировок.СоздатьМенеджерЗаписи();
	Запись.СистемаБронирования = СистемаБронирования;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ИспользоватьОтборПоПодразделениям;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли