#Область СлужебныйПрограммныйИнтерфейс

#Область МногофункциональныеДокументы

// См. ЗарплатаКадрыРасширенныйКлиентСервер.ТипыМногофункциональныхДокументов
Функция ТипыМногофункциональныхДокументов() Экспорт 
	
	МногофункциональныеДокументы = Новый Соответствие;
	
	ОписаниеДокумента = ЗарплатаКадрыРасширенныйКлиентСервер.ОписаниеМногофункциональногоДокумента();
	ОписаниеДокумента.РеквизитСостояние   = "ИзменитьОплату";
	ОписаниеДокумента.ВторойОтветственный = Неопределено;
	ОписаниеДокумента.ВидУчета            = "ПлановыеНачисления";
	ОписаниеДокумента.СообщениеДокументНеУтвержден = НСтр("ru = '%1 - оплата труда не изменена.'");
	
	МногофункциональныеДокументы.Вставить(Тип("ДокументСсылка.РезультатыАттестацииСотрудников"), ОписаниеДокумента);
	
	Возврат МногофункциональныеДокументы;
	
КонецФункции

#КонецОбласти

#КонецОбласти
