
#Область СлужебныеПроцедурыИФункции

Функция ПериодичностьОсмотраПоВредномуФактору(ВредныйФактор) Экспорт
	
	ВредныеФакторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВредныйФактор);
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВредныеФакторы);
	Возврат ПериодичностьОсмотров[ВредныйФактор];
	
КонецФункции

#Область ВредныеФакторыВидыРабот

Функция ПериодичностьВредногоФактораВидаРаботИзменилась(НоваяПериодичность, ПрежняяПериодичность) Экспорт
	
	Возврат МедицинскиеОсмотрыФормы.ПериодичностьВредногоФактораВидаРаботИзменилась(НоваяПериодичность, ПрежняяПериодичность);
	
КонецФункции

#КонецОбласти

#КонецОбласти
