#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.РегламентныеЗадания

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Зависимости) Экспорт
	
	Зависимость = Зависимости.Добавить();
	Зависимость.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПолучениеСообщенийЧатбота;
	Зависимость.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьЧатботов;
	Зависимость.РаботаетСВнешнимиРесурсами = Истина;
	Зависимость.ВключатьПриВключенииФункциональнойОпции = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

// СтандартныеПодсистемы.ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	ЧатботыСлужебный.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПрофилиБезопасности

// СтандартныеПодсистемы.ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ПринятыеСведенияЧатботами";
	НовыеСведения.ПоляРегистрации	= "Отправитель";
	НовыеСведения.ПоляДоступа		= "Имя,Телефон,EMail,Возраст,ОСебе,ФайлРезюме";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";

КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных

// СтандартныеПодсистемы.НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ДиалогиЧатботов);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.НастройкиВариантовОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьСообщенияЧатботаПоРегламентномуЗаданию(Чатбот) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПолучениеСообщенийЧатбота);
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	ЧатботыСлужебный.ПолучитьСообщенияЧатбота(Чатбот);
	
КонецПроцедуры

Функция ОбработатьВходящийHTTPЗапрос(HTTPВходящийЗапрос) Экспорт
	Возврат ЧатботыСлужебный.ОбработатьВходящийHTTPЗапрос(HTTPВходящийЗапрос);
КонецФункции

Функция ДанныеЧатботов() Экспорт
	Возврат ЧатботыПовтИсп.ДанныеЧатботов();
КонецФункции

Функция ИспользуемыеЧатботы() Экспорт
	Возврат ЧатботыПовтИсп.ИспользуемыеЧатботы();
КонецФункции

Функция ДанныеЧата(Чат) Экспорт
	Возврат ЧатботыПовтИсп.ДанныеЧата(Чат);
КонецФункции

#КонецОбласти