#Область ПрограммныйИнтерфейс

// Процедура позволяет дополнить структуру видов уведомлений своими видами уведомлений. 
//
// Параметры:
//  СтруктураДоступныхВидовУведомлений - структура - перечень уведомлений, подключенных в подсистеме
//     * Ключ - Строка - Имя вида уведомления
//     * Значение - Структура - Описание вида уведомления (Структура)
//        * ВидУведомления   - Строка - строковый идентификатор вида уведомления.
//        * GUID             - Строка - Уникальный идентификатор вида уведомления
//        * Описание         - Строка - Текстовое описание получаемых данных. Доступно пользователю в справочнике Видов уведомлений.
//        * Инициализация    - Строка - <ИмяМодуля>.<ИмяПроцедуры> описывающей данные вида уведомления без выполнения
//                                      запросов к базе данных.
//        * ПолучениеДанных  - Строка - <ИмяМодуля>.<ИмяПроцедуры> выполняемой для получения данных уведомления.
//        * КатегорияСобытия - ПеречислениеСсылка.КатегорииВидовУведомлений - Указывает на способ определения события,
//                                                                            значение по умолчанию "ВыборкаДанных".
//
Процедура ПриЗаполненииСпискаВидовУведомлений(СтруктураДоступныхВидовУведомлений) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииСпискаВидовУведомлений(СтруктураДоступныхВидовУведомлений);
КонецПроцедуры

// Вызывается при подготовке шаблонов сообщений и позволяет заполнить поля, доступные для шаблона
//  соответствующего вида уведомлений.
//
// Параметры:
//  ВидУведомления           - СправочникСсылка.ВидУведомления - вид уведомления - владелец шаблона
//  Реквизиты                - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//                                      и др.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  НазначениеШаблона        - Строка  - Имя назначения шаблон сообщения.
//  ДополнительныеПараметры  - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщенияПоУведомлению(ВидУведомления, Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт
	ЗарплатаКадрыРасширенный.ПриПодготовкеШаблонаСообщенияПоУведомлению(ВидУведомления, Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры);
КонецПроцедуры

// Позволяет переопределить имя типа шаблона сообщений по виду уведомления
//
// Параметры:
//   ИмяТипаШаблонаСообщений - Строка - имя типа предмета шаблона, которое необходимо переопределить
//   ВидУведомления - СправочникСсылка.ВидУведомления - связанный вид уведомления
Процедура ПриОпределенииИмениТипаШаблонаСообщений(ИмяТипаШаблонаСообщений, ВидУведомления) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииИмениТипаШаблонаСообщений(ИмяТипаШаблонаСообщений, ВидУведомления);
КонецПроцедуры

// Процедура вызывается при подготовке шаблона сообщения и позволяет установить предмет 
// сообщения, отличный от предмета уведомления.
//
// Параметры:
//  СтрокаСообщения	 - СтрокаТЗ - строка данных уведомления, источник данных для переопределения предмета.
//  Предмет			 - ДокументСсылка, СправочникСсылка - предмет сообщения, который можно переопределить.
//
Процедура ПриОпределенииПредметаШаблонаСообщения(СтрокаСообщения, Предмет) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииПредметаШаблонаСообщения(СтрокаСообщения, Предмет);
КонецПроцедуры

// Процедура позволяет переопределить стандартную обработку заполнения прошлого состояния объекта
// и установить свою.
//
// Параметры:
//   Объект                - ДокументОбъект, СправочникОбъект  - источник события - изменившийся объект.
//   СтандартнаяОбработка  - Булево                            - признак стандартной обработки.
//
Процедура ПередЗаписьюПредметаУведомленияОбИзменениях(Объект, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыРасширенный.ПередЗаписьюПредметаУведомленияОбИзменениях(Объект, СтандартнаяОбработка);
КонецПроцедуры

// Процедура позволяет переопределить стандартную обработку события При записи объекта
// и установить свою.
//
// Параметры:
//   Объект                 - ДокументОбъект, СправочникОбъект  - источник события - изменившийся объект.
//   ЕстьРассылки           - Булево                            - признак наличия активных рассылок\
//   ДополнительныеСвойства - Структура                         - перечень параметров, сохраненных перед записью объекта.
//   СтандартнаяОбработка   - Булево                            - признак стандартной обработки.
//   ВыполнятьПерезаписьПриНаличииВРегистре - Булево            - Если истина, то запись будет заполнена в любом случае.
//
Процедура ПриЗаписиПредметаУведомленияОбИзменениях(Объект, ЕстьРассылки, ДополнительныеСвойства, СтандартнаяОбработка, ВыполнятьПерезаписьПриНаличииВРегистре = Ложь) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаписиПредметаУведомленияОбИзменениях(Объект, ЕстьРассылки, ДополнительныеСвойства, СтандартнаяОбработка, ВыполнятьПерезаписьПриНаличииВРегистре);
КонецПроцедуры

// Процедура вызывается при формировании таблицы уведомлений по рассылкам типа "Изменение объекта"
//
// Параметры:
//    РассылкаУведомлений - СправочникСсылка.РассылкаУведомлений - обрабатываемая рассылка уведомлений.
//    ВидУведомления - СправочникСсылка.ВидыУведомлений - обрабатываемый вид уведомления
//    Предмет - СправочникСсылка, ДокументСсылка - ссылка на изменившийся объекта
//    ДатаИзменения - Дата - дата регистрации события изменения объекта.
//    ДополнительныеСвойства - Структура - Дополнительные свойства, которые были заполнены при регистрации изменения объекта
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПриСозданииУведомленийПоИзменениямОбъектов(РассылкаУведомлений, ВидУведомления, Предмет, ДатаИзменения, ДополнительныеСвойства, ТаблицаРезультата) Экспорт
	ЗарплатаКадрыРасширенный.ПриСозданииУведомленийПоИзменениямОбъектов(РассылкаУведомлений, ВидУведомления, Предмет, ДатаИзменения, ДополнительныеСвойства, ТаблицаРезультата);
КонецПроцедуры

// Процедура переопределить контактную информацию, доступную в форме рассылок для типа - объекта владельца контактной информации.
// Параметры:
//     ТаблицаКонтактнойИнформацииДляВидов - ТаблицаЗначений - виды контактной информации.
//     ОписаниеТипов - ОписаниеТипов - указывает тип объекта - владельца контактной информации.
//
Процедура ПриПолученииСпискаКонтактнойИнформацииДляВидов(ТаблицаКонтактнойИнформацииДляВидов, ОписаниеТипов) Экспорт
	
КонецПроцедуры

// Процедура вызывается при формировании сообщения -уведомления по шаблону
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  НазначениеШаблона       - Строка  - Имя назначения шаблон сообщения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщенияПоУведомлению(Сообщение, НазначениеШаблона, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти
