
#Область ОбработчикиСобытий

// Обработчик любого HTTP-метода.
//  Предназначен для обработки входящих сообщений сервера чатботов.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - входящий запрос.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - формируемый ответ.
//
Функция Any(Запрос)
	
	СтруктураОтвета = Чатботы.ОбработатьВходящийHTTPЗапрос(Запрос);
	
	HTTPОтвет = Новый HTTPСервисОтвет(СтруктураОтвета.КодСостояния);
	HTTPОтвет.Причина = СтруктураОтвета.Причина;
	
	Возврат HTTPОтвет;
	
КонецФункции

#КонецОбласти 
