
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.15.0") > 0 Тогда
		УстановитьПлан();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПлан()
	
	ПланГлобальногоПоиска = Вычислить("ГлобальныйПоиск.ПолучитьПлан()");
	ЗаполнитьПлан(ПланГлобальногоПоиска);
	ИсполняемыйФрагмент = "ГлобальныйПоиск.УстановитьПлан(ПланГлобальногоПоиска)";
	#Если ВебКлиент Тогда
		Результат = Вычислить(ИсполняемыйФрагмент);
	#Иначе
		Выполнить(ИсполняемыйФрагмент);
	#КонецЕсли
	
КонецПроцедуры

Процедура ЗаполнитьПлан(ПланГлобальногоПоиска)

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначенияКлиент.ОбщийМодуль("ПоискФизическихЛицГлобальныйПоискКлиент");
		МодульПоискФизическихЛиц.ДополнитьПлан(ПланГлобальногоПоиска);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти