#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежнееЗначение", Константы.ИспользоватьСамообслуживаниеСотрудников.Получить());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПрежнееЗначение") Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Истина И ДополнительныеСвойства.ПрежнееЗначение = Ложь Тогда
		РегистрыСведений.НастройкиСамообслуживанияСотрудников.УстановитьНастройкиПоУмолчанию();
		РегистрыСведений.НастройкиОбученияРазвития.УстановитьНастройкуИспользоватьПубликацииМероприятийОбученияРазвития(Истина);
	КонецЕсли;
	
	Если Значение = Ложь И ДополнительныеСвойства.ПрежнееЗначение = Истина Тогда
		РегистрыСведений.НастройкиСамообслуживанияСотрудников.СброситьНастройки();
		Константы.ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически.Установить(Ложь);
		Константы.СоздаватьПользователейДляПринятыхНаРаботуСотрудниковАвтоматически.Установить(Ложь);
		РегистрыСведений.НастройкиОбученияРазвития.УстановитьНастройкуИспользоватьПубликацииМероприятийОбученияРазвития(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли