
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(Вакансии, ПараметрыВыполненияКоманды)
	НачатьСогласование(Вакансии, ПараметрыВыполненияКоманды.Источник);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСогласование(Вакансии, ФормаИсточник)
	
	УникальныйИдентификатор = ФормаИсточник.УникальныйИдентификатор;
	ДлительнаяОперация = СогласоватьНаСервере(Вакансии, УникальныйИдентификатор);
	
	ПараметрыОповещения = Новый Структура("Вакансии");
	ПараметрыОповещения.Вакансии = Вакансии;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаИсточник);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Согласование вакансий'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьСогласование", ЭтотОбъект, ПараметрыОповещения);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СогласоватьНаСервере(Вакансии, УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура("Вакансии");
	ПараметрыПроцедуры.Вакансии = Вакансии;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Согласование вакансий'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.СогласованиеВакансий.СогласоватьДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);   	
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьСогласование(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось согласовать по причине: 
                  |%1'"),
			Результат.КраткоеПредставлениеОшибки);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	СогласованныеВакансии = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Вакансии = ДополнительныеПараметры.Вакансии;
	
	Если СогласованныеВакансии.Количество() = Вакансии.Количество() Тогда
		ЗаголовокОповещения = НСтр("ru = 'Согласование'");
		ТекстСообщения = НСтр("ru = 'Согласование успешно завершено'");
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, , ТекстСообщения, БиблиотекаКартинок.Информация32);
	Иначе
		ЗаголовокОповещения = НСтр("ru = 'Согласование'");
		ТекстСообщения = НСтр("ru = 'Не все удалось согласовать'");
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, , ТекстСообщения, БиблиотекаКартинок.Ошибка32, СтатусОповещенияПользователя.Важное);
	КонецЕсли;
	
	Оповестить("СогласованиеВакансий_Завершено", СогласованныеВакансии); 
	
КонецПроцедуры

#КонецОбласти