
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеРезультатаОтправки() Экспорт
	
	Результат = Новый Структура(
		"Отправлено,
		|ОписаниеОшибки,
		|ДатаОтправления");
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьРезультатОтправки(Кандидат, Получатель, РезультатОтправки) Экспорт

	МенеджерЗаписи = РегистрыСведений.ОтправкаРезюме.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кандидат = Кандидат;
	МенеджерЗаписи.Получатель = Получатель;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатОтправки);
	МенеджерЗаписи.Комментарий = РезультатОтправки.ОписаниеОшибки;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
