#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПериодичностиФактораВидаРабот(ЭтаФорма, Отказ, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)
	МедицинскиеОсмотрыФормы.ПрочитатьОписаниеПериодичностиВредногоФактораВидаРабот(ЭтаФорма, ТекущийОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Записать(Новый Структура("ПроверятьПериодичность", Ложь));
	
КонецПроцедуры

#КонецОбласти
