#Область ПрограммныйИнтерфейс

// Возвращает значение константы "ИспользоватьЭлектронноеОбучение".
//
// Возвращаемое значение:
//  Булево - значение константы.
//
Функция ИспользоватьЭлектронноеОбучение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьЭлектронноеОбучение.Получить();
	
КонецФункции

// Обновляет значение константы "ИспользоватьЭлектронноеОбучение".
//
// Параметры:
//  Значение - Булево - значение константы.
//
Процедура ОбновитьИспользованиеЭлектронногоОбучения(Знач Значение) Экспорт
	
	Константы.ИспользоватьЭлектронноеОбучение.Установить(Значение);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ИзучениеЭлектронныхКурсов);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ОтветыНаТестовыеВопросы);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РезультатыЭлектронныхТестирований);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПодсистемыПечать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - из менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ИзучениеЭлектронногоКурса);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти