
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Режим = РежимДиалогаВопрос.ДаНет;
	Параметры = Новый Структура;
	Параметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	Параметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	ОП = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры); 
	ПоказатьВопрос(ОП,НСтр("ru = 'Вы уверены что хотите отозвать документ из 1С УТ?';"
	     + " en = 'Do you want to continue?'"), Режим, 0);
		 
	//Если Ответ = КодВозвратаДиалога.Нет Тогда
	//    Возврат;
	//Иначе	
	//	Результат = кдИнтеграцияЗУП_УТ.ОтозватьЗРДС(ПараметрКоманды);
	//	Если Результат Тогда
	//		ПараметрыВыполненияКоманды.Источник.КоманднаяПанель.ПодчиненныеЭлементы.ФормакдИнтеграцияУТ10Статус.Картинка = БиблиотекаКартинок.ЦветПоУмолчанию;
	//	КонецЕсли;
	//КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе	
		Результат = кдИнтеграцияЗУП_УТ.ОтозватьЗРДС(Параметры.ПараметрКоманды);
		Если Результат Тогда
			Параметры.ПараметрыВыполненияКоманды.Источник.КоманднаяПанель.ПодчиненныеЭлементы.ФормакдИнтеграцияУТ10Статус.Картинка = БиблиотекаКартинок.ЦветПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
