#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.НазначениеПоказателейЭффективности.ПолучитьДанныеДляПроведения(Ссылка);
	
	КлючевыеПоказателиЭффективности.СформироватьДвиженияПоказателейПодразделений(Движения, ДанныеДляПроведения.ПоказателиПодразделений, ДанныеДляПроведения.ШкалыПодразделений);
	КлючевыеПоказателиЭффективности.СформироватьДвиженияПоказателейПозиций(Движения, ДанныеДляПроведения.ПоказателиПозиций, ДанныеДляПроведения.ШкалыПозиций);
	КлючевыеПоказателиЭффективности.СформироватьДвиженияМестВводаЗначенийПоказателейЭффективности(Движения, ДанныеДляПроведения.ПодразделенияВводаЗначений, ДанныеДляПроведения.ПозицииВводаЗначений);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Утвержден Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Утвердил");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли