#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьНастройки(Сайт, Использовать, ИмяПользователя = "") Экспорт
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.РекрутинговыйСайт = Сайт;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Использовать = Использовать;
	Если Сайт = ИнтеграцияРекрутинговыхСайтовКлиентСервер.HeadHunter() Тогда
		Если Не МенеджерЗаписи.Выбран() Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Пользователь = Пользователь;
			МенеджерЗаписи.РекрутинговыйСайт = Сайт;
		КонецЕсли;
		Если МенеджерЗаписи.ИмяПользователя <> ИмяПользователя Тогда
			МенеджерЗаписи.МаркерДоступа = "";
			МенеджерЗаписи.МаркерОбновления = "";
			МенеджерЗаписи.ДатаОкончанияДействияМаркераДоступа = Дата(1, 1, 1);
			МенеджерЗаписи.ИдентификаторПользователя = "";
		КонецЕсли;
		МенеджерЗаписи.ИмяПользователя = ИмяПользователя;
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли