
#Область ПрограммныйИнтерфейс

// Заполняет значение показателя расчета заработной платы "ПоказательЭффективностиСотрудника".
//
// Параметры:
// 	- МенеджерВременныхТаблиц - МенеджерВременныхТаблиц, с временными таблицами менеджера расчета
// 	- ДополнительныеПоказатели - структура, содержащая показатели, участвующие в расчете.
//
Процедура ЗаполнитьЗначенияПоказателейЭффективностиСотрудников(МенеджерВременныхТаблиц, ДополнительныеПоказатели) Экспорт 
	
	ПоказательЭффективностиСотрудника = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПоказательЭффективностиСотрудника");
	Если ПоказательЭффективностиСотрудника = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеПоказатели.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ДополнительныеПоказатели.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 3
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 6
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 12
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|	КОНЕЦ КАК Горизонт,
		|	НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ДЕНЬ) КАК Период,
		|	ВЫБОР
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 3
		|			ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, КВАРТАЛ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 6
		|			ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ПОЛУГОДИЕ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 12
		|			ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ГОД)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 3
		|			ТОГДА КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, КВАРТАЛ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 6
		|			ТОГДА КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ПОЛУГОДИЕ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 12
		|			ТОГДА КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ГОД)
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиДаты
		|ИЗ
		|	ВТДополнительныеПоказатели КАК ДополнительныеПоказатели
		|ГДЕ
		|	ДополнительныеПоказатели.Показатель = &ПоказательЭффективностиСотрудника";
	Запрос.УстановитьПараметр("ПоказательЭффективностиСотрудника", ПоказательЭффективностиСотрудника);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТСотрудникиДаты");
		
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВременныхТаблиц, "ВТСотрудникиДаты") Тогда
		ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
		Возврат;
	КонецЕсли;
	
	СоздатьВТОценкиПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДаты");
	УдалитьВТ.Добавить("ВТОценкиПоказателейСотрудников");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТОценкиПоказателейСотрудников.Горизонт КАК Горизонт,
		|	ВТОценкиПоказателейСотрудников.Период КАК Период,
		|	ВТОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ВТОценкиПоказателейСотрудников.УдельнаяОценкаПоказателя) КАК ОценкаПоказателя
		|ПОМЕСТИТЬ ВТЗначенияПоказателейЭффективностиСотрудников
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ВТОценкиПоказателейСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкиПоказателейСотрудников.Горизонт,
		|	ВТОценкиПоказателейСотрудников.Период,
		|	ВТОценкиПоказателейСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеПоказатели.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ДополнительныеПоказатели.Показатель КАК Показатель,
		|	ВЫРАЗИТЬ(ЗначенияПоказателейЭффективностиСотрудников.ОценкаПоказателя КАК ЧИСЛО(15, 2)) КАК Значение
		|ИЗ
		|	ВТСотрудникиДаты КАК СотрудникиДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДополнительныеПоказатели КАК ДополнительныеПоказатели
		|		ПО СотрудникиДаты.ИдентификаторСтроки = ДополнительныеПоказатели.ИдентификаторСтроки
		|			И СотрудникиДаты.Сотрудник = ДополнительныеПоказатели.Сотрудник
		|			И (СотрудникиДаты.Период = НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ДЕНЬ))
		|			И (ДополнительныеПоказатели.Показатель = &ПоказательЭффективностиСотрудника)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияПоказателейЭффективностиСотрудников КАК ЗначенияПоказателейЭффективностиСотрудников
		|		ПО СотрудникиДаты.Сотрудник = ЗначенияПоказателейЭффективностиСотрудников.Сотрудник
		|			И СотрудникиДаты.Горизонт = ЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|			И СотрудникиДаты.Период = ЗначенияПоказателейЭффективностиСотрудников.Период";
	
	УдалитьВТ.Добавить("ВТЗначенияПоказателейЭффективностиСотрудников");
	Запрос.УстановитьПараметр("ПоказательЭффективностиСотрудника", ПоказательЭффективностиСотрудника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДополнительныеПоказатели.Добавить(), Выборка);
	КонецЦикла;
		
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
		
КонецПроцедуры

// Заполняет значение показателя расчета заработной платы "ПоказательЭффективностиСотрудника".
//
// Параметры:
// 	- ДополнительныеПоказатели - структура, содержащая показатели, участвующие в расчете.
// 	- ЗаполняемыеПоказатели - структура, содержащая показатели, участвующие в расчете.
//
Процедура ЗаполнитьЗначенияПоказателейЭффективностиСотрудниковПоТаблицеЗначений(ДополнительныеПоказатели, ЗаполняемыеПоказатели) Экспорт 
	
	ПоказательЭффективностиСотрудника = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПоказательЭффективностиСотрудника");
	Если ПоказательЭффективностиСотрудника = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(Запрос.МенеджерВременныхТаблиц, ДополнительныеПоказатели, "ВТДополнительныеПоказатели");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеПоказатели.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ДополнительныеПоказатели.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 3
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 6
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 12
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|	КОНЕЦ КАК Горизонт,
		|	НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ДЕНЬ) КАК Период,
		|	ВЫБОР
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 3
		|			ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, КВАРТАЛ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 6
		|			ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ПОЛУГОДИЕ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 12
		|			ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ГОД)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 3
		|			ТОГДА КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, КВАРТАЛ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 6
		|			ТОГДА КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ПОЛУГОДИЕ)
		|		КОГДА ДополнительныеПоказатели.Начисление.КоличествоМесяцевБазовогоПериода = 12
		|			ТОГДА КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ГОД)
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиДаты
		|ИЗ
		|	ВТДополнительныеПоказатели КАК ДополнительныеПоказатели
		|ГДЕ
		|	ДополнительныеПоказатели.Показатель = &ПоказательЭффективностиСотрудника";
	Запрос.УстановитьПараметр("ПоказательЭффективностиСотрудника", ПоказательЭффективностиСотрудника);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТСотрудникиДаты");
		
	Если Не ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДаты") Тогда
		ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
		Возврат;
	КонецЕсли;
	
	СоздатьВТОценкиПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДаты");
	УдалитьВТ.Добавить("ВТОценкиПоказателейСотрудников");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТОценкиПоказателейСотрудников.Горизонт КАК Горизонт,
		|	ВТОценкиПоказателейСотрудников.Период КАК Период,
		|	ВТОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ВТОценкиПоказателейСотрудников.УдельнаяОценкаПоказателя) КАК ОценкаПоказателя
		|ПОМЕСТИТЬ ВТЗначенияПоказателейЭффективностиСотрудников
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ВТОценкиПоказателейСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкиПоказателейСотрудников.Горизонт,
		|	ВТОценкиПоказателейСотрудников.Период,
		|	ВТОценкиПоказателейСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеПоказатели.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ДополнительныеПоказатели.Показатель КАК Показатель,
		|	ВЫРАЗИТЬ(ЗначенияПоказателейЭффективностиСотрудников.ОценкаПоказателя КАК ЧИСЛО(15, 2)) КАК Значение
		|ИЗ
		|	ВТСотрудникиДаты КАК СотрудникиДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДополнительныеПоказатели КАК ДополнительныеПоказатели
		|		ПО СотрудникиДаты.ИдентификаторСтроки = ДополнительныеПоказатели.ИдентификаторСтроки
		|			И СотрудникиДаты.Сотрудник = ДополнительныеПоказатели.Сотрудник
		|			И (СотрудникиДаты.Период = НАЧАЛОПЕРИОДА(ДополнительныеПоказатели.ДатаНачала, ДЕНЬ))
		|			И (ДополнительныеПоказатели.Показатель = &ПоказательЭффективностиСотрудника)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияПоказателейЭффективностиСотрудников КАК ЗначенияПоказателейЭффективностиСотрудников
		|		ПО СотрудникиДаты.Сотрудник = ЗначенияПоказателейЭффективностиСотрудников.Сотрудник
		|			И СотрудникиДаты.Горизонт = ЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|			И СотрудникиДаты.Период = ЗначенияПоказателейЭффективностиСотрудников.Период";
	
	УдалитьВТ.Добавить("ВТЗначенияПоказателейЭффективностиСотрудников");
	Запрос.УстановитьПараметр("ПоказательЭффективностиСотрудника", ПоказательЭффективностиСотрудника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЗаполняемыеПоказатели.Добавить(), Выборка);
	КонецЦикла;
		
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Основная процедура расчета сводной оценки KPI.
//
// Параметры:
// 	- МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
// 	- ИмяФильтра - строка - имя временной таблицы, в которой содержатся следующие критерии расчета:
// 		* Сотрудник - СправочникСсылка.Сотрудники.
// 		* Горизонт - ПеречислениеСсылка.Периодичность.
// 		* Период - дата среза, на которую получаются значения набора показателей сотрудника.
// 		* ДатаНачала - дата начала периода получения значений (плановых и фактических).
// 		* ДатаОкончания - дата окончания периода получения значений (плановых и фактических).
//
Процедура СоздатьВТОценкиПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяФильтра) Экспорт

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Получаем кадровые данные.
	ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, ИмяФильтра, "Сотрудник,Период");
		
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТ, Ложь, "ДолжностьПоШтатномуРасписанию, МестоВСтруктуреПредприятия");
	УдалитьВТ.Добавить("ВТКадровыеДанныеСотрудников");
	
	// Получаем действующие на сотрудников показатели.
	СоздатьВТПоказателиСотрудников(Запрос.МенеджерВременныхТаблиц, ИмяФильтра, Ложь);
	УдалитьВТ.Добавить("ВТПоказателиСотрудников");
	
	// Добавляем в отбор период получения данных
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиДаты.Период КАК Период,
		|	СотрудникиДаты.Горизонт КАК Горизонт,
		|	СотрудникиДаты.ДатаНачала КАК ДатаНачала,
		|	СотрудникиДаты.ДатаОкончания КАК ДатаОкончания,
		|	СотрудникиДаты.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Подразделение КАК Подразделение,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.Регистратор КАК Регистратор,
		|	ПоказателиСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиСотрудников.Вес КАК Вес,
		|	ПоказателиСотрудников.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПоказателиСотрудников.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ПоказателиСотрудников.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ПоказателиСотрудников.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ ПоказателиСотрудниковСПериодомПолученияДанных
		|ИЗ
		|	ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТСотрудникиДаты КАК СотрудникиДаты
		|		ПО ПоказателиСотрудников.Сотрудник = СотрудникиДаты.Сотрудник
		|			И ПоказателиСотрудников.Период = СотрудникиДаты.Период
		|			И ПоказателиСотрудников.Горизонт = СотрудникиДаты.Горизонт";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиДаты", ИмяФильтра);
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ПоказателиСотрудниковСПериодомПолученияДанных");
	
	// Получаем плановые значения показателей.
	СоздатьВТПлановыеЗначенияПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ПоказателиСотрудниковСПериодомПолученияДанных");
	УдалитьВТ.Добавить("ВТПлановыеЗначенияПоказателейСотрудников");
	
	// Получаем фактические значения показателей.
	СоздатьВТФактическиеЗначенияПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ПоказателиСотрудниковСПериодомПолученияДанных");
	УдалитьВТ.Добавить("ВТФактическиеЗначенияПоказателейСотрудников");
	
	// Получаем сводим все воедино, получаем шкалы, рассчитываем оценки.
	//
	// Высчитываем удельные веса, получаем набор показателей, нуждающиеся в расчете по шкале.
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ПоказателиСотрудников.Вес) КАК СуммарныйВес
		|ПОМЕСТИТЬ ВТСуммыВесовПоказателейСотрудников
		|ИЗ
		|	ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиСотрудников.Период,
		|	ПоказателиСотрудников.Горизонт,
		|	ПоказателиСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Регистратор КАК РегистраторНазначенияПоказателей,
		|	ПоказателиСотрудников.Подразделение КАК Подразделение,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.ТребуетсяВводПлана КАК ТребуетсяВводПлана,
		|	ПоказателиСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиСотрудников.Вес КАК Вес,
		|	ПоказателиСотрудников.Вес / ВТСуммыВесовПоказателейСотрудников.СуммарныйВес КАК УдельныйВес
		|ПОМЕСТИТЬ ВТПоказателиСотрудниковСУдельнымиВесами
		|ИЗ
		|	ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСуммыВесовПоказателейСотрудников КАК ВТСуммыВесовПоказателейСотрудников
		|		ПО ПоказателиСотрудников.Период = ВТСуммыВесовПоказателейСотрудников.Период
		|			И ПоказателиСотрудников.Горизонт = ВТСуммыВесовПоказателейСотрудников.Горизонт
		|			И ПоказателиСотрудников.Сотрудник = ВТСуммыВесовПоказателейСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Подразделение КАК Подразделение,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.РегистраторНазначенияПоказателей КАК РегистраторНазначенияПоказателей,
		|	ПоказателиСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиСотрудников.Вес КАК Вес,
		|	ПоказателиСотрудников.УдельныйВес КАК УдельныйВес,
		|	ПоказателиСотрудников.ТребуетсяВводПлана КАК ТребуетсяВводПлана,
		|	ПлановыеЗначенияПоказателейСотрудников.ПлановоеЗначение КАК ПлановоеЗначение,
		|	ПлановыеЗначенияПоказателейСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения
		|ПОМЕСТИТЬ ВТПоказателиСотрудниковСУдельнымиВесамиИПлановымиЗначениями
		|ИЗ
		|	ВТПоказателиСотрудниковСУдельнымиВесами КАК ПоказателиСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЗначенияПоказателейСотрудников КАК ПлановыеЗначенияПоказателейСотрудников
		|		ПО ПоказателиСотрудников.Сотрудник = ПлановыеЗначенияПоказателейСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Показатель = ПлановыеЗначенияПоказателейСотрудников.Показатель
		|			И ПоказателиСотрудников.Период = ПлановыеЗначенияПоказателейСотрудников.Период
		|			И ПоказателиСотрудников.Горизонт = ПлановыеЗначенияПоказателейСотрудников.Горизонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.РегистраторНазначенияПоказателей КАК РегистраторНазначенияПоказателей,
		|	ПоказателиСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиСотрудников.ПлановоеЗначение КАК ПлановоеЗначение,
		|	ПоказателиСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ФактическиеЗначенияПоказателейСотрудников.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ФактическиеЗначенияПоказателейСотрудников.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ВЫБОР
		|		КОГДА ПоказателиСотрудников.ТребуетсяВводПлана
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиСотрудников.ПлановоеЗначение = 0
		|						ТОГДА 0
		|					ИНАЧЕ ФактическиеЗначенияПоказателейСотрудников.ФактическоеЗначение / ПоказателиСотрудников.ПлановоеЗначение * 100
		|				КОНЕЦ
		|		ИНАЧЕ ФактическиеЗначенияПоказателейСотрудников.ФактическоеЗначение
		|	КОНЕЦ КАК ЗначениеПоказателя,
		|	ПоказателиСотрудников.Вес КАК Вес
		|ПОМЕСТИТЬ ВТРассчитанныеПоказателиСотрудников
		|ИЗ
		|	ВТПоказателиСотрудниковСУдельнымиВесамиИПлановымиЗначениями КАК ПоказателиСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФактическиеЗначенияПоказателейСотрудников КАК ФактическиеЗначенияПоказателейСотрудников
		|		ПО ПоказателиСотрудников.Сотрудник = ФактическиеЗначенияПоказателейСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Показатель = ФактическиеЗначенияПоказателейСотрудников.Показатель
		|			И ПоказателиСотрудников.Период = ФактическиеЗначенияПоказателейСотрудников.Период
		|			И ПоказателиСотрудников.Горизонт = ФактическиеЗначенияПоказателейСотрудников.Горизонт
		|ГДЕ
		|	НЕ(ПоказателиСотрудников.ТребуетсяВводПлана
		|				И ПоказателиСотрудников.ПлановоеЗначение ЕСТЬ NULL)
		|	И НЕ ФактическиеЗначенияПоказателейСотрудников.ФактическоеЗначение ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСуммыВесовПоказателейСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиСотрудниковСУдельнымиВесами";
	
	УдалитьВТ.Добавить("ВТПоказателиСотрудниковСУдельнымиВесамиИПлановымиЗначениями");
	УдалитьВТ.Добавить("ВТРассчитанныеПоказателиСотрудников");
		
	// Расчет показателей по шкалам.
	ЗапросРасчета = ЗапросВТРассчитанныеОценкиПоказателейСотрудников("ВТРассчитанныеПоказателиСотрудников");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросРасчета);
	УдалитьВТ.Добавить("ВТРассчитанныеОценкиПоказателейСотрудников");
	
	// Собираем итоговый результат.
	ФинальныйТекст =
		"ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Подразделение КАК Подразделение,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.РегистраторНазначенияПоказателей КАК РегистраторНазначенияПоказателей,
		|	ПоказателиСотрудников.ТребуетсяВводПлана КАК ТребуетсяВводПлана,
		|	ПоказателиСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиСотрудников.Вес КАК Вес,
		|	ПоказателиСотрудников.УдельныйВес КАК УдельныйВес,
		|	ПоказателиСотрудников.ПлановоеЗначение КАК ПлановоеЗначение,
		|	ПоказателиСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.ОценкаПоказателя КАК ОценкаПоказателя,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.ОценкаПоказателя * ПоказателиСотрудников.УдельныйВес КАК УдельнаяОценкаПоказателя,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.ЗначениеОт КАК ЗначениеОт,
		|	ВТРассчитанныеОценкиПоказателейСотрудников.ЗначениеДо КАК ЗначениеДо
		|ПОМЕСТИТЬ ВТОценкиПоказателейСотрудников
		|ИЗ
		|	ВТПоказателиСотрудниковСУдельнымиВесамиИПлановымиЗначениями КАК ПоказателиСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРассчитанныеОценкиПоказателейСотрудников КАК ВТРассчитанныеОценкиПоказателейСотрудников
		|		ПО ПоказателиСотрудников.Период = ВТРассчитанныеОценкиПоказателейСотрудников.Период
		|			И ПоказателиСотрудников.Сотрудник = ВТРассчитанныеОценкиПоказателейСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Показатель = ВТРассчитанныеОценкиПоказателейСотрудников.Показатель
		|			И ПоказателиСотрудников.Горизонт = ВТРассчитанныеОценкиПоказателейСотрудников.Горизонт";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ФинальныйТекст);
	
	УстановитьПривилегированныйРежим(Истина);	
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

Процедура ПриОпределенииДополнительныхПоказателей(ДополнительныеПоказатели) Экспорт
	ПоказательЭффективностиСотрудника = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПоказательЭффективностиСотрудника");

	Если ПоказательЭффективностиСотрудника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПоказатели.Добавить(ПоказательЭффективностиСотрудника);	
КонецПроцедуры

Процедура СоздатьПоказательИНачислениеДоплатаПоРезультатамОценкиЭффективности() Экспорт 
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКлючевыеПоказателиЭффективности") Тогда
		Возврат;
	КонецЕсли;
	
	ПоказательЭффективностиСотрудника = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПоказательЭффективностиСотрудника");
	Если ПоказательЭффективностиСотрудника <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СоздатьПоказательЭффективностиСотрудника();
	ОбновитьПовторноИспользуемыеЗначения();
	
	КоллекторНачислений = Новый Соответствие;
	СвойстваНачислений = ПланыВидовРасчета.Начисления.СвойстваНачисленийПоКатегориям();
	ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	
	СоздатьНачислениеДоплатаПоРезультатамОценкиЭффективности(ПараметрыПланаВидовРасчета, СвойстваНачислений, КоллекторНачислений);
	
	Для Каждого КлючИЗначение Из КоллекторНачислений Цикл
		КлючИЗначение.Значение.ДополнительныеСвойства.Вставить("ИзменениеПланаВидовРасчетаПоНастройкам", Истина);
	КонецЦикла;
	
	ПланыВидовРасчета.Начисления.ЗаписатьВидыРасчетаКоллектора(КоллекторНачислений, СвойстваНачислений);
	
КонецПроцедуры

#Область ОбработчикиОбновления

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.7.4";
	Обработчик.Процедура = "КлючевыеПоказателиЭффективности.ЗаполнитьПустыеГоризонты";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("52e05870-c423-4658-bb18-c6cfacd43898");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение нового реквизита ""Горизонт планирования"" для объектов подсистемы ""Ключевые показатели эффективности"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.7.4";
	Обработчик.Процедура = "КлючевыеПоказателиЭффективности.ЗаполнитьПозицииВСотрудниковыхДокументах";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8182fb50-9621-4f21-8eca-afab82604f54");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение позиций сотрудников для ""сотрудниковых"" документов подсистемы ""Ключевые показатели эффективности"".'");
	
КонецПроцедуры

#КонецОбласти

#Область ПоказателиОбъектов

Функция СписокПоказателейПодразделенийПоОтветственным(Период, КоллекцияОтборов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период
		|ПОМЕСТИТЬ ВТФильтр";
	Запрос.УстановитьПараметр("Период", Период);
	
	ЗапросОтветственных = ЗапросВТПодразделенияВводаЗначенийПоказателей("ВТФильтр", "", КоллекцияОтборов);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственных);
	
	ТекстИтоговогоЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПодразделенияВводаЗначенийПоказателей.Показатель КАК Показатель
		|ИЗ
		|	ВТПодразделенияВводаЗначенийПоказателей КАК ВТПодразделенияВводаЗначенийПоказателей 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделенияВводаЗначенийПоказателей";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстИтоговогоЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Показатель");
	
КонецФункции

Функция СписокПоказателейПозицийПоОтветственным(Период, КоллекцияОтборов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период
		|ПОМЕСТИТЬ ВТФильтр";
	Запрос.УстановитьПараметр("Период", Период);
	
	ЗапросОтветственных = ЗапросВТПозицииВводаЗначенийПоказателей("ВТФильтр", "", КоллекцияОтборов);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственных);
	
	ТекстИтоговогоЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПозицииВводаЗначенийПоказателей.Показатель КАК Показатель
		|ИЗ
		|	ВТПозицииВводаЗначенийПоказателей КАК ВТПозицииВводаЗначенийПоказателей 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПозицииВводаЗначенийПоказателей";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстИтоговогоЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Показатель");
	
КонецФункции

Функция ПоказателиПодразделений(Подразделения, Период, Горизонт) Экспорт

	Если Не ЗначениеЗаполнено(Подразделения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Подразделения) <> Тип("Массив") Тогда
		МассивПодразделений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделения);
	Иначе
		МассивПодразделений = Подразделения;
	КонецЕсли;
	
	// Получаем назначенные показатели.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	&Горизонт КАК Горизонт,
		|	&Период КАК Период
		|ПОМЕСТИТЬ ВТПодразделенияПериоды
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка В(&МассивПодразделений)";
	Запрос.УстановитьПараметр("Горизонт", Горизонт);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	СоздатьВТПоказателиПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТПодразделенияПериоды");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиПодразделений.Период КАК Период,
		|	ПоказателиПодразделений.Горизонт КАК Горизонт,
		|	ПоказателиПодразделений.Подразделение КАК Подразделение,
		|	ПоказателиПодразделений.Показатель КАК Показатель,
		|	ПоказателиПодразделений.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиПодразделений.Вес КАК Вес,
		|	ПоказателиПодразделений.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПоказателиПодразделений.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ПоказателиПодразделений.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ПоказателиПодразделений.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ИЗ
		|	ВТПоказателиПодразделений КАК ПоказателиПодразделений";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

Функция ПоказателиПозиции(Позиции, Период, Горизонт) Экспорт

	Если Не ЗначениеЗаполнено(Позиции) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
		МассивПозиций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Позиции);
	Иначе
		МассивПозиций = Позиции;
	КонецЕсли;
	
	// Создание ВТНазначенныеПоказателиПозиций.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШтатноеРасписание.Ссылка КАК Позиция,
		|	&Горизонт КАК Горизонт,
		|	&Период КАК Период
		|ПОМЕСТИТЬ ВТПозицииПериоды
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Ссылка В(&МассивПозиций)";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Горизонт", Горизонт);
	Запрос.УстановитьПараметр("МассивПозиций", МассивПозиций);
	
	Запрос.Выполнить();
	
	СоздатьВТПоказателиПозиций(Запрос.МенеджерВременныхТаблиц, "ВТПозицииПериоды");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиПозиций.Период КАК Период,
		|	ПоказателиПозиций.Горизонт КАК Горизонт,
		|	ПоказателиПозиций.Позиция КАК Позиция,
		|	ПоказателиПозиций.Показатель КАК Показатель,
		|	ПоказателиПозиций.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ПоказателиПозиций.Вес КАК Вес,
		|	ПоказателиПозиций.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПоказателиПозиций.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ПоказателиПозиций.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ПоказателиПозиций.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ИЗ
		|	ВТПоказателиПозиций КАК ПоказателиПозиций";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ЗапросВТПоказателиЭффективностиРодителейПодразделения(РеквизитыОбъекта, ВключаяСамоПодразделение) Экспорт 

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Подразделение", РеквизитыОбъекта.Подразделение);
	Запрос.УстановитьПараметр("Период", РеквизитыОбъекта.Период);
	Запрос.УстановитьПараметр("Горизонт", РеквизитыОбъекта.Горизонт);
	Запрос.УстановитьПараметр("ВключаяСамоПодразделение", ВключаяСамоПодразделение);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Горизонт КАК Горизонт,
		|	ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница КАК Подразделение,
		|	ПодчиненностьСтруктурныхЕдиниц.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТРодителиПодразделенияВнутренний
		|ИЗ
		|	РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
		|ГДЕ
		|	ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница = &Подразделение
		|	И (&ВключаяСамоПодразделение
		|			ИЛИ ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница <> &Подразделение)";
	
	ЗапросАктуальныеПоказателиПодразделений = ЗапросВТАктуальныеПоказателиЭффективностиПодразделений("ВТРодителиПодразделенияВнутренний");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ЗапросАктуальныеПоказателиПодразделений.Текст);
	
	ИтоговыйТекст = 
		"ВЫБРАТЬ
		|	ВТРодители.Период КАК Период,
		|	ПоказателиЭффективностиПодразделенийСрезПоследних.ПериодЗаписи КАК ПериодЗаписи,
		|	ВТРодители.Горизонт КАК Горизонт,
		|	ВТРодители.Подразделение КАК Подразделение,
		|	ВТРодители.Уровень КАК Уровень,
		|	ПоказателиЭффективностиПодразделенийСрезПоследних.Показатель КАК Показатель,
		|	ПоказателиЭффективностиПодразделенийСрезПоследних.Вес КАК Вес,
		|	ПоказателиЭффективностиПодразделенийСрезПоследних.Подразделение КАК МестоВводаЗначений,
		|	ПодразделенияВводаЗначений.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПодразделенияВводаЗначений.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта
		|ПОМЕСТИТЬ ВТПоказателиЭффективностиРодителейПодразделения
		|ИЗ
		|	ВТРодителиПодразделенияВнутренний КАК ВТРодители
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеПоказателиЭффективностиПодразделений КАК ПоказателиЭффективностиПодразделенийСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодразделенияВводаЗначенийПоказателейЭффективности КАК ПодразделенияВводаЗначений
		|			ПО ПоказателиЭффективностиПодразделенийСрезПоследних.Горизонт = ПодразделенияВводаЗначений.Горизонт
		|				И ПоказателиЭффективностиПодразделенийСрезПоследних.Показатель = ПодразделенияВводаЗначений.Показатель
		|				И ПоказателиЭффективностиПодразделенийСрезПоследних.МестоВводаЗначений = ПодразделенияВводаЗначений.Подразделение
		|				И ПоказателиЭффективностиПодразделенийСрезПоследних.ПериодЗаписи = ПодразделенияВводаЗначений.Период
		|		ПО ВТРодители.Горизонт = ПоказателиЭффективностиПодразделенийСрезПоследних.Горизонт
		|			И ВТРодители.Подразделение = ПоказателиЭффективностиПодразделенийСрезПоследних.МестоВводаЗначений
		|			И ВТРодители.Период = ПоказателиЭффективностиПодразделенийСрезПоследних.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРодителиПодразделенияВнутренний
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТАктуальныеПоказателиЭффективностиПодразделений";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ИтоговыйТекст);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область ОбъектыПоПоказателю

Функция ТаблицаПодразделенийПоПоказателю(Период, Показатель, КоллекцияОтборов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период, 
		|	&Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТФильтр";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	
	ЗапросОтветственных = ЗапросВТПодразделенияВводаЗначенийПоказателей("ВТФильтр", "Показатель", КоллекцияОтборов);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственных);
	
	ТекстИтоговогоЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПодразделенияВводаЗначенийПоказателей.Подразделение КАК Подразделение
		|ИЗ
		|	ВТПодразделенияВводаЗначенийПоказателей КАК ВТПодразделенияВводаЗначенийПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделенияВводаЗначенийПоказателей";
			
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстИтоговогоЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ТаблицаПозицийПоПоказателю(Период, Показатель, КоллекцияОтборов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период, 
		|	&Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТФильтр";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	
	ЗапросОтветственных = ЗапросВТПозицииВводаЗначенийПоказателей("ВТФильтр", "Показатель", КоллекцияОтборов);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственных);
	
	ТекстИтоговогоЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПозицииВводаЗначенийПоказателей.Позиция КАК Позиция
		|ИЗ
		|	ВТПозицииВводаЗначенийПоказателей КАК ВТПозицииВводаЗначенийПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПозицииВводаЗначенийПоказателей";
			
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстИтоговогоЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ПлановыеПоказатели

Функция ВведенныеПлановыеЗначенияПоказателейПодразделений(ТаблицаФильтра, ИсключаемыйРегистратор = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	УдалитьВТ = Новый Массив;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФильтра.ПериодДействия КАК ПериодДействия,
		|	ТаблицаФильтра.Горизонт КАК Горизонт,
		|	ТаблицаФильтра.Подразделение КАК Подразделение,
		|	ТаблицаФильтра.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТТаблицаФильтра
		|ИЗ
		|	&ТаблицаФильтра КАК ТаблицаФильтра";
	Запрос.УстановитьПараметр("ТаблицаФильтра", ТаблицаФильтра);
	УдалитьВТ.Добавить("ВТТаблицаФильтра");
	
	ЗапросВведенныеПлановыеЗначения = ЗапросВТВведенныеПлановыеЗначенияПоказателейПодразделений("ВТТаблицаФильтра", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросВведенныеПлановыеЗначения);
	
	ВозвращаемаяТаблица = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ВозвращаемаяТаблица;

КонецФункции

Функция ВведенныеПлановыеЗначенияПоказателейПозиций(ТаблицаФильтра, ИсключаемыйРегистратор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	УдалитьВТ = Новый Массив;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФильтра.ПериодДействия КАК ПериодДействия,
		|	ТаблицаФильтра.Горизонт КАК Горизонт,
		|	ТаблицаФильтра.Позиция КАК Позиция,
		|	ТаблицаФильтра.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТТаблицаФильтра
		|ИЗ
		|	&ТаблицаФильтра КАК ТаблицаФильтра";
	Запрос.УстановитьПараметр("ТаблицаФильтра", ТаблицаФильтра);
	УдалитьВТ.Добавить("ВТТаблицаФильтра");
	
	ЗапросВведенныеПлановыеЗначения = ЗапросВТВведенныеПлановыеЗначенияПоказателейПозиций("ВТТаблицаФильтра", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросВведенныеПлановыеЗначения);
	
	ВозвращаемаяТаблица = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ВозвращаемаяТаблица;

КонецФункции

Функция ВведенныеПлановыеЗначенияПоказателейСотрудников(ТаблицаФильтра, ИсключаемыйРегистратор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	УдалитьВТ = Новый Массив;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФильтра.ПериодДействия КАК ПериодДействия,
		|	ТаблицаФильтра.Горизонт КАК Горизонт,
		|	ТаблицаФильтра.Сотрудник КАК Сотрудник,
		|	ТаблицаФильтра.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТТаблицаФильтра
		|ИЗ
		|	&ТаблицаФильтра КАК ТаблицаФильтра";
	Запрос.УстановитьПараметр("ТаблицаФильтра", ТаблицаФильтра);
	УдалитьВТ.Добавить("ВТТаблицаФильтра");
	
	ЗапросВведенныеПлановыеЗначения = ЗапросВТВведенныеПлановыеЗначенияПоказателейСотрудников("ВТТаблицаФильтра", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросВведенныеПлановыеЗначения);
	
	ВозвращаемаяТаблица = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ВозвращаемаяТаблица;

КонецФункции

#КонецОбласти

#Область ФактическиеПоказатели

Функция ВведенныеФактическиеЗначенияПоказателейПодразделений(ТаблицаФильтра, ИсключаемыйРегистратор = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	УдалитьВТ = Новый Массив;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФильтра.ДатаНачала КАК ДатаНачала,
		|	ТаблицаФильтра.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаФильтра.Горизонт КАК Горизонт,
		|	ТаблицаФильтра.Подразделение КАК Подразделение,
		|	ТаблицаФильтра.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТТаблицаФильтра
		|ИЗ
		|	&ТаблицаФильтра КАК ТаблицаФильтра";
	Запрос.УстановитьПараметр("ТаблицаФильтра", ТаблицаФильтра);
	УдалитьВТ.Добавить("ВТТаблицаФильтра");
	
	ЗапросВведенныеПлановыеЗначения = ЗапросВТВведенныеФактическиеЗначенияПоказателейПодразделений("ВТТаблицаФильтра", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросВведенныеПлановыеЗначения);
	
	ВозвращаемаяТаблица = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ВозвращаемаяТаблица;

КонецФункции

Функция ВведенныеФактическиеЗначенияПоказателейСотрудников(ТаблицаФильтра, ИсключаемыйРегистратор = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	УдалитьВТ = Новый Массив;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФильтра.ДатаНачала КАК ДатаНачала,
		|	ТаблицаФильтра.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаФильтра.Горизонт КАК Горизонт,
		|	ТаблицаФильтра.Сотрудник КАК Сотрудник,
		|	ТаблицаФильтра.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТТаблицаФильтра
		|ИЗ
		|	&ТаблицаФильтра КАК ТаблицаФильтра";
	Запрос.УстановитьПараметр("ТаблицаФильтра", ТаблицаФильтра);
	УдалитьВТ.Добавить("ВТТаблицаФильтра");
	
	ЗапросВведенныеПлановыеЗначения = ЗапросВТВведенныеФактическиеЗначенияПоказателеСотрудников("ВТТаблицаФильтра", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросВведенныеПлановыеЗначения);
	
	ВозвращаемаяТаблица = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ВозвращаемаяТаблица;

КонецФункции

#КонецОбласти

#Область ДвиженияДокументов

// Заполняет движения ПоказателиЭффективностиПодразделений и ШкалыПоказателиЭффективностиПодразделений.
//
// Параметры:
//	Движения - коллекция движений, в которой необходимо заполнить движения.
//
Процедура СформироватьДвиженияПоказателейПодразделений(Движения, ПоказателиПодразделений, ШкалыПодразделений) Экспорт

	СформироватьКоллекциюДвижений(Движения.ПоказателиЭффективностиПодразделений, ПоказателиПодразделений);
	СформироватьКоллекциюДвижений(Движения.ШкалыПоказателиЭффективностиПодразделений, ШкалыПодразделений);
	
КонецПроцедуры

// Заполняет движения ПоказателиЭффективностиПозиций и ШкалыПоказателиЭффективностиПозиций.
//
// Параметры:
//	Движения - коллекция движений, в которой необходимо заполнить движения.
//
Процедура СформироватьДвиженияПоказателейПозиций(Движения, ПоказателиПозиций, ШкалыПозиций) Экспорт

	СформироватьКоллекциюДвижений(Движения.ПоказателиЭффективностиПозиций, ПоказателиПозиций);
	СформироватьКоллекциюДвижений(Движения.ШкалыПоказателиЭффективностиПозиций, ШкалыПозиций);
	
КонецПроцедуры

// Заполняет движения ПодразделенияВводаЗначенийПоказателейЭффективности И ПозицииВводаЗначенийПоказателейЭффективности.
//
// Параметры:
//	Движения - коллекция движений, в которой необходимо заполнить движения.
//
Процедура СформироватьДвиженияМестВводаЗначенийПоказателейЭффективности(Движения, ПодразделенияВводаЗначений, ПозицииВводаЗначений) Экспорт
	
	СформироватьКоллекциюДвижений(Движения.ПодразделенияВводаЗначенийПоказателейЭффективности, ПодразделенияВводаЗначений);
	СформироватьКоллекциюДвижений(Движения.ПозицииВводаЗначенийПоказателейЭффективности, ПозицииВводаЗначений);
	
КонецПроцедуры

Процедура СформироватьДвиженияПлановыеЗначенияПоказателейЭффективностиПодразделений(Движения, ПланПодразделений) Экспорт
	СформироватьКоллекциюДвижений(Движения.ПлановыеЗначенияПоказателейЭффективностиПодразделений, ПланПодразделений);
КонецПроцедуры

Процедура СформироватьДвиженияПлановыеЗначенияПоказателейЭффективностиПозиций(Движения, ПланПозиций) Экспорт
	СформироватьКоллекциюДвижений(Движения.ПлановыеЗначенияПоказателейЭффективностиПозиций, ПланПозиций);
КонецПроцедуры

Процедура СформироватьДвиженияПлановыеЗначенияПоказателейЭффективностиСотрудников(Движения, ПланСотрудников) Экспорт
	СформироватьКоллекциюДвижений(Движения.ПлановыеЗначенияПоказателейЭффективностиСотрудников, ПланСотрудников);
КонецПроцедуры

Процедура СформироватьДвиженияФактическиеЗначенияПоказателейЭффективностиПодразделений(Движения, ФактПодразделений) Экспорт
	СформироватьКоллекциюДвижений(Движения.ФактическиеЗначенияПоказателейЭффективностиПодразделений, ФактПодразделений);
КонецПроцедуры

Процедура СформироватьДвиженияФактическиеЗначенияПоказателейЭффективностиСотрудников(Движения, ФактСотрудников) Экспорт
	СформироватьКоллекциюДвижений(Движения.ФактическиеЗначенияПоказателейЭффективностиСотрудников, ФактСотрудников);
КонецПроцедуры

#КонецОбласти

#Область ПанельНастроекУправлениеПерсоналом

Процедура ПанельУправлениеПерсоналомПрочитатьНастройкиКлючевыхПоказателейЭффективности(Форма) Экспорт
	
	Настройки = РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	Форма.ЗначениеВРеквизитФормы(Настройки, "НастройкиКлючевыхПоказателейЭффективности");
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаписатьКонстантуИспользоватьКлючевыеПоказателиЭффективности(Значение) Экспорт
	
	Константы.ИспользоватьКлючевыеПоказателиЭффективности.Установить(Значение);
	
	СоздатьПоказательИНачислениеДоплатаПоРезультатамОценкиЭффективности();
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаписатьНастройкиКлючевыхПоказателейЭффективности(Параметры, ПараметрыНастроек) Экспорт
	
	Если ПараметрыНастроек.НастройкиКлючевыхПоказателейЭффективности Тогда
		
		Настройки = РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиКлючевыхПоказателейЭффективности);
		Настройки.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаполнитьНастройкиКлючевыхПоказателейЭффективности(Форма, ПараметрыНастроек) Экспорт 
	
	ПараметрыНастроек.НастройкиКлючевыхПоказателейЭффективности = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
		Форма.НастройкиКлючевыхПоказателейЭффективности, Метаданные.РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности);
		
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомДополнитьСтрокуКонстант(СтрокаКонстант) Экспорт 
	СтрокаКонстант = СтрокаКонстант + ",ИспользоватьКлючевыеПоказателиЭффективности";
КонецПроцедуры

#КонецОбласти

Функция ПоказателиСтрокой(Показатели) Экспорт

	МассивПоказателей = ОбщегоНазначения.ВыгрузитьКолонку(Показатели, "Показатель", Истина);
	
	СоответствиеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивПоказателей, "Наименование, КраткоеНаименование");
	
	ПоказателиСтрокой = "";
	
	Для каждого СтрокаПоказателя Из СоответствиеРеквизитов Цикл
		ПоказателиСтрокой = ПоказателиСтрокой + ?(ПустаяСтрока(ПоказателиСтрокой), "", ", ")
			+ ?(ЗначениеЗаполнено(СтрокаПоказателя.Значение.КраткоеНаименование), СтрокаПоказателя.Значение.КраткоеНаименование, Лев(СтрокаПоказателя.Значение.Наименование, 30));
	КонецЦикла; 

	Возврат ПоказателиСтрокой;
	
КонецФункции

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НазначениеПоказателейЭффективности", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланПоказателейЭффективностиПодразделения", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланПоказателейЭффективностиПозиции", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланПоказателейЭффективностиСотрудника", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланПоказателяЭффективностиПодразделений", "Период", "Мотивация", "Подразделения.Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланПоказателяЭффективностиПозиций", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФактПоказателейЭффективностиПодразделения", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФактПоказателейЭффективностиСотрудника", "Период", "Мотивация", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФактПоказателяЭффективностиПодразделений", "Период", "Мотивация", "Подразделения.Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФактПоказателяЭффективностиСотрудников", "Период", "Мотивация", "Подразделение.Источник");

КонецПроцедуры

Процедура СоздатьВТПериодыРаботыСотрудниковПоСпискуПозиций(МенеджерВременныхТаблиц, ИмяВТПозиции, СтруктураРеквизитовПериода) Экспорт

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Получаем список сотрудников.
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПозиции.Позиция КАК Позиция
		|ИЗ
		|	#ВТПозиции КАК ВТПозиции";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПозиции", ИмяВТПозиции);
	
	РезультатПозиций = Запрос.Выполнить();
	МассивПозиций = РезультатПозиций.Выгрузить().ВыгрузитьКолонку("Позиция");
	
	ДатыПериода = КлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(СтруктураРеквизитовПериода.Период, СтруктураРеквизитовПериода.Горизонт);
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.НачалоПериода = ДатыПериода.ДатаНачала;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = ДатыПериода.ДатаОкончания;
	ПараметрыПолученияСотрудников.КадровыеДанные = "ДолжностьПоШтатномуРасписанию";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПолученияСотрудников.Отборы, "ДолжностьПоШтатномуРасписанию", "В", МассивПозиций);
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	УдалитьВТ.Добавить("ВТСотрудникиОрганизации");
	
	// Получаем периоды работы сотрудников.
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	    |	&ДатаНачала КАК ДатаНачала,
	    |	&ДатаОкончания КАК ДатаОкончания
	    |ПОМЕСТИТЬ ВТФильтрДляПериодовРаботыСотрудников
	    |ИЗ
	    |	ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников";
	Запрос.УстановитьПараметр("ДатаНачала", ДатыПериода.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатыПериода.ДатаОкончания);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТФильтрДляПериодовРаботыСотрудников");
	
	ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрДляПериодовРаботыСотрудников", "Сотрудник"),
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра(),
		"ВТРабочиеМестаСотрудников");
		
	УдалитьВТ.Добавить("ВТРабочиеМестаСотрудников");
	
	// Итоговый запрос.
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	    |	ВЫБОР
	    |		КОГДА ПериодыРаботыСотрудников.НачалоПериода < ФильтрДляПериодовРаботыСотрудников.ДатаНачала
	    |			ТОГДА ФильтрДляПериодовРаботыСотрудников.ДатаНачала
	    |		ИНАЧЕ ПериодыРаботыСотрудников.НачалоПериода
	    |	КОНЕЦ КАК ДатаНачала,
	    |	ВЫБОР
	    |		КОГДА ПериодыРаботыСотрудников.КонецПериода > ФильтрДляПериодовРаботыСотрудников.ДатаОкончания
	    |			ТОГДА ФильтрДляПериодовРаботыСотрудников.ДатаОкончания
	    |		ИНАЧЕ ПериодыРаботыСотрудников.КонецПериода
	    |	КОНЕЦ КАК ДатаОкончания,
	    |	ПериодыРаботыСотрудников.ДолжностьПоШтатномуРасписанию КАК Позиция,
	    |	ПериодыРаботыСотрудников.Подразделение КАК Подразделение
	    |ПОМЕСТИТЬ ВТПериодыРаботыСотрудников
	    |ИЗ
	    |	ВТРабочиеМестаСотрудников КАК ПериодыРаботыСотрудников
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТПозиции КАК ВТПозиции
	    |		ПО ПериодыРаботыСотрудников.ДолжностьПоШтатномуРасписанию = ВТПозиции.Позиция
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФильтрДляПериодовРаботыСотрудников КАК ФильтрДляПериодовРаботыСотрудников
	    |		ПО ПериодыРаботыСотрудников.Сотрудник = ФильтрДляПериодовРаботыСотрудников.Сотрудник
	    |ГДЕ
	    |	ПериодыРаботыСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПозиции", ИмяВТПозиции);
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf7c-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.НазначениеПоказателейЭффективности);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf66-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПланПоказателейЭффективностиПодразделения);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbefd-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПланПоказателейЭффективностиПозиции);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf62-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПланПоказателейЭффективностиСотрудника);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfca-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПланПоказателяЭффективностиПодразделений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4fb-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПланПоказателяЭффективностиПозиций);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf33-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ФактПоказателейЭффективностиПодразделения);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbeed-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ФактПоказателейЭффективностиСотрудника);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbff7-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ФактПоказателяЭффективностиПодразделений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf23-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ФактПоказателяЭффективностиСотрудников);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4e0-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.СтруктураЦелей);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.НазначениеПоказателейЭффективности, Истина);
	Списки.Вставить(Метаданные.Справочники.НазначениеПоказателейЭффективностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПоказателейЭффективностиПодразделения, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПоказателейЭффективностиПодразделенияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПоказателейЭффективностиПозиции, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПоказателейЭффективностиПозицииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПоказателейЭффективностиСотрудника, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПоказателейЭффективностиСотрудникаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПоказателяЭффективностиПодразделений, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПоказателяЭффективностиПодразделенийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПоказателяЭффективностиПозиций, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПоказателяЭффективностиПозицийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ФактПоказателейЭффективностиПодразделения, Истина);
	Списки.Вставить(Метаданные.Справочники.ФактПоказателейЭффективностиПодразделенияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ФактПоказателейЭффективностиСотрудника, Истина);
	Списки.Вставить(Метаданные.Справочники.ФактПоказателейЭффективностиСотрудникаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ФактПоказателяЭффективностиПодразделений, Истина);
	Списки.Вставить(Метаданные.Справочники.ФактПоказателяЭффективностиПодразделенийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ФактПоказателяЭффективностиСотрудников, Истина);
	Списки.Вставить(Метаданные.Справочники.ФактПоказателяЭффективностиСотрудниковПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ПланПоказателейЭффективности, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ФактПоказателейЭффективности, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.НазначениеПоказателейЭффективности);
	СписокОбъектов.Добавить(Документы.ПланПоказателейЭффективностиПодразделения);
	СписокОбъектов.Добавить(Документы.ПланПоказателейЭффективностиПозиции);
	СписокОбъектов.Добавить(Документы.ПланПоказателейЭффективностиСотрудника);
	СписокОбъектов.Добавить(Документы.ПланПоказателяЭффективностиПодразделений);
	СписокОбъектов.Добавить(Документы.ПланПоказателяЭффективностиПозиций);
	СписокОбъектов.Добавить(Документы.ФактПоказателейЭффективностиПодразделения);
	СписокОбъектов.Добавить(Документы.ФактПоказателейЭффективностиСотрудника);
	СписокОбъектов.Добавить(Документы.ФактПоказателяЭффективностиПодразделений);
	СписокОбъектов.Добавить(Документы.ФактПоказателяЭффективностиСотрудников);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапросВТРассчитанныеОценкиПоказателейСотрудников(ИмяФильтра = "ВТРассчитанныеПоказателиСотрудников")

	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТРассчитанныеПоказателиСотрудников.Период КАК Период,
		|	ВТРассчитанныеПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ВТРассчитанныеПоказателиСотрудников.ВладелецПоказателя КАК Подразделение,
		|	ВТРассчитанныеПоказателиСотрудников.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТРассчитанныеПоказателиВладелецПодразделения
		|ИЗ
		|	#ВТРассчитанныеПоказателиСотрудников КАК ВТРассчитанныеПоказателиСотрудников
		|ГДЕ
		|	ВТРассчитанныеПоказателиСотрудников.ВладелецПоказателя ССЫЛКА Справочник.СтруктураПредприятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРассчитанныеПоказателиСотрудников.Период КАК Период,
		|	ВТРассчитанныеПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ВТРассчитанныеПоказателиСотрудников.ВладелецПоказателя КАК Позиция,
		|	ВТРассчитанныеПоказателиСотрудников.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТРассчитанныеПоказателиВладелецПозиции
		|ИЗ
		|	#ВТРассчитанныеПоказателиСотрудников КАК ВТРассчитанныеПоказателиСотрудников
		|ГДЕ
		|	ВТРассчитанныеПоказателиСотрудников.ВладелецПоказателя ССЫЛКА Справочник.ШтатноеРасписание";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТРассчитанныеПоказателиСотрудников", ИмяФильтра);
	
	// Получаем шкалы.
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТРассчитанныеПоказателиВладелецПодразделения", "Подразделение,Показатель,Горизонт");
	ЗапросШкалПодразделений = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ШкалыПоказателиЭффективностиПодразделений",
		Ложь,
		ОписаниеФильтра,
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез(),,
		"ВТШкалыПоказателиЭффективностиПодразделений");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросШкалПодразделений);
		
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТРассчитанныеПоказателиВладелецПозиции", "Позиция,Показатель,Горизонт");
	ЗапросШкалПозиций = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ШкалыПоказателиЭффективностиПозиций",
		Ложь,
		ОписаниеФильтра,
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез(),,
		"ВТШкалыПоказателиЭффективностиПозиций");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросШкалПозиций);
	
	ТекстРасчета =
		"ВЫБРАТЬ
		|	РассчитанныеПоказателиСотрудников.Период КАК Период,
		|	РассчитанныеПоказателиСотрудников.Горизонт КАК Горизонт,
		|	РассчитанныеПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	РассчитанныеПоказателиСотрудников.Показатель КАК Показатель,
		|	ШкалыПоказателиЭффективностиПодразделений.ЗначениеДо КАК ЗначениеДо,
		|	ШкалыПоказателиЭффективностиПодразделений.ЗначениеОт КАК ЗначениеОт,
		|	ШкалыПоказателиЭффективностиПодразделений.Оценка КАК Оценка,
		|	ШкалыПоказателиЭффективностиПодразделений.ОценкаЗадаетсяИнтервалом КАК ОценкаЗадаетсяИнтервалом,
		|	ШкалыПоказателиЭффективностиПодразделений.ИнтервалОценкиОт КАК ИнтервалОценкиОт,
		|	ШкалыПоказателиЭффективностиПодразделений.ИнтервалОценкиДо КАК ИнтервалОценкиДо,
		|	ШкалыПоказателиЭффективностиПодразделений.Показатель.ОбратнаяШкала КАК ПоказательОбратнаяШкала
		|ПОМЕСТИТЬ ВТПоказателиСотрудниковСоШкаламиЗначений
		|ИЗ
		|	ВТРассчитанныеПоказателиСотрудников КАК РассчитанныеПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШкалыПоказателиЭффективностиПодразделений КАК ШкалыПоказателиЭффективностиПодразделений
		|		ПО РассчитанныеПоказателиСотрудников.ВладелецПоказателя = ШкалыПоказателиЭффективностиПодразделений.Подразделение
		|			И РассчитанныеПоказателиСотрудников.Показатель = ШкалыПоказателиЭффективностиПодразделений.Показатель
		|			И РассчитанныеПоказателиСотрудников.Период = ШкалыПоказателиЭффективностиПодразделений.Период
		|			И РассчитанныеПоказателиСотрудников.Горизонт = ШкалыПоказателиЭффективностиПодразделений.Горизонт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РассчитанныеПоказателиСотрудников.Период,
		|	РассчитанныеПоказателиСотрудников.Горизонт,
		|	РассчитанныеПоказателиСотрудников.Сотрудник,
		|	РассчитанныеПоказателиСотрудников.Показатель,
		|	ШкалыПоказателиЭффективностиПозиций.ЗначениеДо,
		|	ШкалыПоказателиЭффективностиПозиций.ЗначениеОт,
		|	ШкалыПоказателиЭффективностиПозиций.Оценка,
		|	ШкалыПоказателиЭффективностиПозиций.ОценкаЗадаетсяИнтервалом,
		|	ШкалыПоказателиЭффективностиПозиций.ИнтервалОценкиОт,
		|	ШкалыПоказателиЭффективностиПозиций.ИнтервалОценкиДо,
		|	ШкалыПоказателиЭффективностиПозиций.Показатель.ОбратнаяШкала
		|ИЗ
		|	ВТРассчитанныеПоказателиСотрудников КАК РассчитанныеПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШкалыПоказателиЭффективностиПозиций КАК ШкалыПоказателиЭффективностиПозиций
		|		ПО РассчитанныеПоказателиСотрудников.ВладелецПоказателя = ШкалыПоказателиЭффективностиПозиций.Позиция
		|			И РассчитанныеПоказателиСотрудников.Показатель = ШкалыПоказателиЭффективностиПозиций.Показатель
		|			И РассчитанныеПоказателиСотрудников.Период = ШкалыПоказателиЭффективностиПозиций.Период
		|			И РассчитанныеПоказателиСотрудников.Горизонт = ШкалыПоказателиЭффективностиПозиций.Горизонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Период КАК Период,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Горизонт КАК Горизонт,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Сотрудник КАК Сотрудник,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Показатель КАК Показатель,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ЗначениеДо КАК ЗначениеДо,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ЗначениеОт КАК ЗначениеОт,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Оценка КАК Оценка,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ОценкаЗадаетсяИнтервалом КАК ОценкаЗадаетсяИнтервалом,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ИнтервалОценкиОт КАК ИнтервалОценкиОт,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ИнтервалОценкиДо КАК ИнтервалОценкиДо,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ПоказательОбратнаяШкала КАК ПоказательОбратнаяШкала
		|ПОМЕСТИТЬ ВТПоказателиСотрудниковПрямаяШкала
		|ИЗ
		|	ВТПоказателиСотрудниковСоШкаламиЗначений КАК ВТПоказателиСотрудниковСоШкаламиЗначений
		|ГДЕ
		|	НЕ ВТПоказателиСотрудниковСоШкаламиЗначений.ПоказательОбратнаяШкала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиСотрудниковПрямаяШкала.Период КАК Период,
		|	ВТПоказателиСотрудниковПрямаяШкала.Горизонт КАК Горизонт,
		|	ВТПоказателиСотрудниковПрямаяШкала.Сотрудник КАК Сотрудник,
		|	ВТПоказателиСотрудниковПрямаяШкала.Показатель КАК Показатель,
		|	МИНИМУМ(ВТПоказателиСотрудниковПрямаяШкала.ЗначениеДо) КАК ЗначениеДо
		|ПОМЕСТИТЬ ВТПрямаяШкалаУказатели
		|ИЗ
		|	ВТРассчитанныеПоказателиСотрудников КАК ВТРассчитанныеПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоказателиСотрудниковПрямаяШкала КАК ВТПоказателиСотрудниковПрямаяШкала
		|		ПО ВТРассчитанныеПоказателиСотрудников.Период = ВТПоказателиСотрудниковПрямаяШкала.Период
		|			И ВТРассчитанныеПоказателиСотрудников.Горизонт = ВТПоказателиСотрудниковПрямаяШкала.Горизонт
		|			И ВТРассчитанныеПоказателиСотрудников.Сотрудник = ВТПоказателиСотрудниковПрямаяШкала.Сотрудник
		|			И ВТРассчитанныеПоказателиСотрудников.Показатель = ВТПоказателиСотрудниковПрямаяШкала.Показатель
		|			И ВТРассчитанныеПоказателиСотрудников.ЗначениеПоказателя <= ВТПоказателиСотрудниковПрямаяШкала.ЗначениеДо
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПоказателиСотрудниковПрямаяШкала.Период,
		|	ВТПоказателиСотрудниковПрямаяШкала.Горизонт,
		|	ВТПоказателиСотрудниковПрямаяШкала.Сотрудник,
		|	ВТПоказателиСотрудниковПрямаяШкала.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиСотрудниковПрямаяШкала.Период КАК Период,
		|	ВТПоказателиСотрудниковПрямаяШкала.Горизонт КАК Горизонт,
		|	ВТПоказателиСотрудниковПрямаяШкала.Сотрудник КАК Сотрудник,
		|	ВТПоказателиСотрудниковПрямаяШкала.Показатель КАК Показатель,
		|	ВТРассчитанныеПоказателиСотрудников.ПлановоеЗначение КАК ПлановоеЗначение,
		|	ВТРассчитанныеПоказателиСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ВТРассчитанныеПоказателиСотрудников.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ВТРассчитанныеПоказателиСотрудников.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ВТРассчитанныеПоказателиСотрудников.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВЫБОР
		|		КОГДА ВТПоказателиСотрудниковПрямаяШкала.ОценкаЗадаетсяИнтервалом
		|			ТОГДА ВЫБОР
		|					КОГДА ВТПоказателиСотрудниковПрямаяШкала.ЗначениеДо - ВТПоказателиСотрудниковПрямаяШкала.ЗначениеОт = 0
		|						ТОГДА 0
		|					ИНАЧЕ (ВТПоказателиСотрудниковПрямаяШкала.ИнтервалОценкиДо - ВТПоказателиСотрудниковПрямаяШкала.ИнтервалОценкиОт) * (ВТРассчитанныеПоказателиСотрудников.ЗначениеПоказателя - ВТПоказателиСотрудниковПрямаяШкала.ЗначениеОт) / (ВТПоказателиСотрудниковПрямаяШкала.ЗначениеДо - ВТПоказателиСотрудниковПрямаяШкала.ЗначениеОт) + ВТПоказателиСотрудниковПрямаяШкала.ИнтервалОценкиОт
		|				КОНЕЦ
		|		ИНАЧЕ ВТПоказателиСотрудниковПрямаяШкала.Оценка
		|	КОНЕЦ КАК ОценкаПоказателя,
		|	ВТПоказателиСотрудниковПрямаяШкала.ЗначениеОт КАК ЗначениеОт,
		|	ВТПоказателиСотрудниковПрямаяШкала.ЗначениеДо КАК ЗначениеДо
		|ПОМЕСТИТЬ ВТОценкаПрямошкальныхПоказателей
		|ИЗ
		|	ВТПоказателиСотрудниковПрямаяШкала КАК ВТПоказателиСотрудниковПрямаяШкала
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрямаяШкалаУказатели КАК ВТПрямаяШкалаУказатели
		|		ПО ВТПоказателиСотрудниковПрямаяШкала.Период = ВТПрямаяШкалаУказатели.Период
		|			И ВТПоказателиСотрудниковПрямаяШкала.Горизонт = ВТПрямаяШкалаУказатели.Горизонт
		|			И ВТПоказателиСотрудниковПрямаяШкала.Сотрудник = ВТПрямаяШкалаУказатели.Сотрудник
		|			И ВТПоказателиСотрудниковПрямаяШкала.Показатель = ВТПрямаяШкалаУказатели.Показатель
		|			И ВТПоказателиСотрудниковПрямаяШкала.ЗначениеДо = ВТПрямаяШкалаУказатели.ЗначениеДо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРассчитанныеПоказателиСотрудников КАК ВТРассчитанныеПоказателиСотрудников
		|		ПО ВТПоказателиСотрудниковПрямаяШкала.Период = ВТРассчитанныеПоказателиСотрудников.Период
		|			И ВТПоказателиСотрудниковПрямаяШкала.Горизонт = ВТРассчитанныеПоказателиСотрудников.Горизонт
		|			И ВТПоказателиСотрудниковПрямаяШкала.Сотрудник = ВТРассчитанныеПоказателиСотрудников.Сотрудник
		|			И ВТПоказателиСотрудниковПрямаяШкала.Показатель = ВТРассчитанныеПоказателиСотрудников.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Период КАК Период,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Горизонт КАК Горизонт,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Сотрудник КАК Сотрудник,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Показатель КАК Показатель,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ЗначениеДо КАК ЗначениеДо,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ЗначениеОт КАК ЗначениеОт,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.Оценка КАК Оценка,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ОценкаЗадаетсяИнтервалом КАК ОценкаЗадаетсяИнтервалом,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ИнтервалОценкиОт КАК ИнтервалОценкиОт,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ИнтервалОценкиДо КАК ИнтервалОценкиДо,
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ПоказательОбратнаяШкала КАК ПоказательОбратнаяШкала
		|ПОМЕСТИТЬ ВТПоказателиСотрудниковОбратнаяШкала
		|ИЗ
		|	ВТПоказателиСотрудниковСоШкаламиЗначений КАК ВТПоказателиСотрудниковСоШкаламиЗначений
		|ГДЕ
		|	ВТПоказателиСотрудниковСоШкаламиЗначений.ПоказательОбратнаяШкала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиСотрудниковОбратнаяШкала.Период КАК Период,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Горизонт КАК Горизонт,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Сотрудник КАК Сотрудник,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Показатель КАК Показатель,
		|	МАКСИМУМ(ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеДо) КАК ЗначениеДо
		|ПОМЕСТИТЬ ВТОбратнаяШкалаУказатели
		|ИЗ
		|	ВТРассчитанныеПоказателиСотрудников КАК ВТРассчитанныеПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоказателиСотрудниковОбратнаяШкала КАК ВТПоказателиСотрудниковОбратнаяШкала
		|		ПО ВТРассчитанныеПоказателиСотрудников.Период = ВТПоказателиСотрудниковОбратнаяШкала.Период
		|			И ВТРассчитанныеПоказателиСотрудников.Горизонт = ВТПоказателиСотрудниковОбратнаяШкала.Горизонт
		|			И ВТРассчитанныеПоказателиСотрудников.Сотрудник = ВТПоказателиСотрудниковОбратнаяШкала.Сотрудник
		|			И ВТРассчитанныеПоказателиСотрудников.Показатель = ВТПоказателиСотрудниковОбратнаяШкала.Показатель
		|			И ВТРассчитанныеПоказателиСотрудников.ЗначениеПоказателя >= ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеДо
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПоказателиСотрудниковОбратнаяШкала.Период,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Горизонт,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Сотрудник,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиСотрудниковОбратнаяШкала.Период КАК Период,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Горизонт КАК Горизонт,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Сотрудник КАК Сотрудник,
		|	ВТПоказателиСотрудниковОбратнаяШкала.Показатель КАК Показатель,
		|	ВТРассчитанныеПоказателиСотрудников.ПлановоеЗначение КАК ПлановоеЗначение,
		|	ВТРассчитанныеПоказателиСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ВТРассчитанныеПоказателиСотрудников.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ВТРассчитанныеПоказателиСотрудников.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ВТРассчитанныеПоказателиСотрудников.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВЫБОР
		|		КОГДА ВТПоказателиСотрудниковОбратнаяШкала.ОценкаЗадаетсяИнтервалом
		|			ТОГДА (ВТПоказателиСотрудниковОбратнаяШкала.ИнтервалОценкиДо - ВТПоказателиСотрудниковОбратнаяШкала.ИнтервалОценкиОт) * (ВТРассчитанныеПоказателиСотрудников.ЗначениеПоказателя - ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеОт) / (ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеДо - ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеОт) + ВТПоказателиСотрудниковОбратнаяШкала.ИнтервалОценкиОт
		|		ИНАЧЕ ВТПоказателиСотрудниковОбратнаяШкала.Оценка
		|	КОНЕЦ КАК ОценкаПоказателя,
		|	ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеОт КАК ЗначениеОт,
		|	ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеДо КАК ЗначениеДо
		|ПОМЕСТИТЬ ВТОценкаОбратношкальныхПоказателей
		|ИЗ
		|	ВТПоказателиСотрудниковОбратнаяШкала КАК ВТПоказателиСотрудниковОбратнаяШкала
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбратнаяШкалаУказатели КАК ВТОбратнаяШкалаУказатели
		|		ПО ВТПоказателиСотрудниковОбратнаяШкала.Период = ВТОбратнаяШкалаУказатели.Период
		|			И ВТПоказателиСотрудниковОбратнаяШкала.Горизонт = ВТОбратнаяШкалаУказатели.Горизонт
		|			И ВТПоказателиСотрудниковОбратнаяШкала.Сотрудник = ВТОбратнаяШкалаУказатели.Сотрудник
		|			И ВТПоказателиСотрудниковОбратнаяШкала.Показатель = ВТОбратнаяШкалаУказатели.Показатель
		|			И ВТПоказателиСотрудниковОбратнаяШкала.ЗначениеДо = ВТОбратнаяШкалаУказатели.ЗначениеДо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРассчитанныеПоказателиСотрудников КАК ВТРассчитанныеПоказателиСотрудников
		|		ПО ВТПоказателиСотрудниковОбратнаяШкала.Период = ВТРассчитанныеПоказателиСотрудников.Период
		|			И ВТПоказателиСотрудниковОбратнаяШкала.Горизонт = ВТРассчитанныеПоказателиСотрудников.Горизонт
		|			И ВТПоказателиСотрудниковОбратнаяШкала.Сотрудник = ВТРассчитанныеПоказателиСотрудников.Сотрудник
		|			И ВТПоказателиСотрудниковОбратнаяШкала.Показатель = ВТРассчитанныеПоказателиСотрудников.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкаПрямошкальныхПоказателей.Период КАК Период,
		|	ВТОценкаПрямошкальныхПоказателей.Горизонт КАК Горизонт,
		|	ВТОценкаПрямошкальныхПоказателей.Сотрудник КАК Сотрудник,
		|	ВТОценкаПрямошкальныхПоказателей.Показатель КАК Показатель,
		|	ВТОценкаПрямошкальныхПоказателей.ПлановоеЗначение КАК ПлановоеЗначение,
		|	ВТОценкаПрямошкальныхПоказателей.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ВТОценкаПрямошкальныхПоказателей.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ВТОценкаПрямошкальныхПоказателей.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ВТОценкаПрямошкальныхПоказателей.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВТОценкаПрямошкальныхПоказателей.ОценкаПоказателя КАК ОценкаПоказателя,
		|	ВТОценкаПрямошкальныхПоказателей.ЗначениеОт КАК ЗначениеОт,
		|	ВТОценкаПрямошкальныхПоказателей.ЗначениеДо КАК ЗначениеДо
		|ПОМЕСТИТЬ ВТРассчитанныеОценкиПоказателейСотрудников
		|ИЗ
		|	ВТОценкаПрямошкальныхПоказателей КАК ВТОценкаПрямошкальныхПоказателей
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТОценкаОбратношкальныхПоказателей.Период,
		|	ВТОценкаОбратношкальныхПоказателей.Горизонт,
		|	ВТОценкаОбратношкальныхПоказателей.Сотрудник,
		|	ВТОценкаОбратношкальныхПоказателей.Показатель,
		|	ВТОценкаОбратношкальныхПоказателей.ПлановоеЗначение,
		|	ВТОценкаОбратношкальныхПоказателей.РегистраторПлановогоЗначения,
		|	ВТОценкаОбратношкальныхПоказателей.ФактическоеЗначение,
		|	ВТОценкаОбратношкальныхПоказателей.РегистраторФактическогоЗначения,
		|	ВТОценкаОбратношкальныхПоказателей.ЗначениеПоказателя,
		|	ВТОценкаОбратношкальныхПоказателей.ОценкаПоказателя,
		|	ВТОценкаОбратношкальныхПоказателей.ЗначениеОт,
		|	ВТОценкаОбратношкальныхПоказателей.ЗначениеДо
		|ИЗ
		|	ВТОценкаОбратношкальныхПоказателей КАК ВТОценкаОбратношкальныхПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРассчитанныеПоказателиВладелецПодразделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРассчитанныеПоказателиВладелецПозиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТШкалыПоказателиЭффективностиПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТШкалыПоказателиЭффективностиПозиций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиСотрудниковСоШкаламиЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиСотрудниковПрямаяШкала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПрямаяШкалаУказатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОценкаПрямошкальныхПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиСотрудниковОбратнаяШкала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбратнаяШкалаУказатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОценкаОбратношкальныхПоказателей";	
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстРасчета);
	
	Возврат Запрос;

КонецФункции

#Область ОбработчикиОбновления

Процедура ЗаполнитьПустыеГоризонты(ПараметрыОбновления = Неопределено) Экспорт

	ЗаполнитьПустыеГоризонтыНазначениеПоказателейЭффективности();
	ЗаполнитьПустыеГоризонтыПлана();
	ЗаполнитьПустыеГоризонтыФакта();
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыНазначениеПоказателейЭффективности()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.НазначениеПоказателейЭффективности.ПоказателиПодразделений КАК НазначениеПоказателейЭффективностиПоказателиПодразделений
		|ГДЕ
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.Ссылка
		|ИЗ
		|	Документ.НазначениеПоказателейЭффективности.ПоказателиПозиций КАК НазначениеПоказателейЭффективностиПоказателиПозиций
		|ГДЕ
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.Ссылка КАК Ссылка,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.НомерСтроки КАК НомерСтроки,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.ИдентификаторСтрокиОбъектаНазначения КАК ИдентификаторСтрокиОбъектаНазначения,
		|	ВЫБОР
		|		КОГДА НазначениеПоказателейЭффективностиПоказателиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ НазначениеПоказателейЭффективностиПоказателиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.Показатель КАК Показатель,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.Вес КАК Вес,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.МестоВводаЗначений КАК МестоВводаЗначений,
		|	НазначениеПоказателейЭффективностиПоказателиПодразделений.ИдентификаторСтрокиПоказателя КАК ИдентификаторСтрокиПоказателя
		|ИЗ
		|	Документ.НазначениеПоказателейЭффективности.ПоказателиПодразделений КАК НазначениеПоказателейЭффективностиПоказателиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО НазначениеПоказателейЭффективностиПоказателиПодразделений.Ссылка = ВТОбрабатываемыеДокументы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.Ссылка КАК Ссылка,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.НомерСтроки КАК НомерСтроки,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.ИдентификаторСтрокиОбъектаНазначения КАК ИдентификаторСтрокиОбъектаНазначения,
		|	ВЫБОР
		|		КОГДА НазначениеПоказателейЭффективностиПоказателиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ НазначениеПоказателейЭффективностиПоказателиПозиций.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.Показатель КАК Показатель,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.Вес КАК Вес,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.МестоВводаЗначений КАК МестоВводаЗначений,
		|	НазначениеПоказателейЭффективностиПоказателиПозиций.ИдентификаторСтрокиПоказателя КАК ИдентификаторСтрокиПоказателя
		|ИЗ
		|	Документ.НазначениеПоказателейЭффективности.ПоказателиПозиций КАК НазначениеПоказателейЭффективностиПоказателиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО НазначениеПоказателейЭффективностиПоказателиПозиций.Ссылка = ВТОбрабатываемыеДокументы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиЭффективностиПодразделений.Период КАК Период,
		|	ПоказателиЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ПоказателиЭффективностиПодразделений.НомерСтроки КАК НомерСтроки,
		|	ПоказателиЭффективностиПодразделений.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ПоказателиЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПоказателиЭффективностиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПоказателиЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ПоказателиЭффективностиПодразделений.Показатель КАК Показатель,
		|	ПоказателиЭффективностиПодразделений.Вес КАК Вес,
		|	ПоказателиЭффективностиПодразделений.МестоВводаЗначений КАК МестоВводаЗначений
		|ИЗ
		|	РегистрСведений.ПоказателиЭффективностиПодразделений КАК ПоказателиЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПоказателиЭффективностиПодразделений.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиЭффективностиПозиций.Период КАК Период,
		|	ПоказателиЭффективностиПозиций.Регистратор КАК Регистратор,
		|	ПоказателиЭффективностиПозиций.НомерСтроки КАК НомерСтроки,
		|	ПоказателиЭффективностиПозиций.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ПоказателиЭффективностиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПоказателиЭффективностиПозиций.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПоказателиЭффективностиПозиций.Позиция КАК Позиция,
		|	ПоказателиЭффективностиПозиций.Показатель КАК Показатель,
		|	ПоказателиЭффективностиПозиций.Вес КАК Вес,
		|	ПоказателиЭффективностиПозиций.МестоВводаЗначений КАК МестоВводаЗначений
		|ИЗ
		|	РегистрСведений.ПоказателиЭффективностиПозиций КАК ПоказателиЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПоказателиЭффективностиПозиций.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШкалыПоказателиЭффективностиПодразделений.Период КАК Период,
		|	ШкалыПоказателиЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ШкалыПоказателиЭффективностиПодразделений.НомерСтроки КАК НомерСтроки,
		|	ШкалыПоказателиЭффективностиПодразделений.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ШкалыПоказателиЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ШкалыПоказателиЭффективностиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ШкалыПоказателиЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ШкалыПоказателиЭффективностиПодразделений.Показатель КАК Показатель,
		|	ШкалыПоказателиЭффективностиПодразделений.ЗначениеДо КАК ЗначениеДо,
		|	ШкалыПоказателиЭффективностиПодразделений.ОценкаЗадаетсяИнтервалом КАК ОценкаЗадаетсяИнтервалом,
		|	ШкалыПоказателиЭффективностиПодразделений.ИнтервалОценкиОт КАК ИнтервалОценкиОт,
		|	ШкалыПоказателиЭффективностиПодразделений.ИнтервалОценкиДо КАК ИнтервалОценкиДо,
		|	ШкалыПоказателиЭффективностиПодразделений.Оценка КАК Оценка,
		|	ШкалыПоказателиЭффективностиПодразделений.ЗначениеОт КАК ЗначениеОт
		|ИЗ
		|	РегистрСведений.ШкалыПоказателиЭффективностиПодразделений КАК ШкалыПоказателиЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ШкалыПоказателиЭффективностиПодразделений.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШкалыПоказателиЭффективностиПозиций.Период КАК Период,
		|	ШкалыПоказателиЭффективностиПозиций.Регистратор КАК Регистратор,
		|	ШкалыПоказателиЭффективностиПозиций.НомерСтроки КАК НомерСтроки,
		|	ШкалыПоказателиЭффективностиПозиций.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ШкалыПоказателиЭффективностиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ШкалыПоказателиЭффективностиПозиций.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ШкалыПоказателиЭффективностиПозиций.Позиция КАК Позиция,
		|	ШкалыПоказателиЭффективностиПозиций.Показатель КАК Показатель,
		|	ШкалыПоказателиЭффективностиПозиций.ЗначениеДо КАК ЗначениеДо,
		|	ШкалыПоказателиЭффективностиПозиций.ОценкаЗадаетсяИнтервалом КАК ОценкаЗадаетсяИнтервалом,
		|	ШкалыПоказателиЭффективностиПозиций.ИнтервалОценкиОт КАК ИнтервалОценкиОт,
		|	ШкалыПоказателиЭффективностиПозиций.ИнтервалОценкиДо КАК ИнтервалОценкиДо,
		|	ШкалыПоказателиЭффективностиПозиций.Оценка КАК Оценка,
		|	ШкалыПоказателиЭффективностиПозиций.ЗначениеОт КАК ЗначениеОт
		|ИЗ
		|	РегистрСведений.ШкалыПоказателиЭффективностиПозиций КАК ШкалыПоказателиЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ШкалыПоказателиЭффективностиПозиций.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.Период КАК Период,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.Регистратор КАК Регистратор,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.НомерСтроки КАК НомерСтроки,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ПодразделенияВводаЗначенийПоказателейЭффективности.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПодразделенияВводаЗначенийПоказателейЭффективности.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.Показатель КАК Показатель,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.Подразделение КАК Подразделение,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПодразделенияВводаЗначенийПоказателейЭффективности.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта
		|ИЗ
		|	РегистрСведений.ПодразделенияВводаЗначенийПоказателейЭффективности КАК ПодразделенияВводаЗначенийПоказателейЭффективности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПодразделенияВводаЗначенийПоказателейЭффективности.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииВводаЗначенийПоказателейЭффективности.Период КАК Период,
		|	ПозицииВводаЗначенийПоказателейЭффективности.Регистратор КАК Регистратор,
		|	ПозицииВводаЗначенийПоказателейЭффективности.НомерСтроки КАК НомерСтроки,
		|	ПозицииВводаЗначенийПоказателейЭффективности.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ПозицииВводаЗначенийПоказателейЭффективности.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПозицииВводаЗначенийПоказателейЭффективности.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПозицииВводаЗначенийПоказателейЭффективности.Показатель КАК Показатель,
		|	ПозицииВводаЗначенийПоказателейЭффективности.Позиция КАК Позиция,
		|	ПозицииВводаЗначенийПоказателейЭффективности.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПозицииВводаЗначенийПоказателейЭффективности.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта
		|ИЗ
		|	РегистрСведений.ПозицииВводаЗначенийПоказателейЭффективности КАК ПозицииВводаЗначенийПоказателейЭффективности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПозицииВводаЗначенийПоказателейЭффективности.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[РезультатыЗапроса.Количество() - 10].Выбрать();
	
	ВыборкаПодразделений = РезультатыЗапроса[РезультатыЗапроса.Количество() - 9].Выбрать();	
	ВыборкаПозиций = РезультатыЗапроса[РезультатыЗапроса.Количество() - 8].Выбрать();
	
	ВыборкаПоказателиПодразделений = РезультатыЗапроса[РезультатыЗапроса.Количество() - 7].Выбрать();
	ВыборкаПоказателиПозиций = РезультатыЗапроса[РезультатыЗапроса.Количество() - 6].Выбрать();
	ВыборкаШкалыПоказателейПодразделений = РезультатыЗапроса[РезультатыЗапроса.Количество() - 5].Выбрать();
	ВыборкаШкалыПоказателейПозиций = РезультатыЗапроса[РезультатыЗапроса.Количество() - 4].Выбрать();
	ВыборкаПодразделенияВвода = РезультатыЗапроса[РезультатыЗапроса.Количество() - 3].Выбрать();
	ВыборкаПозицииВвода = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		// Документ
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ПоказателиПодразделений.Очистить();
		ДокументОбъект.ПоказателиПозиций.Очистить();
		
		Пока ВыборкаПодразделений.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка)) Цикл
			ЗаполнитьЗначенияСвойств(ДокументОбъект.ПоказателиПодразделений.Добавить(), ВыборкаПодразделений);
		КонецЦикла;
		Пока ВыборкаПозиций.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка)) Цикл
			ЗаполнитьЗначенияСвойств(ДокументОбъект.ПоказателиПозиций.Добавить(), ВыборкаПозиций);
		КонецЦикла;
		
		// Регистры
		НаборЗаписейПоказателиПодразделений = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПоказателиПодразделений, "ПоказателиЭффективностиПодразделений", ВыборкаДокументы.Ссылка);
		НаборЗаписейПоказателиПозиций = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПоказателиПозиций, "ПоказателиЭффективностиПозиций", ВыборкаДокументы.Ссылка);
		НаборЗаписейШкалыПоказателейПодразделений = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаШкалыПоказателейПодразделений, "ШкалыПоказателиЭффективностиПодразделений", ВыборкаДокументы.Ссылка);
		НаборЗаписейШкалыПоказателейПозиций = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаШкалыПоказателейПозиций, "ШкалыПоказателиЭффективностиПозиций", ВыборкаДокументы.Ссылка);
		НаборЗаписейПодразделенияВвода = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПодразделенияВвода, "ПодразделенияВводаЗначенийПоказателейЭффективности", ВыборкаДокументы.Ссылка);
		НаборЗаписейПозицииВвода = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПозицииВвода, "ПозицииВводаЗначенийПоказателейЭффективности", ВыборкаДокументы.Ссылка);
			
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПоказателиПодразделений);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПоказателиПозиций);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейШкалыПоказателейПодразделений);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейШкалыПоказателейПозиций);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПодразделенияВвода);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПозицииВвода);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыПлана()

	ЗаполнитьПустыеГоризонтыПланаПоказателейЭффективностиПодразделения();
	ЗаполнитьПустыеГоризонтыПланаПоказателейЭффективностиПозиции();
	ЗаполнитьПустыеГоризонтыПланаПоказателейЭффективностиСотрудника();
	ЗаполнитьПустыеГоризонтыПланаПоказателяЭффективностиПодразделений();
	ЗаполнитьПустыеГоризонтыПланаПоказателяЭффективностиПозиций();
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыПланаПоказателейЭффективностиПодразделения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоказателейЭффективностиПодразделения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ПланПоказателейЭффективностиПодразделения КАК ПланПоказателейЭффективностиПодразделения
		|ГДЕ
		|	ПланПоказателейЭффективностиПодразделения.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.НомерСтроки КАК НомерСтроки,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Активность КАК Активность,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПодразделений КАК ПлановыеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПодразделений.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПланПодразделений = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейПланПодразделений = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПланПодразделений, "ПлановыеЗначенияПоказателейЭффективностиПодразделений", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПланПодразделений);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыПланаПоказателейЭффективностиПозиции()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоказателейЭффективностиПозиции.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ПланПоказателейЭффективностиПозиции КАК ПланПоказателейЭффективностиПозиции
		|ГДЕ
		|	ПланПоказателейЭффективностиПозиции.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Регистратор КАК Регистратор,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.НомерСтроки КАК НомерСтроки,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Активность КАК Активность,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция КАК Позиция,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПозиций КАК ПлановыеЗначенияПоказателейЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПозиций.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПланПозиций = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейПланПозиций = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПланПозиций, "ПлановыеЗначенияПоказателейЭффективностиПозиций", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПланПозиций);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыПланаПоказателейЭффективностиСотрудника()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоказателейЭффективностиСотрудника.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ПланПоказателейЭффективностиСотрудника КАК ПланПоказателейЭффективностиСотрудника
		|ГДЕ
		|	ПланПоказателейЭффективностиСотрудника.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК Регистратор,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки КАК НомерСтроки,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Активность КАК Активность,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ПлановыеЗначенияПоказателейЭффективностиСотрудников.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПлановыеЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Позиция КАК Позиция,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиСотрудников КАК ПлановыеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПлановыеЗначенияПоказателейЭффективностиСотрудников.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПланСотрудников = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейПланСотрудников = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПланСотрудников, "ПлановыеЗначенияПоказателейЭффективностиСотрудников", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПланСотрудников);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыПланаПоказателяЭффективностиПодразделений()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоказателяЭффективностиПодразделений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ПланПоказателяЭффективностиПодразделений КАК ПланПоказателяЭффективностиПодразделений
		|ГДЕ
		|	ПланПоказателяЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.НомерСтроки КАК НомерСтроки,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Активность КАК Активность,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПодразделений КАК ПлановыеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПодразделений.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПланПодразделений = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейПланПодразделений = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПланПодразделений, "ПлановыеЗначенияПоказателейЭффективностиПодразделений", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПланПодразделений);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыПланаПоказателяЭффективностиПозиций()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоказателяЭффективностиПозиций.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ПланПоказателяЭффективностиПозиций КАК ПланПоказателяЭффективностиПозиций
		|ГДЕ
		|	ПланПоказателяЭффективностиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Регистратор КАК Регистратор,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.НомерСтроки КАК НомерСтроки,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Активность КАК Активность,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция КАК Позиция,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПозиций КАК ПлановыеЗначенияПоказателейЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПозиций.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПланПозиций = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейПланПозиций = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПланПозиций, "ПлановыеЗначенияПоказателейЭффективностиПозиций", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПланПозиций);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция НаборЗаписейРегистраСведенийИзВыборки(Выборка, ИмяРегистра, Ссылка)

	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Выборка.Сбросить();
	
	Пока Выборка.НайтиСледующий(Новый Структура("Регистратор", Ссылка)) Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат НаборЗаписей;

КонецФункции

Процедура ЗаполнитьПустыеГоризонтыФакта()

	ЗаполнитьПустыеГоризонтыФактаПоказателейЭффективностиПодразделения();
	ЗаполнитьПустыеГоризонтыФактаПоказателейЭффективностиСотрудника();
	ЗаполнитьПустыеГоризонтыФактаПоказателяЭффективностиПодразделений();
	ЗаполнитьПустыеГоризонтыФактаПоказателяЭффективностиСотрудников();
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыФактаПоказателейЭффективностиПодразделения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФактПоказателейЭффективностиПодразделения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ФактПоказателейЭффективностиПодразделения КАК ФактПоказателейЭффективностиПодразделения
		|ГДЕ
		|	ФактПоказателейЭффективностиПодразделения.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период КАК Период,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.НомерСтроки КАК НомерСтроки,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Значение КАК Значение
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиПодразделений КАК ФактическиеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ФактическиеЗначенияПоказателейЭффективностиПодразделений.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаФактПодразделений = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейФактПодразделений = 
			НаборЗаписейРегистраНакопленияИзВыборки(ВыборкаФактПодразделений, "ФактическиеЗначенияПоказателейЭффективностиПодразделений", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейФактПодразделений);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыФактаПоказателейЭффективностиСотрудника()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФактПоказателейЭффективностиСотрудника.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ФактПоказателейЭффективностиСотрудника КАК ФактПоказателейЭффективностиСотрудника
		|ГДЕ
		|	ФактПоказателейЭффективностиСотрудника.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период КАК Период,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК Регистратор,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки КАК НомерСтроки,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Позиция КАК Позиция,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Значение КАК Значение,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.МоментВремени КАК МоментВремени
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников КАК ФактическиеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаФактСотрудников = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейФактСотрудников = 
			НаборЗаписейРегистраНакопленияИзВыборки(ВыборкаФактСотрудников, "ФактическиеЗначенияПоказателейЭффективностиСотрудников", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейФактСотрудников);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыФактаПоказателяЭффективностиПодразделений()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФактПоказателяЭффективностиПодразделений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ФактПоказателяЭффективностиПодразделений КАК ФактПоказателяЭффективностиПодразделений
		|ГДЕ
		|	ФактПоказателяЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период КАК Период,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.НомерСтроки КАК НомерСтроки,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Значение КАК Значение
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиПодразделений КАК ФактическиеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ФактическиеЗначенияПоказателейЭффективностиПодразделений.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаФактПодразделений = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейФактПодразделений = 
			НаборЗаписейРегистраНакопленияИзВыборки(ВыборкаФактПодразделений, "ФактическиеЗначенияПоказателейЭффективностиПодразделений", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейФактПодразделений);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеГоризонтыФактаПоказателяЭффективностиСотрудников()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФактПоказателяЭффективностиСотрудников.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ФактПоказателяЭффективностиСотрудников КАК ФактПоказателяЭффективностиСотрудников
		|ГДЕ
		|	ФактПоказателяЭффективностиСотрудников.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период КАК Период,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК Регистратор,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки КАК НомерСтроки,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|		ИНАЧЕ ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|	КОНЕЦ КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Позиция КАК Позиция,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Значение КАК Значение,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.МоментВремени КАК МоментВремени
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников КАК ФактическиеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбрабатываемыеДокументы КАК ВТОбрабатываемыеДокументы
		|		ПО ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор = ВТОбрабатываемыеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбрабатываемыеДокументы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаФактСотрудников = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		
		НаборЗаписейФактСотрудников = 
			НаборЗаписейРегистраНакопленияИзВыборки(ВыборкаФактСотрудников, "ФактическиеЗначенияПоказателейЭффективностиСотрудников", ВыборкаДокументы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейФактСотрудников);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление горизонта показателя'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция НаборЗаписейРегистраНакопленияИзВыборки(Выборка, ИмяРегистра, Ссылка)

	НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Выборка.Сбросить();
	
	Пока Выборка.НайтиСледующий(Новый Структура("Регистратор", Ссылка)) Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат НаборЗаписей;

КонецФункции

Процедура ЗаполнитьПозицииВСотрудниковыхДокументах(ПараметрыОбновления = Неопределено) Экспорт

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоказателейЭффективностиСотрудника.Ссылка КАК Ссылка,
		|	ПланПоказателейЭффективностиСотрудника.Сотрудник КАК Сотрудник,
		|	ПланПоказателейЭффективностиСотрудника.Период КАК Период
		|ПОМЕСТИТЬ ВТПланСотрудникаОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ПланПоказателейЭффективностиСотрудника КАК ПланПоказателейЭффективностиСотрудника
		|ГДЕ
		|	ПланПоказателейЭффективностиСотрудника.Позиция = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактПоказателейЭффективностиСотрудника.Ссылка КАК Ссылка,
		|	ФактПоказателейЭффективностиСотрудника.Сотрудник КАК Сотрудник,
		|	ФактПоказателейЭффективностиСотрудника.Период КАК Период
		|ПОМЕСТИТЬ ВТФактСотрудникаОбрабатываемыеДокументы
		|ИЗ
		|	Документ.ФактПоказателейЭффективностиСотрудника КАК ФактПоказателейЭффективностиСотрудника
		|ГДЕ
		|	ФактПоказателейЭффективностиСотрудника.Позиция = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Ссылка КАК Ссылка,
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Ссылка.Период КАК Период
		|ПОМЕСТИТЬ ВТФактСотрудниковСотрудники
		|ИЗ
		|	Документ.ФактПоказателяЭффективностиСотрудников.Сотрудники КАК ФактПоказателяЭффективностиСотрудниковСотрудники
		|ГДЕ
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Позиция = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактСотрудниковСотрудники.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТФактСотрудниковОбрабатываемыеДокументы
		|ИЗ
		|	ВТФактСотрудниковСотрудники КАК ФактСотрудниковСотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПланСотрудникаОбрабатываемыеДокументы.Сотрудник КАК Сотрудник,
		|	ВТПланСотрудникаОбрабатываемыеДокументы.Период КАК Период
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	ВТПланСотрудникаОбрабатываемыеДокументы КАК ВТПланСотрудникаОбрабатываемыеДокументы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТФактСотрудникаОбрабатываемыеДокументы.Сотрудник,
		|	ВТФактСотрудникаОбрабатываемыеДокументы.Период
		|ИЗ
		|	ВТФактСотрудникаОбрабатываемыеДокументы КАК ВТФактСотрудникаОбрабатываемыеДокументы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТФактСотрудниковСотрудники.Сотрудник,
		|	ВТФактСотрудниковСотрудники.Период
		|ИЗ
		|	ВТФактСотрудниковСотрудники КАК ВТФактСотрудниковСотрудники";
	
	УдалитьВТ.Добавить("ВТПланСотрудникаОбрабатываемыеДокументы");
	УдалитьВТ.Добавить("ВТФактСотрудникаОбрабатываемыеДокументы");
	УдалитьВТ.Добавить("ВТФактСотрудниковСотрудники");
	УдалитьВТ.Добавить("ВТФактСотрудниковОбрабатываемыеДокументы");
	
	УдалитьВТ.Добавить("ВТСотрудникиПериоды");
	
	Запрос.Выполнить();
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды"),
		Ложь,
		"ДолжностьПоШтатномуРасписанию");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланСотрудникаОбрабатываемыеДокументы.Ссылка КАК Ссылка,
		|	КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК Позиция
		|ПОМЕСТИТЬ ВТПланСотрудникаИзмененныеДокументы
		|ИЗ
		|	ВТПланСотрудникаОбрабатываемыеДокументы КАК ПланСотрудникаОбрабатываемыеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ПланСотрудникаОбрабатываемыеДокументы.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И ПланСотрудникаОбрабатываемыеДокументы.Период = КадровыеДанныеСотрудников.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактСотрудникаОбрабатываемыеДокументы.Ссылка КАК Ссылка,
		|	КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК Позиция
		|ПОМЕСТИТЬ ВТФактСотрудникаИзмененныеДокументы
		|ИЗ
		|	ВТФактСотрудникаОбрабатываемыеДокументы КАК ФактСотрудникаОбрабатываемыеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ФактСотрудникаОбрабатываемыеДокументы.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И ФактСотрудникаОбрабатываемыеДокументы.Период = КадровыеДанныеСотрудников.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Ссылка КАК Ссылка,
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.НомерСтроки КАК НомерСтроки,
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ФактПоказателяЭффективностиСотрудниковСотрудники.Позиция = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|			ТОГДА КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию
		|		ИНАЧЕ ФактПоказателяЭффективностиСотрудниковСотрудники.Позиция
		|	КОНЕЦ КАК Позиция,
		|	ФактПоказателяЭффективностиСотрудниковСотрудники.Значение КАК Значение
		|ПОМЕСТИТЬ ВТФактСотрудниковИзмененныеДокументы
		|ИЗ
		|	Документ.ФактПоказателяЭффективностиСотрудников.Сотрудники КАК ФактПоказателяЭффективностиСотрудниковСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФактСотрудниковОбрабатываемыеДокументы КАК ФактСотрудниковОбрабатываемыеДокументы
		|		ПО ФактПоказателяЭффективностиСотрудниковСотрудники.Ссылка = ФактСотрудниковОбрабатываемыеДокументы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ФактПоказателяЭффективностиСотрудниковСотрудники.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И ФактПоказателяЭффективностиСотрудниковСотрудники.Ссылка.Период = КадровыеДанныеСотрудников.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактСотрудников.Ссылка КАК Ссылка,
		|	ФактСотрудников.НомерСтроки КАК НомерСтроки,
		|	ФактСотрудников.Сотрудник КАК Сотрудник,
		|	ФактСотрудников.Позиция КАК Позиция,
		|	ФактСотрудников.Значение КАК Значение
		|ИЗ
		|	ВТФактСотрудниковИзмененныеДокументы КАК ФактСотрудников
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК Регистратор,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки КАК НомерСтроки,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Активность КАК Активность,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия КАК ПериодДействия,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Горизонт КАК Горизонт,
		|	ПланСотрудникаИзмененныеДокументы.Позиция КАК Позиция,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиСотрудников КАК ПлановыеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСотрудникаИзмененныеДокументы КАК ПланСотрудникаИзмененныеДокументы
		|		ПО ПлановыеЗначенияПоказателейЭффективностиСотрудников.Регистратор = ПланСотрудникаИзмененныеДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период КАК Период,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК Регистратор,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки КАК НомерСтроки,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Активность КАК Активность,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель,
		|	ВТФактСотрудникаИзмененныеДокументы.Позиция КАК Позиция,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Значение КАК Значение
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников КАК ФактическиеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФактСотрудникаИзмененныеДокументы КАК ВТФактСотрудникаИзмененныеДокументы
		|		ПО ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор = ВТФактСотрудникаИзмененныеДокументы.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Активность,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель,
		|	ВТФактСотрудниковИзмененныеДокументы.Позиция,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Значение
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников КАК ФактическиеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФактСотрудниковИзмененныеДокументы КАК ВТФактСотрудниковИзмененныеДокументы
		|		ПО ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор = ВТФактСотрудниковИзмененныеДокументы.Ссылка
		|			И ФактическиеЗначенияПоказателейЭффективностиСотрудников.НомерСтроки = ВТФактСотрудниковИзмененныеДокументы.НомерСтроки";
			
	УдалитьВТ.Добавить("ВТКадровыеДанныеСотрудников");
	УдалитьВТ.Добавить("ВТПланСотрудникаИзмененныеДокументы");
	УдалитьВТ.Добавить("ВТФактСотрудникаИзмененныеДокументы");
	УдалитьВТ.Добавить("ВТФактСотрудниковИзмененныеДокументы");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокументыПланСотрудника = РезультатыЗапроса[РезультатыЗапроса.Количество() - 6].Выбрать();
	ВыборкаДокументыФактСотрудника = РезультатыЗапроса[РезультатыЗапроса.Количество() - 5].Выбрать();
	ВыборкаДокументыФактСотрудников = РезультатыЗапроса[РезультатыЗапроса.Количество() - 3].Выбрать();
	
	ВыборкаПланСотрудников = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выбрать();
	ВыборкаФактСотрудников = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выбрать();
	
	// План сотрудника
	Пока ВыборкаДокументыПланСотрудника.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументыПланСотрудника.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Позиция = ВыборкаДокументыПланСотрудника.Позиция;
		
		НаборЗаписейПланСотрудников = 
			НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПланСотрудников, "ПлановыеЗначенияПоказателейЭффективностиСотрудников", ВыборкаДокументыПланСотрудника.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПланСотрудников);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление позиции сотрудника'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	// Факт сотрудника
	Пока ВыборкаДокументыФактСотрудника.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументыФактСотрудника.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Позиция = ВыборкаДокументыФактСотрудника.Позиция;
		
		НаборЗаписейФактСотрудников = 
			НаборЗаписейРегистраНакопленияИзВыборки(ВыборкаФактСотрудников, "ФактическиеЗначенияПоказателейЭффективностиСотрудников", ВыборкаДокументыФактСотрудника.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейФактСотрудников);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление позиции сотрудника'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	// Факт сотрудников
	Пока ВыборкаДокументыФактСотрудников.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДокументОбъект = ВыборкаДокументыФактСотрудников.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Сотрудники.Очистить();
		
		Пока ВыборкаДокументыФактСотрудников.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ДокументОбъект.Сотрудники.Добавить(), ВыборкаДокументыФактСотрудников);
		КонецЦикла;	
		
		НаборЗаписейФактСотрудников = 
			НаборЗаписейРегистраНакопленияИзВыборки(ВыборкаФактСотрудников, "ФактическиеЗначенияПоказателейЭффективностиСотрудников", ВыборкаДокументыФактСотрудников.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			// Документ
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			// Регистры
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейФактСотрудников);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			 	НСтр("ru = 'Ключевые показатели эффективности.Обновление позиции сотрудника'", 
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.Мотивация) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.Мотивация, НСтр("ru = 'Отчеты по мотивации'"));
	КонецЕсли;
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализЦелевыхПоказателейСотрудников);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЦелевыхПоказателейСотрудников, "ПлановыеИФактическиеЗначенияПоказателейСотрудников");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализЦелевыхПоказателейПодразделений);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЦелевыхПоказателейПодразделений, "ПлановыеИФактическиеЗначенияПоказателейПодразделений");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.НазначенныеПоказатели);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НазначенныеПоказатели, "ПоказателиПозиций");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ВводЗначенийПоказателейЭффективности);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВводЗначенийПоказателейЭффективности, "ВводЗначенийПоказателей");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
	
КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("НастройкиКлючевыхПоказателейЭффективности", ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
			Форма.НастройкиКлючевыхПоказателейЭффективности, Метаданные.РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности));
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("НастройкиКлючевыхПоказателейЭффективности") Тогда
		ЗаполнитьЗначенияСвойств(Форма["НастройкиКлючевыхПоказателейЭффективности"], СохраненныеНастройки["НастройкиКлючевыхПоказателейЭффективности"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности);
	ЗаполнитьЗначенияСвойств(Форма.НастройкиКлючевыхПоказателейЭффективности, НастройкиСтруктура);
	
КонецПроцедуры

Процедура ПолучитьНастройкиПрограммы(НастройкиПрограммы) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности);
	НастройкиПрограммы.Вставить("НастройкиКлючевыхПоказателейЭффективности", НастройкиСтруктура);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКлючевыхПоказателейЭффективности.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиКлючевыхПоказателейЭффективности);
	Настройки.Записать();
	
КонецПроцедуры

Процедура СоздатьПоказательЭффективностиСотрудника() Экспорт 
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКлючевыеПоказателиЭффективности") Тогда 
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ПоказательЭффективностиСотрудника";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Показатель эффективности сотрудника'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Оценка эффективн.'");
		ОписаниеПоказателя.Точность = 2;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе 
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("ПоказательЭффективностиСотрудника");
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьНачислениеДоплатаПоРезультатамОценкиЭффективности(ПараметрыПланаВидовРасчета, СвойстваНачислений, КоллекторНачислений) Экспорт 
	
	ПоказательЭффективностиСотрудника = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПоказательЭффективностиСотрудника");
	
	Если ПоказательЭффективностиСотрудника <> Неопределено Тогда 
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Показатель", ПоказательЭффективностиСотрудника);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	НачисленияПоказатели.Ссылка
		               |ИЗ
		               |	ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
		               |ГДЕ
		               |	НачисленияПоказатели.Показатель = &Показатель";
					   
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СвойстваПоКатегории = СвойстваНачислений[Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия];
	СвойстваПоКатегории.СпособВыполненияНачисления = Перечисления.СпособыВыполненияНачислений.ЕжемесячноПриОкончательномРасчете;
	СвойстваПоКатегории.ВключатьВФОТ = Истина;
	
	Описание = ПланыВидовРасчета.Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия;
	Описание.СвойстваПоКатегории 	= СвойстваПоКатегории;
	Описание.Код					= НСтр("ru = 'ДПРОЭ'");
	Описание.Наименование			= НСтр("ru = 'Доплата по результатам оценки эффективности'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Допл. за эффективн.'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПоказательЭффективностиСотрудника / 100";
	Описание.ВидВремени 			= Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы;
	Описание.НачисляетсяПриРасчетеПервойПоловиныМесяца = Ложь;
	Описание.ОтборБазовых 			= ПланыВидовРасчета.Начисления.ОтборБазовыхПоУмолчанию();
	Описание.СсылкаНаОбъект 		= ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаПоРезультатамОценкиЭффективности;
	Описание.КлючевыеСвойства 		= "Ссылка";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКлючевыеПоказателиЭффективности") Тогда
		ПланыВидовРасчета.Начисления.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаПоРезультатамОценкиЭффективности = Описание.СсылкаНаОбъект;
	ИначеЕсли ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы Тогда
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		ПланыВидовРасчета.Начисления.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область НазначенныеПоказатели

Функция ЗапросВТНазначенныеПоказателиПозиций(ИмяФильтра)
	
	// Назначенные показатели.
	Запрос = ЗапросВТАктуальныеПоказателиЭффективностиПозиций(ИмяФильтра);
	
	// Ответственные.
	ОсновнойТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Период КАК Период,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Показатель КАК Показатель,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Горизонт КАК Горизонт,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений КАК Подразделение
		|ПОМЕСТИТЬ ВТФильтрДляОтветственныхПодразделения
		|ИЗ
		|	ВТАктуальныеПоказателиЭффективностиПозиций КАК ВТАктуальныеПоказателиЭффективностиПозиций
		|ГДЕ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений ССЫЛКА Справочник.СтруктураПредприятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Период КАК Период,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Показатель КАК Показатель,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Горизонт КАК Горизонт,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений КАК Позиция
		|ПОМЕСТИТЬ ВТФильтрДляОтветственныхПозиции
		|ИЗ
		|	ВТАктуальныеПоказателиЭффективностиПозиций КАК ВТАктуальныеПоказателиЭффективностиПозиций
		|ГДЕ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений ССЫЛКА Справочник.ШтатноеРасписание";
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ОсновнойТекстЗапроса);	
		
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрДляОтветственныхПодразделения", "Показатель,Подразделение,Горизонт");
	ЗапросОтветственныхПодразделений = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПодразделенияВводаЗначенийПоказателейЭффективности",
		Ложь,
		ОписаниеФильтра,
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез(),,
		"ВТПодразделенияВводаЗначенийПоказателей");
		
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственныхПодразделений);
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрДляОтветственныхПозиции", "Показатель,Позиция,Горизонт");
	ЗапросОтветственныхПозиций = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПозицииВводаЗначенийПоказателейЭффективности",
		Ложь,
		ОписаниеФильтра,
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез(),,
		"ВТПозицииВводаЗначенийПоказателей");
		
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственныхПозиций);
		
	// Финальное.
	ФинальныйТекстЗапроса =
		"УНИЧТОЖИТЬ ВТФильтрДляОтветственныхПодразделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТФильтрДляОтветственныхПозиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Период КАК Период,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Позиция КАК Позиция,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Горизонт КАК Горизонт,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Регистратор КАК Регистратор,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Позиция КАК ВладелецПоказателя,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Показатель КАК Показатель,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Вес КАК Вес,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ВТПодразделенияВводаЗначенийПоказателей.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ВТПодразделенияВводаЗначенийПоказателей.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Показатель.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ ВТНазначенныеПоказателиПозиций
		|ИЗ
		|	ВТАктуальныеПоказателиЭффективностиПозиций КАК ВТАктуальныеПоказателиЭффективностиПозиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодразделенияВводаЗначенийПоказателей КАК ВТПодразделенияВводаЗначенийПоказателей
		|		ПО ВТАктуальныеПоказателиЭффективностиПозиций.Период = ВТПодразделенияВводаЗначенийПоказателей.Период
		|			И ВТАктуальныеПоказателиЭффективностиПозиций.Горизонт = ВТПодразделенияВводаЗначенийПоказателей.Горизонт
		|			И ВТАктуальныеПоказателиЭффективностиПозиций.Показатель = ВТПодразделенияВводаЗначенийПоказателей.Показатель
		|			И ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений = ВТПодразделенияВводаЗначенийПоказателей.Подразделение
		|ГДЕ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений ССЫЛКА Справочник.СтруктураПредприятия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Период,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Позиция,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Горизонт,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Регистратор,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Позиция,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Показатель,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Вес,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений,
		|	ВТПозицииВводаЗначенийПоказателей.ОтветственныйЗаВводПлана,
		|	ВТПозицииВводаЗначенийПоказателей.ОтветственныйЗаВводФакта,
		|	ВТАктуальныеПоказателиЭффективностиПозиций.Показатель.ТребуетсяВводПлана
		|ИЗ
		|	ВТАктуальныеПоказателиЭффективностиПозиций КАК ВТАктуальныеПоказателиЭффективностиПозиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПозицииВводаЗначенийПоказателей КАК ВТПозицииВводаЗначенийПоказателей
		|		ПО ВТАктуальныеПоказателиЭффективностиПозиций.Период = ВТПозицииВводаЗначенийПоказателей.Период
		|			И ВТАктуальныеПоказателиЭффективностиПозиций.Показатель = ВТПозицииВводаЗначенийПоказателей.Показатель
		|			И ВТАктуальныеПоказателиЭффективностиПозиций.Горизонт = ВТПозицииВводаЗначенийПоказателей.Горизонт
		|			И ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений = ВТПозицииВводаЗначенийПоказателей.Позиция
		|ГДЕ
		|	ВТАктуальныеПоказателиЭффективностиПозиций.МестоВводаЗначений ССЫЛКА Справочник.ШтатноеРасписание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТАктуальныеПоказателиЭффективностиПозиций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделенияВводаЗначенийПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПозицииВводаЗначенийПоказателей";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ФинальныйТекстЗапроса);
		
	Возврат Запрос;
	
КонецФункции

Функция ЗапросВТАктуальныеПоказателиЭффективностиПозиций(ИмяФильтра)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииОтбор.Период КАК Период,
		|	МАКСИМУМ(ПоказателиЭффективностиПозиций.Период) КАК ПериодАктуальности,
		|	ПоказателиЭффективностиПозиций.Горизонт КАК Горизонт,
		|	ПоказателиЭффективностиПозиций.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТПоследниеПериодыПозиций
		|ИЗ
		|	РегистрСведений.ПоказателиЭффективностиПозиций КАК ПоказателиЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ИмяФильтра КАК ПозицииОтбор
		|		ПО ПоказателиЭффективностиПозиций.Горизонт = ПозицииОтбор.Горизонт
		|			И ПоказателиЭффективностиПозиций.Позиция = ПозицииОтбор.Позиция
		|			И ПоказателиЭффективностиПозиций.Период <= ПозицииОтбор.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиЭффективностиПозиций.Горизонт,
		|	ПоказателиЭффективностиПозиций.Позиция,
		|	ПозицииОтбор.Период";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяФильтра", ИмяФильтра);
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПоследниеПериодыПозиций", "Горизонт, Позиция");
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	
	ЗапросПозиций = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПоказателиЭффективностиПозиций",
		Ложь,
		ОписаниеФильтра,
		ПараметрыПостроения,,
		"ВТПоказателиЭффективностиПозицийВнутренний");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ЗапросПозиций.Текст);
	
	ФинальныйТекст = 
		"ВЫБРАТЬ
		|	ПоследниеПериодыПозиций.Период КАК Период,
		|	ПоказателиЭффективностиПозиций.ПериодЗаписи КАК ПериодЗаписи,
		|	ПоказателиЭффективностиПозиций.Горизонт КАК Горизонт,
		|	ПоказателиЭффективностиПозиций.Позиция КАК Позиция,
		|	ПоказателиЭффективностиПозиций.Показатель КАК Показатель,
		|	ПоказателиЭффективностиПозиций.Вес КАК Вес,
		|	ПоказателиЭффективностиПозиций.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ПоказателиЭффективностиПозиций.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТАктуальныеПоказателиЭффективностиПозиций
		|ИЗ
		|	ВТПоказателиЭффективностиПозицийВнутренний КАК ПоказателиЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеПериодыПозиций КАК ПоследниеПериодыПозиций
		|		ПО ПоказателиЭффективностиПозиций.Горизонт = ПоследниеПериодыПозиций.Горизонт
		|			И ПоказателиЭффективностиПозиций.Позиция = ПоследниеПериодыПозиций.Позиция
		|			И ПоказателиЭффективностиПозиций.Период = ПоследниеПериодыПозиций.Период
		|			И ПоказателиЭффективностиПозиций.ПериодЗаписи = ПоследниеПериодыПозиций.ПериодАктуальности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоследниеПериодыПозиций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиЭффективностиПозицийВнутренний";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ФинальныйТекст);
	
	Возврат Запрос;
		
КонецФункции

#КонецОбласти

#Область ОбъектыПоПоказателю

Функция ЗапросВТПодразделенияВводаЗначенийПоказателей(ИмяФильтра, СтрокаИзмерений = "", КоллекцияОтборов = Неопределено)

	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяФильтра, СтрокаИзмерений);
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	
	Если КоллекцияОтборов <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыПостроения.Отборы, КоллекцияОтборов);
	КонецЕсли;
	
	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПодразделенияВводаЗначенийПоказателейЭффективности",
		Ложь,
		ОписаниеФильтра,
		ПараметрыПостроения,,
		"ВТПодразделенияВводаЗначенийПоказателей");
		
	Возврат ЗапросВТИмяРегистраСрез;
	
КонецФункции

Функция ЗапросВТПозицииВводаЗначенийПоказателей(ИмяФильтра, СтрокаИзмерений = "", КоллекцияОтборов = Неопределено)

	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяФильтра, СтрокаИзмерений);
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	
	Если КоллекцияОтборов <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыПостроения.Отборы, КоллекцияОтборов);
	КонецЕсли;
	
	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПозицииВводаЗначенийПоказателейЭффективности",
		Ложь,
		ОписаниеФильтра,
		ПараметрыПостроения,,
		"ВТПозицииВводаЗначенийПоказателей");
		
	Возврат ЗапросВТИмяРегистраСрез;
	
КонецФункции

Процедура СоздатьВТПозицииВводаЗначенийПоказателей(МенеджерВременныхТаблиц, ИмяФильтра, СтрокаИзмерений = "", КоллекцияОтборов = Неопределено) Экспорт

	Запрос = ЗапросВТПозицииВводаЗначенийПоказателей(ИмяФильтра, СтрокаИзмерений, КоллекцияОтборов);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

#КонецОбласти

#Область ПоказателиОбъектов

// Подразделения

Процедура СоздатьВТПоказателиПодразделений(МенеджерВременныхТаблиц, ИмяФильтра)

	Запрос = ЗапросВТПоказателиПодразделений(ИмяФильтра);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

Функция ЗапросВТПоказателиПодразделений(ИмяФильтра, ИмяВыходнойВТ = "ВТПоказателиПодразделений")

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТПодразделенияОтбор.Период КАК Период,
		|	ВТПодразделенияОтбор.Горизонт КАК Горизонт,
		|	ВТПодразделенияОтбор.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТПодразделенияВходнойФильтрДляПоказателейПодразделений
		|ИЗ
		|	#ИмяФильтра КАК ВТПодразделенияОтбор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПодразделения.Период КАК Период,
		|	ВТПодразделения.Горизонт КАК Горизонт,
		|	ВТПодразделения.Подразделение КАК ИсходноеПодразделение,
		|	ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница КАК Подразделение,
		|	ПодчиненностьСтруктурныхЕдиниц.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТПодразделениеИРодители
		|ИЗ
		|	РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделенияВходнойФильтрДляПоказателейПодразделений КАК ВТПодразделения
		|		ПО ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница = ВТПодразделения.Подразделение";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяФильтра", ИмяФильтра);
	
	ЗапросПодразделения = ЗапросВТАктуальныеПоказателиЭффективностиПодразделений("ВТПодразделениеИРодители");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросПодразделения);
	
	ОсновнойТекстЗапроса =
		"ВЫБРАТЬ
		|	ВТПодразделениеИРодители.Период КАК Период,
		|	ВТПодразделениеИРодители.ИсходноеПодразделение КАК ИсходноеПодразделение,
		|	ВТПодразделениеИРодители.Подразделение КАК Подразделение,
		|	ВТПодразделениеИРодители.Уровень КАК Уровень,
		|	ПоказателиЭффективностиПодразделений.Горизонт КАК Горизонт,
		|	ПоказателиЭффективностиПодразделений.Показатель КАК Показатель,
		|	ПоказателиЭффективностиПодразделений.Регистратор КАК Регистратор,
		|	ПоказателиЭффективностиПодразделений.Вес КАК Вес,
		|	ПоказателиЭффективностиПодразделений.МестоВводаЗначений КАК МестоВводаЗначений
		|ПОМЕСТИТЬ ВТНазначенныеПоказателиПодразделенийИРодителей
		|ИЗ
		|	ВТАктуальныеПоказателиЭффективностиПодразделений КАК ПоказателиЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделениеИРодители КАК ВТПодразделениеИРодители
		|		ПО ПоказателиЭффективностиПодразделений.Горизонт = ВТПодразделениеИРодители.Горизонт
		|			И ПоказателиЭффективностиПодразделений.Подразделение = ВТПодразделениеИРодители.Подразделение
		|			И ПоказателиЭффективностиПодразделений.Период = ВТПодразделениеИРодители.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТНазначенныеПоказателиПодразделенийИРодителей.Уровень) КАК Уровень,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.ИсходноеПодразделение КАК ИсходноеПодразделение
		|ПОМЕСТИТЬ ВТУказателиПодразделений
		|ИЗ
		|	ВТНазначенныеПоказателиПодразделенийИРодителей КАК ВТНазначенныеПоказателиПодразделенийИРодителей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.ИсходноеПодразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.Период КАК Период,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.Горизонт КАК Горизонт,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.ИсходноеПодразделение КАК Подразделение,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.Подразделение КАК ВладелецПоказателя,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.Показатель КАК Показатель,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.Регистратор КАК Регистратор,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.Вес КАК Вес,
		|	ВТНазначенныеПоказателиПодразделенийИРодителей.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ВЫРАЗИТЬ(ВТНазначенныеПоказателиПодразделенийИРодителей.Показатель КАК Справочник.СтруктураЦелей).ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ ВТПоказателиПодразделенийБезОтветственных
		|ИЗ
		|	ВТНазначенныеПоказателиПодразделенийИРодителей КАК ВТНазначенныеПоказателиПодразделенийИРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУказателиПодразделений КАК ВТУказателиПодразделений
		|		ПО ВТНазначенныеПоказателиПодразделенийИРодителей.ИсходноеПодразделение = ВТУказателиПодразделений.ИсходноеПодразделение
		|			И ВТНазначенныеПоказателиПодразделенийИРодителей.Уровень = ВТУказателиПодразделений.Уровень
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделенияВходнойФильтрДляПоказателейПодразделений КАК ВТПодразделения
		|		ПО ВТНазначенныеПоказателиПодразделенийИРодителей.ИсходноеПодразделение = ВТПодразделения.Подразделение
		|			И ВТНазначенныеПоказателиПодразделенийИРодителей.Горизонт = ВТПодразделения.Горизонт
		|			И ВТНазначенныеПоказателиПодразделенийИРодителей.Период = ВТПодразделения.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделенияВходнойФильтрДляПоказателейПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТАктуальныеПоказателиЭффективностиПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделениеИРодители
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНазначенныеПоказателиПодразделенийИРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТУказателиПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПоказателиПодразделенийБезОтветственных.Период КАК Период,
		|	ВТПоказателиПодразделенийБезОтветственных.Горизонт КАК Горизонт,
		|	ВТПоказателиПодразделенийБезОтветственных.Показатель КАК Показатель,
		|	ВТПоказателиПодразделенийБезОтветственных.МестоВводаЗначений КАК Подразделение
		|ПОМЕСТИТЬ ВТФильтрДляОтветственных
		|ИЗ
		|	ВТПоказателиПодразделенийБезОтветственных КАК ВТПоказателиПодразделенийБезОтветственных";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ОсновнойТекстЗапроса);
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрДляОтветственных", "Показатель,Подразделение,Горизонт");
	ЗапросОтветственных = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПодразделенияВводаЗначенийПоказателейЭффективности",
		Ложь,
		ОписаниеФильтра,
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез(),,
		"ВТОтветственныеЗаВводЗначений");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросОтветственных);
	
	ФинальныйТекстЗапроса =
		"УНИЧТОЖИТЬ ВТФильтрДляОтветственных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоказателиПодразделенийБезОтветственных.Период КАК Период,
		|	ВТПоказателиПодразделенийБезОтветственных.Горизонт КАК Горизонт,
		|	ВТПоказателиПодразделенийБезОтветственных.Подразделение КАК Подразделение,
		|	ВТПоказателиПодразделенийБезОтветственных.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ВТПоказателиПодразделенийБезОтветственных.Показатель КАК Показатель,
		|	ВТПоказателиПодразделенийБезОтветственных.Регистратор КАК Регистратор,
		|	ВТПоказателиПодразделенийБезОтветственных.Вес КАК Вес,
		|	ВТПоказателиПодразделенийБезОтветственных.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ВТОтветственныеЗаВводЗначений.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ВТОтветственныеЗаВводЗначений.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ВТПоказателиПодразделенийБезОтветственных.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ #ВТПоказателиПодразделений
		|ИЗ
		|	ВТПоказателиПодразделенийБезОтветственных КАК ВТПоказателиПодразделенийБезОтветственных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветственныеЗаВводЗначений КАК ВТОтветственныеЗаВводЗначений
		|		ПО ВТПоказателиПодразделенийБезОтветственных.Период = ВТОтветственныеЗаВводЗначений.Период
		|			И ВТПоказателиПодразделенийБезОтветственных.Показатель = ВТОтветственныеЗаВводЗначений.Показатель
		|			И ВТПоказателиПодразделенийБезОтветственных.МестоВводаЗначений = ВТОтветственныеЗаВводЗначений.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиПодразделенийБезОтветственных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОтветственныеЗаВводЗначений";
	
	ФинальныйТекстЗапроса = СтрЗаменить(ФинальныйТекстЗапроса, "#ВТПоказателиПодразделений", ИмяВыходнойВТ);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ФинальныйТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросВТАктуальныеПоказателиЭффективностиПодразделений(ИмяФильтра)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОтбор.Период КАК Период,
		|	МАКСИМУМ(ПоказателиЭффективностиПодразделений.Период) КАК ПериодАктуальности,
		|	ПоказателиЭффективностиПодразделений.Горизонт КАК Горизонт,
		|	ПоказателиЭффективностиПодразделений.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТПоследниеПериодыПодразделений
		|ИЗ
		|	РегистрСведений.ПоказателиЭффективностиПодразделений КАК ПоказателиЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ИмяФильтра КАК ПодразделенияОтбор
		|		ПО ПоказателиЭффективностиПодразделений.Горизонт = ПодразделенияОтбор.Горизонт
		|			И ПоказателиЭффективностиПодразделений.Подразделение = ПодразделенияОтбор.Подразделение
		|			И ПоказателиЭффективностиПодразделений.Период <= ПодразделенияОтбор.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиЭффективностиПодразделений.Горизонт,
		|	ПоказателиЭффективностиПодразделений.Подразделение,
		|	ПодразделенияОтбор.Период";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяФильтра", ИмяФильтра);
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПоследниеПериодыПодразделений", "Горизонт, Подразделение");
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	
	ЗапросПодразделения = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПоказателиЭффективностиПодразделений",
		Ложь,
		ОписаниеФильтра,
		ПараметрыПостроения,,
		"ВТПоказателиЭффективностиПодразделенийВнутренний");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ЗапросПодразделения.Текст);
	
	ФинальныйТекст = 
		"ВЫБРАТЬ
		|	ПоследниеПериодыПодразделений.Период КАК Период,
		|	ПоказателиЭффективностиПодразделений.ПериодЗаписи КАК ПериодЗаписи,
		|	ПоказателиЭффективностиПодразделений.Горизонт КАК Горизонт,
		|	ПоказателиЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ПоказателиЭффективностиПодразделений.Показатель КАК Показатель,
		|	ПоказателиЭффективностиПодразделений.Вес КАК Вес,
		|	ПоказателиЭффективностиПодразделений.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ПоказателиЭффективностиПодразделений.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТАктуальныеПоказателиЭффективностиПодразделений
		|ИЗ
		|	ВТПоказателиЭффективностиПодразделенийВнутренний КАК ПоказателиЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеПериодыПодразделений КАК ПоследниеПериодыПодразделений
		|		ПО ПоказателиЭффективностиПодразделений.Горизонт = ПоследниеПериодыПодразделений.Горизонт
		|			И ПоказателиЭффективностиПодразделений.Подразделение = ПоследниеПериодыПодразделений.Подразделение
		|			И ПоказателиЭффективностиПодразделений.Период = ПоследниеПериодыПодразделений.Период
		|			И ПоказателиЭффективностиПодразделений.ПериодЗаписи = ПоследниеПериодыПодразделений.ПериодАктуальности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоследниеПериодыПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиЭффективностиПодразделенийВнутренний";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ФинальныйТекст);
		
	Возврат Запрос;
		
КонецФункции

// Позиции

Процедура СоздатьВТПоказателиПозиций(МенеджерВременныхТаблиц, ИмяФильтра, ИмяВыходнойВТ = "ВТПоказателиПозиций")

	УдалитьВТ = Новый Массив;
	
	Запрос = ЗапросВТНазначенныеПоказателиПозиций(ИмяФильтра);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	УдалитьВТ.Добавить("ВТНазначенныеПоказателиПозиций");
	
	ТекстНенайденныхПодразделений =
		"ВЫБРАТЬ
		|	ВТПозиции.Позиция КАК Позиция,
		|	ВТПозиции.Горизонт КАК Горизонт,
		|	ВТПозиции.Период КАК Период
		|ПОМЕСТИТЬ ВТПозицииНаследующиеИзПодразделений
		|ИЗ
		|	#ВТПозиции КАК ВТПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНазначенныеПоказателиПозиций КАК НазначенныеПоказателиПозиций
		|		ПО ВТПозиции.Позиция = НазначенныеПоказателиПозиций.Позиция
		|			И ВТПозиции.Период = НазначенныеПоказателиПозиций.Период
		|			И ВТПозиции.Горизонт = НазначенныеПоказателиПозиций.Горизонт
		|ГДЕ
		|	НазначенныеПоказателиПозиций.Позиция ЕСТЬ NULL";
	ТекстНенайденныхПодразделений = СтрЗаменить(ТекстНенайденныхПодразделений, "#ВТПозиции", ИмяФильтра);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстНенайденныхПодразделений);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПозицииНаследующиеИзПодразделений");
	
	ОрганизационнаяСтруктура.СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, "ВТПозицииНаследующиеИзПодразделений");
	УдалитьВТ.Добавить("ВТМестаПозицийВСтруктуреПредприятия");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТМестаПозицийВСтруктуреПредприятия.Подразделение КАК Подразделение,
		|	ВТПозицииНаследующиеИзПодразделений.Период КАК Период,
		|	ВТПозицииНаследующиеИзПодразделений.Горизонт КАК Горизонт
		|ПОМЕСТИТЬ ВТПодразделения
		|ИЗ
		|	ВТПозицииНаследующиеИзПодразделений КАК ВТПозицииНаследующиеИзПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК ВТМестаПозицийВСтруктуреПредприятия
		|		ПО ВТПозицииНаследующиеИзПодразделений.Позиция = ВТМестаПозицийВСтруктуреПредприятия.Позиция";
	
	ЗапросВТПоказателиПодразделений = ЗапросВТПоказателиПодразделений("ВТПодразделения", "ВТПоказателиПодразделенийВнутренний");
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(Запрос, ЗапросВТПоказателиПодразделений);
	
	ТекстПоказателейПодразделений =
		"ВЫБРАТЬ
		|	ВТПоказателиПодразделенийВнутренний.Период КАК Период,
		|	ВТПоказателиПодразделенийВнутренний.Показатель КАК Показатель,
		|	ВТПоказателиПодразделенийВнутренний.Горизонт КАК Горизонт,
		|	ВТПоказателиПодразделенийВнутренний.Регистратор КАК Регистратор,
		|	ВТМестаПозицийВСтруктуреПредприятия.Позиция КАК Позиция,
		|	ВТПоказателиПодразделенийВнутренний.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ВТПоказателиПодразделенийВнутренний.Вес КАК Вес,
		|	ВТПоказателиПодразделенийВнутренний.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ВТПоказателиПодразделенийВнутренний.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ВТПоказателиПодразделенийВнутренний.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ВЫРАЗИТЬ(ВТПоказателиПодразделенийВнутренний.Показатель КАК Справочник.СтруктураЦелей).ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ ВТПоказателиИзПодразделений
		|ИЗ
		|	ВТПоказателиПодразделенийВнутренний КАК ВТПоказателиПодразделенийВнутренний
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделения КАК ВТПодразделения
		|		ПО ВТПоказателиПодразделенийВнутренний.Подразделение = ВТПодразделения.Подразделение
		|			И ВТПоказателиПодразделенийВнутренний.Период = ВТПодразделения.Период
		|			И ВТПоказателиПодразделенийВнутренний.Горизонт = ВТПодразделения.Горизонт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК ВТМестаПозицийВСтруктуреПредприятия
		|		ПО ВТПоказателиПодразделенийВнутренний.Подразделение = ВТМестаПозицийВСтруктуреПредприятия.Подразделение";
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстПоказателейПодразделений);
	
	ФинальныйТекст =
		"ВЫБРАТЬ
		|	ПоказателиПозиций.Период КАК Период,
		|	ПоказателиПозиций.Позиция КАК Позиция,
		|	ПоказателиПозиций.Горизонт КАК Горизонт,
		|	ПоказателиПозиций.Регистратор КАК Регистратор,
		|	ПоказателиПозиций.Позиция КАК ВладелецПоказателя,
		|	ПоказателиПозиций.Показатель КАК Показатель,
		|	ПоказателиПозиций.Вес КАК Вес,
		|	ПоказателиПозиций.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ПоказателиПозиций.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ПоказателиПозиций.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ВЫРАЗИТЬ(ПоказателиПозиций.Показатель КАК Справочник.СтруктураЦелей).ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ #ВТПоказателиПозиций
		|ИЗ
		|	ВТНазначенныеПоказателиПозиций КАК ПоказателиПозиций
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоказателиПодразделений.Период,
		|	ПоказателиПодразделений.Позиция,
		|	ПоказателиПодразделений.Горизонт,
		|	ПоказателиПодразделений.Регистратор,
		|	ПоказателиПодразделений.ВладелецПоказателя,
		|	ПоказателиПодразделений.Показатель,
		|	ПоказателиПодразделений.Вес,
		|	ПоказателиПодразделений.МестоВводаЗначений,
		|	ПоказателиПодразделений.ОтветственныйЗаВводПлана,
		|	ПоказателиПодразделений.ОтветственныйЗаВводФакта,
		|	ПоказателиПодразделений.ТребуетсяВводПлана
		|ИЗ
		|	ВТПоказателиИзПодразделений КАК ПоказателиПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиИзПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПоказателиПодразделенийВнутренний";
	
	ФинальныйТекст = СтрЗаменить(ФинальныйТекст, "#ВТПоказателиПозиций", ИмяВыходнойВТ);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ФинальныйТекст);
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

//Сотрудники

Процедура СоздатьВТПоказателиСотрудников(МенеджерВременныхТаблиц, ИмяФильтра, ПолучатьКадровыеДанныеСотрудников = Истина)
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ПолучатьКадровыеДанныеСотрудников Тогда
		
		ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, ИмяФильтра, "Сотрудник,Период");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТ, Ложь, "ДолжностьПоШтатномуРасписанию, МестоВСтруктуреПредприятия");
		
		УдалитьВТ.Добавить("ВТКадровыеДанныеСотрудников");
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиОтбор.Период КАК Период,
		|	СотрудникиОтбор.Горизонт КАК Горизонт,
		|	Сотрудники.ДолжностьПоШтатномуРасписанию КАК Позиция
		|ПОМЕСТИТЬ ВТПозиции
		|ИЗ
		|	#СотрудникиОтбор КАК СотрудникиОтбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК Сотрудники
		|		ПО (НАЧАЛОПЕРИОДА(СотрудникиОтбор.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(Сотрудники.Период, ДЕНЬ))
		|			И СотрудникиОтбор.Сотрудник = Сотрудники.Сотрудник";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СотрудникиОтбор", ИмяФильтра);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПозиции");
		
	// Получить набор, действующий не сотрудника.
	СоздатьВТПоказателиПозиций(Запрос.МенеджерВременныхТаблиц, "ВТПозиции", "ВТПоказателиПозицийВнутренний");
	УдалитьВТ.Добавить("ВТПоказателиПозицийВнутренний");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Период КАК Период,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ДолжностьПоШтатномуРасписанию КАК Позиция,
		|	Сотрудники.МестоВСтруктуреПредприятия КАК Подразделение,
		|	ВТПоказателиПозицийВнутренний.Показатель КАК Показатель,
		|	ВТПоказателиПозицийВнутренний.Горизонт КАК Горизонт,
		|	ВТПоказателиПозицийВнутренний.Регистратор КАК Регистратор,
		|	ВТПоказателиПозицийВнутренний.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ВТПоказателиПозицийВнутренний.Вес КАК Вес,
		|	ВТПоказателиПозицийВнутренний.ОтветственныйЗаВводПлана КАК ОтветственныйЗаВводПлана,
		|	ВТПоказателиПозицийВнутренний.ОтветственныйЗаВводФакта КАК ОтветственныйЗаВводФакта,
		|	ВТПоказателиПозицийВнутренний.МестоВводаЗначений КАК МестоВводаЗначений,
		|	ВТПоказателиПозицийВнутренний.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ПОМЕСТИТЬ ВТПоказателиСотрудников
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоказателиПозицийВнутренний КАК ВТПоказателиПозицийВнутренний
		|		ПО Сотрудники.Период = ВТПоказателиПозицийВнутренний.Период
		|			И Сотрудники.ДолжностьПоШтатномуРасписанию = ВТПоказателиПозицийВнутренний.Позиция";
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

#КонецОбласти

#Область ПлановыеПоказатели

Функция ЗапросВТВведенныеПлановыеЗначенияПоказателейПодразделений(ИмяФильтра, ИсключаемыйРегистратор = Неопределено)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПодразделений КАК ПлановыеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТТаблицаДвижений КАК ТаблицаДвижений
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия = ТаблицаДвижений.ПериодДействия
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение = ТаблицаДвижений.Подразделение
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ТаблицаДвижений.Горизонт
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.Показатель = ТаблицаДвижений.Показатель
		|ГДЕ
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Регистратор <> &ИсключаемыйРегистратор";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТТаблицаДвижений", ИмяФильтра);
	
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Возврат Запрос;

КонецФункции

Функция ЗапросВТВведенныеПлановыеЗначенияПоказателейПозиций(ИмяФильтра, ИсключаемыйРегистратор = Неопределено)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция КАК Позиция,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Показатель КАК Показатель
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПозиций КАК ПлановыеЗначенияПоказателейЭффективностиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТТаблицаДвижений КАК ТаблицаДвижений
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия = ТаблицаДвижений.ПериодДействия
		|			И ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция = ТаблицаДвижений.Позиция
		|			И ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт = ТаблицаДвижений.Горизонт
		|			И ПлановыеЗначенияПоказателейЭффективностиПозиций.Показатель = ТаблицаДвижений.Показатель
		|ГДЕ
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Регистратор <> &ИсключаемыйРегистратор";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТТаблицаДвижений", ИмяФильтра);
	
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Возврат Запрос;

КонецФункции

Функция ЗапросВТВведенныеПлановыеЗначенияПоказателейСотрудников(ИмяФильтра, ИсключаемыйРегистратор = Неопределено)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Горизонт КАК Горизонт,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиСотрудников КАК ПлановыеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТТаблицаДвижений КАК ТаблицаДвижений
		|		ПО ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия = ТаблицаДвижений.ПериодДействия
		|			И ПлановыеЗначенияПоказателейЭффективностиСотрудников.Горизонт = ТаблицаДвижений.Горизонт
		|			И ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник = ТаблицаДвижений.Сотрудник
		|			И ПлановыеЗначенияПоказателейЭффективностиСотрудников.Показатель = ТаблицаДвижений.Показатель
		|ГДЕ
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Регистратор <> &ИсключаемыйРегистратор";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТТаблицаДвижений", ИмяФильтра);
	
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Возврат Запрос;

КонецФункции

Процедура СоздатьВТПлановыеЗначенияПоказателейПодразделений(МенеджерВременныхТаблиц, ИмяФильтра)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТПодразделения.Период КАК Период,
		|	ВТПодразделения.Горизонт КАК Горизонт,
		|	ВТПодразделения.ДатаНачала КАК ДатаНачала,
		|	ВТПодразделения.ДатаОкончания КАК ДатаОкончания,
		|	ВТПодразделения.Подразделение КАК ИсходноеПодразделение,
		|	ВТПодразделения.Показатель КАК Показатель,
		|	ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница КАК Подразделение,
		|	ПодчиненностьСтруктурныхЕдиниц.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТПодразделениеИРодители
		|ИЗ
		|	РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТПодразделения КАК ВТПодразделения
		|		ПО ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница = ВТПодразделения.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделениеИРодители.Период КАК Период,
		|	ПодразделениеИРодители.Горизонт КАК Горизонт,
		|	ПодразделениеИРодители.Подразделение КАК Подразделение,
		|	ПодразделениеИРодители.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Регистратор КАК РегистраторПлановогоЗначения,
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Значение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеПлановыеЗначенияПоказателейПодразделений
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПодразделений КАК ПлановыеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделениеИРодители КАК ПодразделениеИРодители
		|		ПО ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение = ПодразделениеИРодители.Подразделение
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ПодразделениеИРодители.Горизонт
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.Показатель = ПодразделениеИРодители.Показатель
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия >= ПодразделениеИРодители.ДатаНачала
		|			И ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия <= ПодразделениеИРодители.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПодразделениеИРодители.Период КАК Период,
		|	ВТПодразделениеИРодители.Горизонт КАК Горизонт,
		|	ВТПодразделениеИРодители.ДатаНачала КАК ДатаНачала,
		|	ВТПодразделениеИРодители.ДатаОкончания КАК ДатаОкончания,
		|	ВТПодразделениеИРодители.ИсходноеПодразделение КАК ИсходноеПодразделение,
		|	ВТПодразделениеИРодители.Подразделение КАК Подразделение,
		|	ВТПодразделениеИРодители.Уровень КАК Уровень,
		|	ВТПодразделениеИРодители.Показатель КАК Показатель,
		|	ВведенныеПлановыеЗначенияПоказателейПодразделений.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ВведенныеПлановыеЗначенияПоказателейПодразделений.ПлановоеЗначение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТПлановыеПоказателиПодразделенийИРодителей
		|ИЗ
		|	ВТВведенныеПлановыеЗначенияПоказателейПодразделений КАК ВведенныеПлановыеЗначенияПоказателейПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделениеИРодители КАК ВТПодразделениеИРодители
		|		ПО ВведенныеПлановыеЗначенияПоказателейПодразделений.Период = ВТПодразделениеИРодители.Период
		|			И ВведенныеПлановыеЗначенияПоказателейПодразделений.Горизонт = ВТПодразделениеИРодители.Горизонт
		|			И ВведенныеПлановыеЗначенияПоказателейПодразделений.Показатель = ВТПодразделениеИРодители.Показатель
		|			И ВведенныеПлановыеЗначенияПоказателейПодразделений.Подразделение = ВТПодразделениеИРодители.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТПлановыеПоказателиПодразделенийИРодителей.Уровень) КАК Уровень,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.ИсходноеПодразделение КАК ИсходноеПодразделение,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Показатель КАК Показатель,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Горизонт КАК Горизонт,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Период КАК Период
		|ПОМЕСТИТЬ ВТУказателиПодразделений
		|ИЗ
		|	ВТПлановыеПоказателиПодразделенийИРодителей КАК ВТПлановыеПоказателиПодразделенийИРодителей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПлановыеПоказателиПодразделенийИРодителей.ИсходноеПодразделение,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Показатель,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Горизонт,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Период КАК Период,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Горизонт КАК Горизонт,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.ДатаНачала КАК ДатаНачала,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.ДатаОкончания КАК ДатаОкончания,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.ИсходноеПодразделение КАК Подразделение,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Показатель КАК Показатель,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.Подразделение КАК МестоВводаЗначения,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ВТПлановыеПоказателиПодразделенийИРодителей.ПлановоеЗначение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТПлановыеЗначенияПоказателейПодразделений
		|ИЗ
		|	ВТПлановыеПоказателиПодразделенийИРодителей КАК ВТПлановыеПоказателиПодразделенийИРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУказателиПодразделений КАК ВТУказателиПодразделений
		|		ПО ВТПлановыеПоказателиПодразделенийИРодителей.ИсходноеПодразделение = ВТУказателиПодразделений.ИсходноеПодразделение
		|			И ВТПлановыеПоказателиПодразделенийИРодителей.Показатель = ВТУказателиПодразделений.Показатель
		|			И ВТПлановыеПоказателиПодразделенийИРодителей.Горизонт = ВТУказателиПодразделений.Горизонт
		|			И ВТПлановыеПоказателиПодразделенийИРодителей.Период = ВТУказателиПодразделений.Период
		|			И ВТПлановыеПоказателиПодразделенийИРодителей.Уровень = ВТУказателиПодразделений.Уровень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделениеИРодители
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВведенныеПлановыеЗначенияПоказателейПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПлановыеПоказателиПодразделенийИРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТУказателиПодразделений";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПодразделения", ИмяФильтра);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТПлановыеЗначенияПоказателейПозиций(МенеджерВременныхТаблиц, ИмяФильтра)

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиПозиций.Период КАК Период,
		|	ПоказателиПозиций.Горизонт КАК Горизонт,
		|	ПоказателиПозиций.ДатаНачала КАК ДатаНачала,
		|	ПоказателиПозиций.ДатаОкончания КАК ДатаОкончания,
		|	ПоказателиПозиций.Позиция КАК Позиция,
		|	ПоказателиПозиций.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Регистратор КАК РегистраторПлановогоЗначения,
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Значение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеПлановыеЗначенияПозиций
		|ИЗ
		|	#ВТПоказателиПозиций КАК ПоказателиПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПозиций КАК ПлановыеЗначенияПоказателейЭффективностиПозиций
		|		ПО ПоказателиПозиций.Позиция = ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция
		|			И ПоказателиПозиций.Горизонт = ПлановыеЗначенияПоказателейЭффективностиПозиций.Горизонт
		|			И ПоказателиПозиций.Показатель = ПлановыеЗначенияПоказателейЭффективностиПозиций.Показатель
		|			И (ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия >= ПоказателиПозиций.ДатаНачала)
		|			И (ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия <= ПоказателиПозиций.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиПозиций.Период КАК Период,
		|	ПоказателиПозиций.Горизонт КАК Горизонт,
		|	ПоказателиПозиций.ДатаНачала КАК ДатаНачала,
		|	ПоказателиПозиций.ДатаОкончания КАК ДатаОкончания,
		|	ПоказателиПозиций.Позиция КАК Позиция,
		|	ПоказателиПозиций.Показатель КАК Показатель,
		|	ПоказателиПозиций.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТПозицииНаследующиеПлановыеЗначенияИзПодразделений
		|ИЗ
		|	#ВТПоказателиПозиций КАК ПоказателиПозиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВведенныеПлановыеЗначенияПозиций КАК ВведенныеПлановыеЗначенияПозиций
		|		ПО ПоказателиПозиций.Позиция = ВведенныеПлановыеЗначенияПозиций.Позиция
		|			И ПоказателиПозиций.Показатель = ВведенныеПлановыеЗначенияПозиций.Показатель
		|			И ПоказателиПозиций.Горизонт = ВведенныеПлановыеЗначенияПозиций.Горизонт
		|			И ПоказателиПозиций.Период = ВведенныеПлановыеЗначенияПозиций.Период
		|ГДЕ
		|	ВведенныеПлановыеЗначенияПозиций.Позиция ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Период КАК Период,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Горизонт КАК Горизонт,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.ДатаНачала КАК ДатаНачала,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.ДатаОкончания КАК ДатаОкончания,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Подразделение КАК Подразделение,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Позиция КАК Позиция,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТПоказателиПодразделений
		|ИЗ
		|	ВТПозицииНаследующиеПлановыеЗначенияИзПодразделений КАК ПозицииНаследующиеПлановыеЗначенияИзПодразделений";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПоказателиПозиций", ИмяФильтра);
	УдалитьВТ.Добавить("ВТВведенныеПлановыеЗначенияПозиций");
	УдалитьВТ.Добавить("ВТПозицииНаследующиеПлановыеЗначенияИзПодразделений");
	УдалитьВТ.Добавить("ВТПоказателиПодразделений");
	
	Запрос.Выполнить();
	
	СоздатьВТПлановыеЗначенияПоказателейПодразделений(МенеджерВременныхТаблиц, "ВТПоказателиПодразделений");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Период КАК Период,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Горизонт КАК Горизонт,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.ДатаНачала КАК ДатаНачала,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.ДатаОкончания КАК ДатаОкончания,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Позиция КАК Позиция,
		|	ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейПодразделений.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ПлановыеЗначенияПоказателейПодразделений.ПлановоеЗначение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТПлановыеЗначенияПоказателейПозиций
		|ИЗ
		|	ВТПозицииНаследующиеПлановыеЗначенияИзПодразделений КАК ПозицииНаследующиеПлановыеЗначенияИзПодразделений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЗначенияПоказателейПодразделений КАК ПлановыеЗначенияПоказателейПодразделений
		|		ПО ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Период = ПлановыеЗначенияПоказателейПодразделений.Период
		|			И ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Горизонт = ПлановыеЗначенияПоказателейПодразделений.Горизонт
		|			И ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Показатель = ПлановыеЗначенияПоказателейПодразделений.Показатель
		|			И ПозицииНаследующиеПлановыеЗначенияИзПодразделений.Подразделение = ПлановыеЗначенияПоказателейПодразделений.Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВведенныеПлановыеЗначенияПозиций.Период,
		|	ВведенныеПлановыеЗначенияПозиций.Горизонт,
		|	ВведенныеПлановыеЗначенияПозиций.ДатаНачала,
		|	ВведенныеПлановыеЗначенияПозиций.ДатаОкончания,
		|	ВведенныеПлановыеЗначенияПозиций.Позиция,
		|	ВведенныеПлановыеЗначенияПозиций.Показатель,
		|	ВведенныеПлановыеЗначенияПозиций.РегистраторПлановогоЗначения,
		|	ВведенныеПлановыеЗначенияПозиций.ПлановоеЗначение
		|ИЗ
		|	ВТВведенныеПлановыеЗначенияПозиций КАК ВведенныеПлановыеЗначенияПозиций";
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТПлановыеЗначенияПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяФильтра)

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПоказателиСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК РегистраторПлановогоЗначения,
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Значение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеПлановыеЗначенияСотрудников
		|ИЗ
		|	#ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиСотрудников КАК ПлановыеЗначенияПоказателейЭффективностиСотрудников
		|		ПО ПоказателиСотрудников.Сотрудник = ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Позиция = ПлановыеЗначенияПоказателейЭффективностиСотрудников.Позиция
		|			И ПоказателиСотрудников.Показатель = ПлановыеЗначенияПоказателейЭффективностиСотрудников.Показатель
		|			И ПоказателиСотрудников.Горизонт = ПлановыеЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|			И (ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия >= ПоказателиСотрудников.ДатаНачала)
		|			И (ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия <= ПоказателиСотрудников.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПоказателиСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиНаследующиеПлановыеЗначенияИзПозиций
		|ИЗ
		|	#ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВведенныеПлановыеЗначенияСотрудников КАК ВведенныеПлановыеЗначенияСотрудников
		|		ПО ПоказателиСотрудников.Сотрудник = ВведенныеПлановыеЗначенияСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Позиция = ВведенныеПлановыеЗначенияСотрудников.Позиция
		|			И ПоказателиСотрудников.Показатель = ВведенныеПлановыеЗначенияСотрудников.Показатель
		|			И ПоказателиСотрудников.Горизонт = ВведенныеПлановыеЗначенияСотрудников.Горизонт
		|			И ПоказателиСотрудников.Период = ВведенныеПлановыеЗначенияСотрудников.Период
		|ГДЕ
		|	ВведенныеПлановыеЗначенияСотрудников.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Период КАК Период,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Горизонт КАК Горизонт,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.ДатаНачала КАК ДатаНачала,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.ДатаОкончания КАК ДатаОкончания,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Подразделение КАК Подразделение,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Позиция КАК Позиция,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТПоказателиПозиций
		|ИЗ
		|	ВТСотрудникиНаследующиеПлановыеЗначенияИзПозиций КАК СотрудникиНаследующиеПлановыеЗначенияИзПозиций";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПоказателиСотрудников", ИмяФильтра);
	УдалитьВТ.Добавить("ВТВведенныеПлановыеЗначенияСотрудников");
	УдалитьВТ.Добавить("ВТСотрудникиНаследующиеПлановыеЗначенияИзПозиций");
	УдалитьВТ.Добавить("ВТПоказателиПозиций");
	
	Запрос.Выполнить();
	
	СоздатьВТПлановыеЗначенияПоказателейПозиций(МенеджерВременныхТаблиц, "ВТПоказателиПозиций");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Период КАК Период,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Горизонт КАК Горизонт,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Сотрудник КАК Сотрудник,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Позиция КАК Позиция,
		|	СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Показатель КАК Показатель,
		|	ПлановыеЗначенияПоказателейПозиций.РегистраторПлановогоЗначения КАК РегистраторПлановогоЗначения,
		|	ПлановыеЗначенияПоказателейПозиций.ПлановоеЗначение КАК ПлановоеЗначение
		|ПОМЕСТИТЬ ВТПлановыеЗначенияПоказателейСотрудников
		|ИЗ
		|	ВТСотрудникиНаследующиеПлановыеЗначенияИзПозиций КАК СотрудникиНаследующиеПлановыеЗначенияИзПозиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЗначенияПоказателейПозиций КАК ПлановыеЗначенияПоказателейПозиций
		|		ПО СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Период = ПлановыеЗначенияПоказателейПозиций.Период
		|			И СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Горизонт = ПлановыеЗначенияПоказателейПозиций.Горизонт
		|			И СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Показатель = ПлановыеЗначенияПоказателейПозиций.Показатель
		|			И СотрудникиНаследующиеПлановыеЗначенияИзПозиций.Позиция = ПлановыеЗначенияПоказателейПозиций.Позиция
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВведенныеПлановыеЗначенияСотрудников.Период,
		|	ВведенныеПлановыеЗначенияСотрудников.Горизонт,
		|	ВведенныеПлановыеЗначенияСотрудников.Сотрудник,
		|	ВведенныеПлановыеЗначенияСотрудников.Позиция,
		|	ВведенныеПлановыеЗначенияСотрудников.Показатель,
		|	ВведенныеПлановыеЗначенияСотрудников.РегистраторПлановогоЗначения,
		|	ВведенныеПлановыеЗначенияСотрудников.ПлановоеЗначение
		|ИЗ
		|	ВТВведенныеПлановыеЗначенияСотрудников КАК ВведенныеПлановыеЗначенияСотрудников";
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

#КонецОбласти

#Область ФактическиеПоказатели

Функция ЗапросВТВведенныеФактическиеЗначенияПоказателейПодразделений(ИмяФильтра, ИсключаемыйРегистратор = Неопределено)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиПодразделений КАК ФактическиеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТТаблицаДвижений КАК ТаблицаДвижений
		|		ПО ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение = ТаблицаДвижений.Подразделение
		|			И ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ТаблицаДвижений.Горизонт
		|			И ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель = ТаблицаДвижений.Показатель
		|			И (НАЧАЛОПЕРИОДА(ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период, ДЕНЬ) >= ТаблицаДвижений.ДатаНачала)
		|			И (НАЧАЛОПЕРИОДА(ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период, ДЕНЬ) <= ТаблицаДвижений.ДатаОкончания)
		|ГДЕ
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Регистратор <> &ИсключаемыйРегистратор";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТТаблицаДвижений", ИмяФильтра);
	
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Возврат Запрос;

КонецФункции

Процедура СоздатьВТФактическиеЗначенияПоказателейПодразделений(МенеджерВременныхТаблиц, ИмяФильтра)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТПодразделения.Период КАК Период,
		|	ВТПодразделения.Горизонт КАК Горизонт,
		|	ВТПодразделения.ДатаНачала КАК ДатаНачала,
		|	ВТПодразделения.ДатаОкончания КАК ДатаОкончания,
		|	ВТПодразделения.Подразделение КАК ИсходноеПодразделение,
		|	ВТПодразделения.Показатель КАК Показатель,
		|	ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница КАК Подразделение,
		|	ПодчиненностьСтруктурныхЕдиниц.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТПодразделениеИРодители
		|ИЗ
		|	РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТПодразделения КАК ВТПодразделения
		|		ПО ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница = ВТПодразделения.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделениеИРодители.Период КАК Период,
		|	ПодразделениеИРодители.Горизонт КАК Горизонт,
		|	ПодразделениеИРодители.Подразделение КАК Подразделение,
		|	ПодразделениеИРодители.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Регистратор КАК РегистраторФактическогоЗначения,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Значение КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеФактическиеЗначенияПодразделенийСРегистраторами
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиПодразделений КАК ФактическиеЗначенияПоказателейЭффективностиПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделениеИРодители КАК ПодразделениеИРодители
		|		ПО ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение = ПодразделениеИРодители.Подразделение
		|			И ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель = ПодразделениеИРодители.Показатель
		|			И ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт = ПодразделениеИРодители.Горизонт
		|			И ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период >= ПодразделениеИРодители.ДатаНачала
		|			И ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период <= ПодразделениеИРодители.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период КАК Период,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель КАК Показатель,
		|	МАКСИМУМ(ФактическиеЗначенияПоказателейЭффективностиПодразделений.РегистраторФактическогоЗначения) КАК РегистраторФактическогоЗначения,
		|	СУММА(ФактическиеЗначенияПоказателейЭффективностиПодразделений.ФактическоеЗначение) КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеФактическиеЗначенияПодразделений
		|ИЗ
		|	ВТВведенныеФактическиеЗначенияПодразделенийСРегистраторами КАК ФактическиеЗначенияПоказателейЭффективностиПодразделений
		|
		|СГРУППИРОВАТЬ ПО
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Период,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиПодразделений.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПодразделениеИРодители.Период КАК Период,
		|	ВТПодразделениеИРодители.Горизонт КАК Горизонт,
		|	ВТПодразделениеИРодители.ИсходноеПодразделение КАК ИсходноеПодразделение,
		|	ВТПодразделениеИРодители.Подразделение КАК Подразделение,
		|	ВТПодразделениеИРодители.Уровень КАК Уровень,
		|	ВТПодразделениеИРодители.Показатель КАК Показатель,
		|	ВведенныеФактическиеЗначенияПодразделений.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ВведенныеФактическиеЗначенияПодразделений.ФактическоеЗначение КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТФактическиеПоказателиПодразделенийИРодителей
		|ИЗ
		|	ВТВведенныеФактическиеЗначенияПодразделений КАК ВведенныеФактическиеЗначенияПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделениеИРодители КАК ВТПодразделениеИРодители
		|		ПО ВведенныеФактическиеЗначенияПодразделений.Период = ВТПодразделениеИРодители.Период
		|			И ВведенныеФактическиеЗначенияПодразделений.Горизонт = ВТПодразделениеИРодители.Горизонт
		|			И ВведенныеФактическиеЗначенияПодразделений.Показатель = ВТПодразделениеИРодители.Показатель
		|			И ВведенныеФактическиеЗначенияПодразделений.Подразделение = ВТПодразделениеИРодители.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТФактическиеПоказателиПодразделенийИРодителей.Уровень) КАК Уровень,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.ИсходноеПодразделение КАК ИсходноеПодразделение,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.Показатель КАК Показатель,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.Горизонт КАК Горизонт,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.Период КАК Период
		|ПОМЕСТИТЬ ВТУказателиПодразделений
		|ИЗ
		|	ВТФактическиеПоказателиПодразделенийИРодителей КАК ВТФактическиеПоказателиПодразделенийИРодителей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТФактическиеПоказателиПодразделенийИРодителей.ИсходноеПодразделение,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.Показатель,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.Горизонт,
		|	ВТФактическиеПоказателиПодразделенийИРодителей.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеПоказателиПодразделенийИРодителей.Период КАК Период,
		|	ФактическиеПоказателиПодразделенийИРодителей.Горизонт КАК Горизонт,
		|	ФактическиеПоказателиПодразделенийИРодителей.ИсходноеПодразделение КАК Подразделение,
		|	ФактическиеПоказателиПодразделенийИРодителей.Показатель КАК Показатель,
		|	ФактическиеПоказателиПодразделенийИРодителей.Подразделение КАК МестоВводаЗначения,
		|	ФактическиеПоказателиПодразделенийИРодителей.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ФактическиеПоказателиПодразделенийИРодителей.ФактическоеЗначение КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТФактическиеЗначенияПоказателейПодразделений
		|ИЗ
		|	ВТФактическиеПоказателиПодразделенийИРодителей КАК ФактическиеПоказателиПодразделенийИРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУказателиПодразделений КАК УказателиПодразделений
		|		ПО ФактическиеПоказателиПодразделенийИРодителей.ИсходноеПодразделение = УказателиПодразделений.ИсходноеПодразделение
		|			И ФактическиеПоказателиПодразделенийИРодителей.Показатель = УказателиПодразделений.Показатель
		|			И ФактическиеПоказателиПодразделенийИРодителей.Период = УказателиПодразделений.Период
		|			И ФактическиеПоказателиПодразделенийИРодителей.Горизонт = УказателиПодразделений.Горизонт
		|			И ФактическиеПоказателиПодразделенийИРодителей.Уровень = УказателиПодразделений.Уровень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделениеИРодители
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВведенныеФактическиеЗначенияПодразделенийСРегистраторами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВведенныеФактическиеЗначенияПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТФактическиеПоказателиПодразделенийИРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТУказателиПодразделений";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПодразделения", ИмяФильтра);
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура СоздатьВТФактическиеЗначенияПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяФильтра)

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПоказателиСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор КАК РегистраторФактическогоЗначения,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Значение КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами
		|ИЗ
		|	#ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников КАК ФактическиеЗначенияПоказателейЭффективностиСотрудников
		|		ПО ПоказателиСотрудников.Горизонт = ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт
		|			И ПоказателиСотрудников.Сотрудник = ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Показатель = ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель
		|			И ПоказателиСотрудников.Позиция = ФактическиеЗначенияПоказателейЭффективностиСотрудников.Позиция
		|			И (ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период >= ПоказателиСотрудников.ДатаНачала)
		|			И (ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период <= ПоказателиСотрудников.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Период КАК Период,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Горизонт КАК Горизонт,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Сотрудник КАК Сотрудник,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Позиция КАК Позиция,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Показатель КАК Показатель,
		|	МАКСИМУМ(ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.РегистраторФактическогоЗначения) КАК РегистраторФактическогоЗначения,
		|	СУММА(ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.ФактическоеЗначение) КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТВведенныеФактическиеЗначенияСотрудников
		|ИЗ
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами КАК ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Горизонт,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Сотрудник,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Показатель,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Позиция,
		|	ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиСотрудников.Период КАК Период,
		|	ПоказателиСотрудников.Горизонт КАК Горизонт,
		|	ПоказателиСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПоказателиСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ПоказателиСотрудников.Сотрудник КАК Сотрудник,
		|	ПоказателиСотрудников.Позиция КАК Позиция,
		|	ПоказателиСотрудников.Показатель КАК Показатель,
		|	ПоказателиСотрудников.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиНаследующиеФактическиеЗначенияИзПодразделений
		|ИЗ
		|	#ВТПоказателиСотрудников КАК ПоказателиСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВведенныеФактическиеЗначенияСотрудников КАК ВведенныеФактическиеЗначенияСотрудников
		|		ПО ПоказателиСотрудников.Сотрудник = ВведенныеФактическиеЗначенияСотрудников.Сотрудник
		|			И ПоказателиСотрудников.Показатель = ВведенныеФактическиеЗначенияСотрудников.Показатель
		|			И ПоказателиСотрудников.Позиция = ВведенныеФактическиеЗначенияСотрудников.Позиция
		|			И ПоказателиСотрудников.Период = ВведенныеФактическиеЗначенияСотрудников.Период
		|			И ПоказателиСотрудников.Горизонт = ВведенныеФактическиеЗначенияСотрудников.Горизонт
		|ГДЕ
		|	ВведенныеФактическиеЗначенияСотрудников.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Период КАК Период,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Горизонт КАК Горизонт,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.ДатаНачала КАК ДатаНачала,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.ДатаОкончания КАК ДатаОкончания,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Подразделение КАК Подразделение,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТПоказателиПодразделений
		|ИЗ
		|	ВТСотрудникиНаследующиеФактическиеЗначенияИзПодразделений КАК СотрудникиНаследующиеФактическиеЗначенияИзПодразделений";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПоказателиСотрудников", ИмяФильтра);
	УдалитьВТ.Добавить("ВТВведенныеФактическиеЗначенияСотрудниковСРегистраторами");
	УдалитьВТ.Добавить("ВТВведенныеФактическиеЗначенияСотрудников");
	УдалитьВТ.Добавить("ВТСотрудникиНаследующиеФактическиеЗначенияИзПодразделений");
	УдалитьВТ.Добавить("ВТПоказателиПодразделений");
	
	Запрос.Выполнить();
	
	СоздатьВТФактическиеЗначенияПоказателейПодразделений(МенеджерВременныхТаблиц, "ВТПоказателиПодразделений");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Период КАК Период,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Горизонт КАК Горизонт,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Сотрудник КАК Сотрудник,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Позиция КАК Позиция,
		|	СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Показатель КАК Показатель,
		|	ФактическиеЗначенияПоказателейПодразделений.РегистраторФактическогоЗначения КАК РегистраторФактическогоЗначения,
		|	ФактическиеЗначенияПоказателейПодразделений.ФактическоеЗначение КАК ФактическоеЗначение
		|ПОМЕСТИТЬ ВТФактическиеЗначенияПоказателейСотрудников
		|ИЗ
		|	ВТСотрудникиНаследующиеФактическиеЗначенияИзПодразделений КАК СотрудникиНаследующиеФактическиеЗначенияИзПодразделений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФактическиеЗначенияПоказателейПодразделений КАК ФактическиеЗначенияПоказателейПодразделений
		|		ПО СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Период = ФактическиеЗначенияПоказателейПодразделений.Период
		|			И СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Горизонт = ФактическиеЗначенияПоказателейПодразделений.Горизонт
		|			И СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Показатель = ФактическиеЗначенияПоказателейПодразделений.Показатель
		|			И СотрудникиНаследующиеФактическиеЗначенияИзПодразделений.Подразделение = ФактическиеЗначенияПоказателейПодразделений.Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВведенныеФактическиеЗначенияСотрудников.Период,
		|	ВведенныеФактическиеЗначенияСотрудников.Горизонт,
		|	ВведенныеФактическиеЗначенияСотрудников.Сотрудник,
		|	ВведенныеФактическиеЗначенияСотрудников.Позиция,
		|	ВведенныеФактическиеЗначенияСотрудников.Показатель,
		|	ВведенныеФактическиеЗначенияСотрудников.РегистраторФактическогоЗначения,
		|	ВведенныеФактическиеЗначенияСотрудников.ФактическоеЗначение
		|ИЗ
		|	ВТВведенныеФактическиеЗначенияСотрудников КАК ВведенныеФактическиеЗначенияСотрудников";
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Функция ЗапросВТВведенныеФактическиеЗначенияПоказателеСотрудников(ИмяФильтра, ИсключаемыйРегистратор = Неопределено)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт КАК Горизонт,
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель КАК Показатель
		|ИЗ
		|	РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников КАК ФактическиеЗначенияПоказателейЭффективностиСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТТаблицаДвижений КАК ТаблицаДвижений
		|		ПО ФактическиеЗначенияПоказателейЭффективностиСотрудников.Сотрудник = ТаблицаДвижений.Сотрудник
		|			И ФактическиеЗначенияПоказателейЭффективностиСотрудников.Показатель = ТаблицаДвижений.Показатель
		|			И ФактическиеЗначенияПоказателейЭффективностиСотрудников.Горизонт = ТаблицаДвижений.Горизонт
		|			И (НАЧАЛОПЕРИОДА(ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период, ДЕНЬ) >= ТаблицаДвижений.ДатаНачала)
		|			И (НАЧАЛОПЕРИОДА(ФактическиеЗначенияПоказателейЭффективностиСотрудников.Период, ДЕНЬ) <= ТаблицаДвижений.ДатаОкончания)
		|ГДЕ
		|	ФактическиеЗначенияПоказателейЭффективностиСотрудников.Регистратор <> &ИсключаемыйРегистратор";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТТаблицаДвижений", ИмяФильтра);
	
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Возврат Запрос;

КонецФункции

#КонецОбласти

#Область ДвиженияДокументов

Процедура СформироватьКоллекциюДвижений(КоллекцияДвижений, ТаблицаДанных)

	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		Движение = КоллекцияДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаДанных);
	КонецЦикла;
	
	КоллекцияДвижений.Записать();
	КоллекцияДвижений.Записывать = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
