#Область СлужебныйПрограммныйИнтерфейс

// АПК:559-выкл Кандидаты в публичный программный интерфейс.

// Проверяет корректность заполнения начала и окончания периода в объекте или строке таблицы формы.
//
// Параметры:
//   Форма      - УправляемаяФорма - Форма с датами начала и окончания.
//   ПутьКОбъекту         - Строка - Полный путь к реквизиту формы с датами начала и окончания.
//   ИмяПоляДатыНачала    - Строка - Имя реквизита строки табличной части, в котором хранится дата начала периода.
//   ИмяПоляДатыОкончания - Строка - Имя реквизита строки табличной части, в котором хранится дата окончания.
//   ПредставлениеВРодительномПадеже - Строка - Представление (заголовок) периода в родительном падеже.
//
// Возвращаемое значение:
//   Булево - Признак того, что поля успешно прошли проверку.
//       Возвращает Ложь если была выявлена ошибка.
//
Функция ПериодСоответствуетТребованиям(Форма, ПутьКОбъекту, ИмяПоляДатыНачала, ИмяПоляДатыОкончания, ПредставлениеВРодительномПадеже) Экспорт
	Объект = ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(Форма, ПутьКОбъекту);
	Дата1 = Объект[ИмяПоляДатыНачала];
	Дата2 = Объект[ИмяПоляДатыОкончания];
	Если Не ЗначениеЗаполнено(Дата1) Тогда
		Текст = СтрШаблон(НСтр("ru = 'Не заполнена дата начала %1.'"), ПредставлениеВРодительномПадеже);
		СообщитьПользователю(Текст, ИмяПоляДатыНачала, , , ПутьКОбъекту);
		Возврат Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(Дата2) Тогда
		Текст = СтрШаблон(НСтр("ru = 'Не заполнена дата окончания %1.'"), ПредставлениеВРодительномПадеже);
		СообщитьПользователю(Текст, ИмяПоляДатыОкончания, , , ПутьКОбъекту);
		Возврат Ложь;
	ИначеЕсли Дата1 > Дата2 Тогда
		Текст = СтрШаблон(НСтр("ru = 'Дата начала %1 больше даты окончания.'"), ПредставлениеВРодительномПадеже);
		СообщитьПользователю(Текст, ИмяПоляДатыНачала, , , ПутьКОбъекту);
		Возврат Ложь;
	ИначеЕсли Год(Дата1) + 100 < Год(Дата2) Тогда
		Текст = СтрШаблон(НСтр("ru = 'Период %1 превышает 100 лет.'"), ПредставлениеВРодительномПадеже);
		СообщитьПользователю(Текст, ИмяПоляДатыНачала, , , ПутьКОбъекту);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Создает сообщение пользователю.
//
// Параметры:
//   Текст - Строка, ОбъектМетаданных - Текст сообщения.
//   ИмяРеквизита - Строка - Имя реквизита, к которому необходимо привязать сообщение.
//   ИмяТаблицы - Строка - Необязательный. Имя табличной части, в которой размещен реквизит.
//   НомерСтроки - Число - Необязательный. Номер строки табличной части, к которой необходимо привязать сообщение.
//   ПутьКДанным - Строка - Необязательный. В данном параметре можно указать имя объекта данных формы,
//       в котором расположен указанный реквизит или табличная часть. Пример: "Объект".
//
Процедура СообщитьПользователю(Текст, ИмяРеквизита, ИмяТаблицы = Неопределено, НомерСтроки = 0, ПутьКДанным = Неопределено) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Если ИмяТаблицы = Неопределено Тогда
		Сообщение.Поле = ИмяРеквизита;
	Иначе
		Сообщение.Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТаблицы, НомерСтроки, ИмяРеквизита);
	КонецЕсли;
	Если ПутьКДанным <> Неопределено Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	Сообщение.Сообщить();
КонецПроцедуры

// АПК:559-вкл

#КонецОбласти

