#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Заключение'"));
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеДляЗаполнения() Экспорт
	
	Описание = Новый Структура(
		"Организация,
		|Направление,
		|ДатаОсмотра,
		|РезультатОсмотра,
		|ПояснениеРезультата");
	
	Возврат Описание;
	
КонецФункции

Функция ДанныеЗаключения(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заключение.Ссылка КАК Ссылка,
		|	Заключение.Номер КАК Номер,
		|	Заключение.Дата КАК Дата,
		|	Заключение.Проведен КАК Проведен,
		|	Заключение.Организация КАК Организация,
		|	Заключение.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Заключение.Позиция КАК Позиция,
		|	Заключение.Направление КАК Направление,
		|	Заключение.ДатаОсмотра КАК ДатаОсмотра,
		|	Заключение.ТипОсмотра КАК ТипОсмотра,
		|	Заключение.РезультатОсмотра КАК РезультатОсмотра,
		|	Заключение.ПояснениеРезультата КАК ПояснениеРезультата,
		|	Заключение.Ответственный КАК Ответственный,
		|	Заключение.Комментарий КАК Комментарий,
		|	ОтстранениеОтРаботы.ДокументОтстранения КАК ДокументОтстранения
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК Заключение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра КАК ОтстранениеОтРаботы
		|		ПО (ОтстранениеОтРаботы.ЗаключениеМедицинскогоОсмотра = Заключение.Ссылка)
		|ГДЕ
		|	Заключение.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

#КонецОбласти

#КонецЕсли
