
&НаСервере
Процедура ПослеВводаСтрокиПродолжить(НовыйПароль, Параметры) Экспорт
	Если НЕ НовыйПароль = Неопределено Тогда
		ТекОбъект = Объект.Ссылка.ПолучитьОбъект();
        ТекОбъект.Пароль = Новый ХранилищеЗначения(НовыйПароль);
		ТекОбъект.Записать();
		ОбновитьЗаданностьПароля();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаданностьПароля()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекОбъект = Объект.Ссылка.ПолучитьОбъект();
	
		ТекПароль = ТекОбъект.ПолучитьПароль();
		локПароль = ?(НЕ ЗначениеЗаполнено(ТекПароль),"не задан","задан");
	Иначе
		локПароль = "не задан";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ОбновитьЗаданностьПароля();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПроверитьПрава() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не достаточно прав");
	Иначе
		ПриОткрытииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьПрава()
	Возврат НЕ РольДоступна("ПолныеПрава");
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Дубли = ПроверитьДублиВТЗ();
	Если НЕ ПустаяСтрока(Дубли) Тогда
		ПоказатьПредупреждение(, "имеются дубли в дополнительных параметрах");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьДублиВТЗ()
	Результат = "";
	КЧ = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло = Новый ОписаниеТипов("Число",,,КЧ);
	
	тзДубли = Объект.ДопПараметры.Выгрузить();
	тзДубли.Колонки.Добавить("Колво", ОписаниеЧисло);
	тзДубли.ЗаполнитьЗначения(1,"Колво");
	тзДубли.Свернуть("Параметр","Колво");
	Для каждого ТекСтрока Из тзДубли Цикл
		Если ТекСтрока.Колво<2 Тогда
			Продолжить;
		КонецЕсли;
	Результат = ?(ПустаяСтрока(Результат), ТекСтрока, ", " + ТекСтрока) ;
	КонецЦикла;

	Возврат Результат;
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры


&НаКлиенте
Процедура ПарольАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НовыйПароль = "";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПослеВводаСтрокиПродолжить", ЭтотОбъект, Параметры), НовыйПароль, "Введите новый пароль");
КонецПроцедуры


