
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьИспользованиеОснованияПолномочий(ИспользоватьОснованияПолномочий)Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		ИспользоватьОснованияПолномочий = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьФормуЭлементаСправочникаОрганизации(Форма, ИмяГруппыДляВставки = "ГруппаНастройкиОснованийПолномочий") Экспорт

	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОснованияПолномочийОтветственныхЛиц) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "НастройкиОснованияПолномочий";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Основания полномочий'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппыДляВставки);
	Если Форма.Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаФормы);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти