
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиВидаДокумента(Шаблон) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШаблоныПроизвольныхКадровыхПриказов.Наименование,
		|	ШаблоныПроизвольныхКадровыхПриказов.НесколькоСотрудников,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетРуководитель,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетГлавныйБухгалтер,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетКассир,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетРуководительКадровойСлужбы,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетБухгалтер,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПоказыватьПодразделение,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПроверятьЗаполнениеПодразделения
		|ИЗ
		|	Справочник.ШаблоныПроизвольныхКадровыхПриказов КАК ШаблоныПроизвольныхКадровыхПриказов
		|ГДЕ
		|	ШаблоныПроизвольныхКадровыхПриказов.Ссылка = &Шаблон";
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
КонецФункции

// Предназначена для получения актуальных видов документов.
//
Функция ТаблицаВидовДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШаблоныПроизвольныхКадровыхПриказов.Ссылка КАК ВидДокумента,
		|	ШаблоныПроизвольныхКадровыхПриказов.Наименование КАК Наименование,
		|	ШаблоныПроизвольныхКадровыхПриказов.Наименование КАК Представление,
		|	ШаблоныПроизвольныхКадровыхПриказов.Родитель
		|ИЗ
		|	Справочник.ШаблоныПроизвольныхКадровыхПриказов КАК ШаблоныПроизвольныхКадровыхПриказов
		|ГДЕ
		|	НЕ ШаблоныПроизвольныхКадровыхПриказов.ПометкаУдаления
		|	И НЕ ШаблоныПроизвольныхКадровыхПриказов.ЭтоГруппа
		|	И НЕ ШаблоныПроизвольныхКадровыхПриказов.ВАрхиве";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПечатныеФормы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешниеПечатныеФормы.ПечатнаяФорма,
		|	ВнешниеПечатныеФормы.Ссылка КАК ШаблонДокумента,
		|	ВнешниеПечатныеФормы.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ШаблоныПроизвольныхКадровыхПриказов.ВнешниеПечатныеФормы КАК ВнешниеПечатныеФормы
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
