
#Область СлужебныеПроцедурыИФункции

Функция ПубликуемаяСтруктураПредприятия(Позиции) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПубликуемаяСтруктураПредприятия(Позиции);

КонецФункции

Процедура СоздатьВТШтатноеРасписание(МенеджерВТ) Экспорт
	
	КабинетСотрудникаРасширенный.СоздатьВТШтатноеРасписание(МенеджерВТ);
	
КонецПроцедуры

Функция ПодразделениеВСтруктуреПредприятия(Подразделение) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПодразделениеВСтруктуреПредприятия(Подразделение);

КонецФункции

Функция ИменаКонтролируемыхПолей(Объект) Экспорт

	Возврат КабинетСотрудникаРасширенный.ИменаКонтролируемыхПолей(Объект);

КонецФункции

Процедура ОбъектПриЗаписи(Объект) Экспорт

	КабинетСотрудникаРасширенный.ОбъектПриЗаписи(Объект);

КонецПроцедуры

Процедура ОбъектПередЗаписью(Объект) Экспорт

	КабинетСотрудникаРасширенный.ОбъектПередЗаписью(Объект);

КонецПроцедуры

Функция ФотографииФизическихЛиц(ФизическиеЛица) Экспорт

	Возврат КабинетСотрудникаРасширенный.ФотографииФизическихЛиц(ФизическиеЛица);

КонецФункции

Процедура ОбработатьИзменениеКадровойИстории(ИзменившиесяДанные) Экспорт

	КабинетСотрудникаРасширенный.ОбработатьИзменениеКадровойИстории(ИзменившиесяДанные);

КонецПроцедуры

Функция ТипШтатноеРасписание() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипШтатноеРасписание();

КонецФункции

Функция ТипСтруктураПредприятия() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипСтруктураПредприятия();

КонецФункции

Функция ДанныеСтруктурыПредприятия(СписокОтбора) Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеСтруктурыПредприятия(СписокОтбора);

КонецФункции

Функция ДанныеШтатногоРасписания(СписокОтбора) Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеШтатногоРасписания(СписокОтбора);

КонецФункции

Процедура ДобавитьЭлементБлокировкиОбновленияПравНаОтпуск(Блокировка) Экспорт

	КабинетСотрудникаРасширенный.ДобавитьЭлементБлокировкиОбновленияПравНаОтпуск(Блокировка);

КонецПроцедуры

Процедура ЗарегистрироватьОбновленияПубликацииПравНаОтпуск(ПубликуемыеОбъекты) Экспорт
	
	КабинетСотрудникаРасширенный.ЗарегистрироватьОбновленияПубликацииПравНаОтпуск(ПубликуемыеОбъекты);
	
КонецПроцедуры

Процедура ДобавитьСотрудникиДляОбновленияПубликацииПравНаОтпуск(Сотрудник) Экспорт

	КабинетСотрудникаРасширенный.ДобавитьСотрудникиДляОбновленияПубликацииПравНаОтпуск(Сотрудник);

КонецПроцедуры

Функция ДанныеДляОбновленияПубликацииПравНаОтпуск() Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеДляОбновленияПубликацииПравНаОтпуск();

КонецФункции

Процедура ОтменитьРегистрациюСотрудникиДляОбновленияПубликацииПравНаОтпуск(ТаблицаИзменений, Результат) Экспорт

	КабинетСотрудникаРасширенный.ОтменитьРегистрациюСотрудникиДляОбновленияПубликацииПравНаОтпуск(ТаблицаИзменений, Результат);

КонецПроцедуры

Процедура ОчиститьДанныеПриОтключенииСервиса() Экспорт

	КабинетСотрудникаРасширенный.ОчиститьДанныеПриОтключенииСервиса();

КонецПроцедуры

Процедура ОбновитьСтруктуруПредприятия() Экспорт

	КабинетСотрудникаРасширенный.ОбновитьСтруктуруПредприятия();

КонецПроцедуры

Функция НоваяПубликуемаяСтруктураПредприятияПозиций(Позиции) Экспорт

	Возврат КабинетСотрудникаРасширенный.НоваяПубликуемаяСтруктураПредприятияПозиций(Позиции);

КонецФункции

Функция ПечатнаяФормаСправкаСМестаРаботы(МассивСотрудников) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПечатнаяФормаСправкаСМестаРаботы(МассивСотрудников);	

КонецФункции

Функция ПечатнаяФормаСправкаОбОстаткахОтпусков(МассивСотрудников) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПечатнаяФормаСправкаОбОстаткахОтпусков(МассивСотрудников);

КонецФункции

Функция ДанныеПоОтпускам(МассивОтбора) Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеПоОтпускам(МассивОтбора);

КонецФункции

Функция ТипыОбрабатываемыхЗаявок() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипыОбрабатываемыхЗаявок();

КонецФункции

Функция КоличествоДнейОтпускаФизическогоЛица(ФизическоеЛицо, ДатаНачала, ДатаОкончания) Экспорт
	
	Возврат КабинетСотрудникаРасширенный.КоличествоДнейОтпускаФизическогоЛица(ФизическоеЛицо, ДатаНачала, ДатаОкончания);
	
КонецФункции

Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	КабинетСотрудникаРасширенный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	
КонецПроцедуры

Функция МестаПозицийВСтруктуреПредприятия(Позиции) Экспорт
	
	Возврат КабинетСотрудникаРасширенный.МестаПозицийВСтруктуреПредприятия(Позиции);

КонецФункции

Функция СпособыВыплатыЗарплатыПоРегистратору(РегистраторыВыплаты) Экспорт

	Возврат КабинетСотрудникаРасширенный.СпособыВыплатыЗарплатыПоРегистратору(РегистраторыВыплаты);

КонецФункции

#КонецОбласти
