
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсключаяПозицию") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ШтатноеРасписание.Отбор, "Ссылка", Параметры.ИсключаяПозицию, ВидСравненияКомпоновкиДанных.НеРавно);
		РеквизитыПозиции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ИсключаяПозицию, "Владелец, Подразделение");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ШтатноеРасписание, 
			"Организация", 
			РеквизитыПозиции.Владелец, , , 
			Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, 
			Строка(Новый УникальныйИдентификатор));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ШтатноеРасписание, 
			"Подразделение", 
			РеквизитыПозиции.Подразделение, , , 
			Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, 
			Строка(Новый УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
