
#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьКоллекциюМакетовВариантовОтчетовПечатныхФорм(МакетыВариантовОтчетов) Экспорт
	
	МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержанийАвансом.РасчетныйЛистокПерваяПоловинаМесяца",
		"ОбщийМакет.ПФ_MXL_РасчетныйЛистокПерваяПоловинаМесяца");
	
	МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержанийАвансом.Т51ПерваяПоловинаМесяца", "ОбщийМакет.ПФ_MXL_Т51ПерваяПоловинаМесяца");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		
		МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержаний.РасчетныйЛистокСРазбивкойПоИсточникамФинансирования",
			"ОбщийМакет.ПФ_MXL_РасчетныйЛистокСРазбивкойПоИсточникамФинансирования");
		
		МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержанийАвансом.РасчетныйЛистокСРазбивкойПоИсточникамФинансированияПерваяПоловинаМесяца",
			"ОбщийМакет.ПФ_MXL_РасчетныйЛистокСРазбивкойПоИсточникамФинансированияПерваяПоловинаМесяца");
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюЗарплату") Тогда
			МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержаний.РасчетныйЛистокУправленческий", "ОбщийМакет.ПФ_MXL_РасчетныйЛистокУправленческий");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти