
#Область СлужебныеПроцедурыИФункции

// Вызывается при получении формой вакансии данных объекта.
// Настраивает условное оформление и команды таблицы Публикации.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма вакансии.
//
Процедура ВакансииПриПолученииДанныхНаСервере(Форма) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ВакансииПриПолученииДанныхНаСервере(Форма);
	
КонецПроцедуры

// Обновляет команды для публикации/снятия с публикации вакансий.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма вакансии.
//
Процедура ОбновитьКомандыПубликацииВакансии(Форма) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновитьКомандыПубликацииВакансии(Форма);
	
КонецПроцедуры

Процедура УстановитьФОИспользуетсяВзаимодействиеСРекрутинговымиСайтами() Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.УстановитьФОИспользуетсяВзаимодействиеСРекрутинговымиСайтами();
	
КонецПроцедуры

Функция СтруктураТрудоваяДеятельность() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СтруктураТрудоваяДеятельность();
	
КонецФункции

Функция СтруктураЗнаниеЯзыков() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СтруктураЗнаниеЯзыков();
	
КонецФункции

Процедура ЗаполнитьМассивКонтактнойИнформацииHeadHunter(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииHeadHunter(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтактнойИнформацииZarplata(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииZarplata(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтактнойИнформацииRabota(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииRabota(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтактнойИнформацииSuperJob(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииSuperJob(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеHeadHunter(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеHeadHunter(СтруктураРезюме, МассивОбразование);
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеRabota(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеRabota(СтруктураРезюме, МассивОбразование)
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеSuperJob(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеSuperJob(СтруктураРезюме, МассивОбразование);
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеZarplata(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеZarplata(СтруктураРезюме, МассивОбразование);
	
КонецПроцедуры

Функция ПубликацияВакансииHeadHunter(Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииHeadHunter(Дерево);
	
КонецФункции

Функция ПубликацияВакансииRabota(Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииRabota(Дерево);
	
КонецФункции

Функция ПубликацияВакансииSuperJob(Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииSuperJob(Дерево);
	
КонецФункции

Функция ПубликацияВакансииZarplata(Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииZarplata(Дерево);
	
КонецФункции

Функция ПовторнаяПубликацияВакансииRabota(ИдентификаторВакансии, Дерево, Вакансия) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПовторнаяПубликацияВакансииRabota(ИдентификаторВакансии, Дерево, Вакансия);
	
КонецФункции

Функция ПовторнаяПубликацияВакансииSuperJob(ИдентификаторВакансии, Дерево, Вакансия) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПовторнаяПубликацияВакансииSuperJob(ИдентификаторВакансии, Дерево, Вакансия);
	
КонецФункции

Функция ПовторнаяПубликацияВакансииZarplata(ИдентификаторВакансии, Дерево, Вакансия) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПовторнаяПубликацияВакансииZarplata(ИдентификаторВакансии, Дерево, Вакансия);
	
КонецФункции

Функция ОбновлениеВакансииHeadHunter(ИдентификаторВакансии, Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииHeadHunter(ИдентификаторВакансии, Дерево);
	
КонецФункции

Функция ОбновлениеВакансииRabota(ИдентификаторВакансии, Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииRabota(ИдентификаторВакансии, Дерево);
	
КонецФункции

Функция ОбновлениеВакансииSuperJob(ИдентификаторВакансии, Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииSuperJob(ИдентификаторВакансии, Дерево);
	
КонецФункции

Функция ОбновлениеВакансииZarplata(ИдентификаторВакансии, Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииZarplata(ИдентификаторВакансии, Дерево);
	
КонецФункции

Функция СнятиеВакансииHeadHunter(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СнятиеВакансииHeadHunter(ИдентификаторВакансии);
	
КонецФункции

Функция СнятиеВакансииRabota(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СнятиеВакансииRabota(ИдентификаторВакансии);
	
КонецФункции

Функция СнятиеВакансииSuperJob(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СнятиеВакансииSuperJob(ИдентификаторВакансии);
	
КонецФункции

Функция СнятиеВакансииZarplata(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СнятиеВакансииZarplata(ИдентификаторВакансии);
	
КонецФункции

Функция СвойстваПубликацииВакансииHeadHunter(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СвойстваПубликацииВакансииHeadHunter(ИдентификаторВакансии);
	
КонецФункции

Функция СвойстваПубликацииВакансииRabota(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СвойстваПубликацииВакансииRabota(ИдентификаторВакансии);
	
КонецФункции

Функция СвойстваПубликацииВакансииSuperJob(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СвойстваПубликацииВакансииSuperJob(ИдентификаторВакансии);
	
КонецФункции

Функция СвойстваПубликацииВакансииZarplata(ИдентификаторВакансии) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СвойстваПубликацииВакансииZarplata(ИдентификаторВакансии);
	
КонецФункции

Функция НайтиКандидатов(ПараметрыПроцедуры, УникальныйИдентификатор, АдресХранилища) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.НайтиКандидатов(ПараметрыПроцедуры, УникальныйИдентификатор, АдресХранилища);
	
КонецФункции

Функция РеквизитВакансииСоответствующийПолюПубликации(Путь, Вакансия) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.РеквизитВакансииСоответствующийПолюПубликации(Путь, Вакансия);
	
КонецФункции

Функция ОпубликованныеВакансииСИдентификаторами(Сайт) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОпубликованныеВакансииСИдентификаторами(Сайт);
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, Вакансия, Реквизит) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, Вакансия, Реквизит);
	
КонецФункции

Функция ЗагружаемыеРеквизитыВакансии(Сайт) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ЗагружаемыеРеквизитыВакансии(Сайт);
	
КонецФункции

Функция ПарсерJSON(ТекущаяСтрока, ПрочитатьВСоответствие) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПарсерJSON(ТекущаяСтрока, ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗаписьJSON(Данные) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаписьJSON(Данные);
	
КонецФункции

Функция ТипЗначенияJSONСтрока() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONСтрока();
	
КонецФункции

Функция ТипЗначенияJSONЧисло() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONЧисло();
	
КонецФункции

Функция ТипЗначенияJSONНачалоМассива() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONНачалоМассива();
	
КонецФункции

Функция ТипЗначенияJSONНачалоОбъекта() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONНачалоОбъекта();
	
КонецФункции

Функция ТипЗначенияJSONБулево() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONБулево();
	
КонецФункции

Функция НоваяСтепеньЗнанияЯзыка(Код) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.НоваяСтепеньЗнанияЯзыка(Код);
	
КонецФункции

Функция КонстантаИспользоватьИнтеграциюРекрутинговыхСайтов() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.КонстантаИспользоватьИнтеграциюРекрутинговыхСайтов();
	
КонецФункции

#Область СообщенияОбОшибках

Процедура СообщитьОбОшибке(Шаблон, Сайт, КодСостояния, Знач ОписаниеОшибки) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.СообщитьОбОшибке(Шаблон, Сайт, КодСостояния, ОписаниеОшибки);
	
КонецПроцедуры

Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

Функция ТекстОшибкиПоОписанию(Сайт, КодСостояния, ОписаниеОшибки) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТекстОшибкиПоОписанию(Сайт, КодСостояния, ОписаниеОшибки);
	
КонецФункции

Функция ТекстОшибки(Шаблон, Сайт, КодСостояния, ОписаниеОшибки) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТекстОшибки(Шаблон, Сайт, КодСостояния, ОписаниеОшибки);
	
КонецФункции

#КонецОбласти

#КонецОбласти