#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Возвращает коллекцию вариантов настроек
//
// Возвращаемое значение:
//  Массив -  коллекция объектов со свойствами Имя и Представление (см. ВариантНастроекКомпоновкиДанных).
//
Функция ВариантыНастроек() Экспорт
	
	ВариантыНастроек = Новый Массив;
	
	ПоляНастройки = "Имя, Представление";
	ВариантыНастроек.Добавить(
		Новый Структура(
			ПоляНастройки, 
			"ВводЗначенийПоказателей", 
			НСтр("ru = 'Ввод плановых и фактических значений показателей эффективности по ответственным лицам'")));
	
	Возврат ВариантыНастроек;
	
КонецФункции

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВводЗначенийПоказателей");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Ввод плановых и фактических значений показателей эффективности по ответственным лицам.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли
