#Область СлужебныйПрограммныйИнтерфейс

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиСистемыНалогообложения, Ложь);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|РегистрСведений.НастройкиСистемыНалогообложения.Чтение.Организации
		|РегистрСведений.НастройкиСистемыНалогообложения.Изменение.Организации";
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт
	
	// Номер версии соответствует основной конфигурации.
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.15.31",
		"Роль.НастройкаУчетнойПолитики",
		"Роль.НастройкаСистемыНалогообложения");
	
КонецПроцедуры

#КонецОбласти

