#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", МедицинскиеОсмотры.НоваяТаблицаОбновлениеПериодическихОсмотров());
	
	РегистрыСведений.МедицинскиеОсмотры.ДополнитьТаблицуОбновления(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МедицинскиеОсмотры.ДополнитьТаблицуОбновления(ЭтотОбъект);
	
	МедицинскиеОсмотры.ЗарегистрироватьОбновлениеПериодическихОсмотров(ДополнительныеСвойства["ТаблицаОбновлениеПериодическихОсмотров"]);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли