#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ГоловнаяОрганизация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеВыданногоНаправления(Направление) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеНаправления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыданныеНаправления.Позиция КАК Позиция,
		|	ВыданныеНаправления.Период КАК Период
		|ИЗ
		|	РегистрСведений.ВыданныеНаправленияНаМедицинскийОсмотр КАК ВыданныеНаправления
		|ГДЕ
		|	ВыданныеНаправления.Направление = &Направление";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли