
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройкуИспользоватьПубликацииМероприятийОбученияРазвития(ИспользоватьСамообслуживаниеСотрудников) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиОбученияРазвития.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 
		Или Не НаборЗаписей[0].ИспользоватьОбучениеРазвитиеСотрудников
		Или НаборЗаписей[0].ИспользоватьПубликацииМероприятийОбученияРазвития = ИспользоватьСамообслуживаниеСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ИспользоватьПубликацииМероприятийОбученияРазвития", ИспользоватьСамообслуживаниеСотрудников);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли



