#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РасчетыСБюджетомПоНДФЛ");
	НастройкиВарианта.Описание = НСтр("ru = 'Состояние расчетов с бюджетом по НДФЛ. Положительное сальдо означает просрочку уплаты налога.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РасчетыСБюджетомПоНДФЛПоСтатьям");
	НастройкиВарианта.Описание = НСтр("ru = 'Состояние расчетов с бюджетом по НДФЛ с детализацией по источникам финансирования.
											|Положительное сальдо означает просрочку уплаты налога.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РасчетыСБюджетомПоНДФЛПоИсточникам");
	НастройкиВарианта.Описание = НСтр("ru = 'Состояние расчетов с бюджетом по НДФЛ с детализацией по источникам финансирования.
											|Положительное сальдо означает просрочку уплаты налога.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти
	
#КонецЕсли