
#Область СлужебныеПроцедурыИФункции

Функция МаркерДоступаАктивен(Сайт, ИмяПользователя) Экспорт 
	Возврат ИнтеграцияРекрутинговыхСайтов.МаркерДоступаАктивен(Сайт, ИмяПользователя);
КонецФункции

Процедура ПолучитьОтклики(Вакансия, Сайт) Экспорт
	ИнтеграцияРекрутинговыхСайтов.ПолучитьОтклики(Вакансия, Сайт);
КонецПроцедуры

Функция СнятьВакансиюНаСайте(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.СнятьПубликациюВакансии(Вакансия, Сайт, ИдентификаторВакансии);
КонецФункции

Функция СтруктураДанныхКандидатаССайта(Сайт, ИдентификаторРезюме) Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.СтруктураДанныхКандидатаССайта(Сайт, ИдентификаторРезюме);
КонецФункции

Процедура ЗагрузитьКлассификаторы(Сайт) Экспорт
	ИнтеграцияРекрутинговыхСайтов.ЗагрузитьКлассификаторы(Сайт);
КонецПроцедуры

Функция ВакансииССайта(Сайт) Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.ВакансииССайта(Сайт);
КонецФункции

Функция АвторизацияRabota(ИмяПользователя = Неопределено, Пароль = Неопределено) Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.АвторизацияRabota(ИмяПользователя, Пароль);
КонецФункции

Функция АвторизацияSuperJob(ИмяПользователя = Неопределено, Пароль = Неопределено) Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.АвторизацияSuperJob(ИмяПользователя, Пароль);
КонецФункции

Функция ИспользуемыеСайты() Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.ИспользуемыеСайты();
КонецФункции

Функция ОтметитьПубликациюВакансииСнятой(Вакансия, Сайт) Экспорт
	Возврат ИнтеграцияРекрутинговыхСайтов.ОтметитьПубликациюВакансииСнятой(Вакансия, Сайт);
КонецФункции

#КонецОбласти