#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПредставлениеПериодичности();
	
	МедицинскиеОсмотры.СохранитьПрежнююПериодичностьВредногоФактораВидаРабот(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ПроверитьИзменениеПериодичностиВредногоФактора(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредставлениеПериодичности() Экспорт
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеПериодичностиОсмотра = МедицинскиеОсмотры.ПредставлениеПериодичности(КратностьОсмотра, ПериодичностьОсмотра, ЕдиницаПериодичностиОсмотра);	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли