
#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПериодичностиОсмотров() Экспорт
	
	Описание = Новый Структура(
		"Кратность,
		|Периодичность,
		|ЕдиницаПериодичности,
		|Представление");
	
	Описание.Кратность = 0;
	Описание.Периодичность = 0;
	Описание.ЕдиницаПериодичности = 0;
	Описание.Представление = "";
	
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписаниеПериодичностиПоВредномуФакторуВидуРабот(Описание, Объект) Экспорт
	
	Описание.Кратность = Объект.КратностьОсмотра;
	Описание.Периодичность = Объект.ПериодичностьОсмотра;
	Описание.ЕдиницаПериодичности = Объект.ЕдиницаПериодичностиОсмотра;
	Описание.Представление = Объект.ПредставлениеПериодичностиОсмотра;
	
КонецПроцедуры

#Область ПредставлениеДокументов

Процедура ЗаполнитьПредставлениеДокумента(Данные, Представление, КраткоеПредставлениеВидаДокумента) Экспорт
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 %2 от %3'"), 
		КраткоеПредставлениеВидаДокумента,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер),
		Формат(Данные.Дата, "ДЛФ=D"));
	
КонецПроцедуры

#КонецОбласти

#Область ПредставлениеФакторов

Процедура ЗаполнитьПредставлениеВредногоФактораВидаРабот(Данные, Представление) Экспорт
	
	Представление = Данные.Код + "." + Символы.НПП + Данные.Наименование;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти