#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;	
	РазработкаЭлектронныхКурсовСлужебный.ПроверитьВозможностьЗаписиРегистраПередЗаписью(ЭтотОбъект, Отказ, Замещение);
	РазработкаЭлектронныхКурсовСлужебный.УстановитьДатуИзмененияРегистраПередЗаписью(ЭтотОбъект, Отказ, Замещение);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли