#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуВыбораПериода(ВладелецФормы, ОписаниеПериода, Оповещение = Неопределено, ТолькоПросмотр = Ложь) Экспорт
	
	ПараметрыОткрытия = Новый Структура("ПериодРегистрации,ПериодВвода,ДатаНачала,ДатаОкончания,ЧастьСмены,КоличествоЧасов");
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, ОписаниеПериода);
	
	Если ТолькоПросмотр Тогда
		ПараметрыОткрытия.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериодаОтсутствияСотрудников", ПараметрыОткрытия,
		ВладелецФормы, Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуНовогоДокументаНачисленияОтсутствий(ИмяМетаданныхДокумента, ОписаниеОтсутствия, Владелец, Оповещение, ПараметрыОткрытия = Неопределено) Экспорт
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура;
	КонецЕсли;
	
	ЗначенияЗаполнения = ОтсутствияСотрудниковКлиентСервер.ЗначенияЗаполненияДокумента(
		ИмяМетаданныхДокумента, ОписаниеОтсутствия);
	
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму(ИмяМетаданныхДокумента + ".ФормаОбъекта", ПараметрыОткрытия, Владелец, Истина, , , Оповещение);
	
КонецПроцедуры

#КонецОбласти