#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежнееЗначение", Константы.ИспользоватьПодборПерсонала.Получить());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПрежнееЗначение") Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Истина И ДополнительныеСвойства.ПрежнееЗначение = Ложь Тогда
		РегистрыСведений.НастройкиПодбораПерсонала.УстановитьНастройкиПоУмолчанию();
		РаботаСРабочимКалендаремБЗК.УстановитьНастройкуИспользоватьРабочийКалендарь();
	КонецЕсли;
	
	Если Значение = Ложь И ДополнительныеСвойства.ПрежнееЗначение = Истина Тогда
		РегистрыСведений.НастройкиПодбораПерсонала.СброситьНастройки();
		Константы.ИспользоватьЧатботов.Установить(Ложь);
		Константы.ИспользоватьИнтеграциюРекрутинговыхСайтов.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли