#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьСтраницуПоездкиНаСайте(СистемаБронирования, ИдентификаторПоездки, СтандартнаяОбработка) Экспорт
	
	Если СистемаБронирования <> ПредопределенноеЗначение("Перечисление.СистемыБронированияКомандировок.Smartway") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://" + АдресЛичногоКабинета() + "/trip/" + Формат(ИдентификаторПоездки, "ЧГ="));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресЛичногоКабинета()
	Возврат "po.smartway.today";	
КонецФункции

#КонецОбласти
