
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РабочееМесто") Тогда
		РабочееМесто = Параметры.РабочееМесто;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеГруппы", "Видимость", Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("ПредставлениеГруппы") Тогда
		ПредставлениеГруппы = Параметры.ПредставлениеГруппы;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РабочееМесто", "Видимость", Ложь);
	КонецЕсли;
	
	Сотрудники.ЗагрузитьЗначения(Параметры.Сотрудники);
	
КонецПроцедуры

#КонецОбласти

