#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	ЭлектронноеОбучениеСлужебный.ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, "ТипыТестовыхВопросов", СтандартнаяОбработка);	

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТипВопросаВСтроку(ТипВопроса) Экспорт
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих Тогда
		Возврат "SINGLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих Тогда
		Возврат "MULTIPLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Последовательность Тогда
		Возврат "SEQUENCE";
	КонецЕсли;	
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#КонецЕсли

