
Процедура кдОбменДокЗУППередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(
	"кдОбменЗУПДОК", Источник, Отказ);
КонецПроцедуры

Процедура кдОбменДокЗУППередЗаписьюРегистраПередЗаписью(Источник, Отказ, Замещение) Экспорт
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(
		"кдОбменЗУПДОК", Источник, Отказ, Замещение);
КонецПроцедуры

Процедура кдОбменДокЗУППередУдалениемПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(
		"кдОбменЗУПДОК", Источник, Отказ);
КонецПроцедуры
