
#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьДанныеСогласованияВакансийПриЗаписи(Источник, Отказ) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбновитьДанныеСогласованияВакансийСлужебный(Источник);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьДанныеСогласованияВакансийСлужебный(Источник)
	
	ТребуетсяСогласование = Истина;
	
	НаборЗаписей = РегистрыСведений.СогласованиеВакансий.СоздатьНаборЗаписей();
	
	ДанныеВакансии = НаборЗаписей.Добавить();
	СогласованиеВакансий.ЗаполнитьДанныеСогласованияВакансии(Источник, ДанныеВакансии, ТребуетсяСогласование);
	
	Если Не ТребуетсяСогласование Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	ДанныеСогласования = СогласованиеВакансий.ДанныеСогласования(Источник.Ссылка);
	Если ДанныеСогласования <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеВакансии, ДанныеСогласования);
	КонецЕсли;
	
	НаборЗаписей.Отбор.Вакансия.Установить(Источник.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
