#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции	

Функция ВопросыТеста(Тест)	Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыТеста.СсылкаНаЭлементКурса КАК Ссылка,
		|	ВЫРАЗИТЬ(СтраницыТеста.СсылкаНаЭлементКурса КАК Справочник.ТестовыеВопросы).ТипВопроса КАК ТипВопроса
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыТеста
		|ГДЕ
		|	СтраницыТеста.Владелец = &Тест
		|	И СтраницыТеста.ЭтоГруппа = ЛОЖЬ
		|	И СтраницыТеста.ПометкаУдаления = ЛОЖЬ
		|	И ТИПЗНАЧЕНИЯ(СтраницыТеста.СсылкаНаЭлементКурса) = ТИП(Справочник.ТестовыеВопросы)
		|	И СтраницыТеста.СсылкаНаЭлементКурса.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтраницыТеста.Родитель,
		|	СтраницыТеста.Код";
	
	Запрос.УстановитьПараметр("Тест", Тест);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
