////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дистанционная работа"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.150";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ДистанционнаяРабота.ЗаполнитьДистанционнуюРаботуСотрудников";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d3e990e9-e111-494e-9b49-5622b9e0a2e8");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение дистанционной работы сотрудников для контроля самочувствия.'");
	
КонецПроцедуры

Процедура ЗаполнитьДистанционнуюРаботуСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДистанционнаяРаботаСотрудников.Регистратор
		|ИЗ
		|	РегистрСведений.ДистанционнаяРаботаСотрудников КАК ДистанционнаяРаботаСотрудников";
	
	РезультатЗапроса = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
	
	РезультатЗапроса = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПостроения.Отборы, "ЭтоГоловнойСотрудник", "=", Истина);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПостроения.Отборы, "ВидДоговора", "В", Перечисления.ВидыДоговоровССотрудниками.ВидыДоговоровКромеВоеннойСлужбы());
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(Перечисления.ВидыКадровыхСобытий.Прием);
	ВидыСобытий.Добавить(Перечисления.ВидыКадровыхСобытий.НачальныеДанные);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПостроения.Отборы, "ВидСобытия", "В", ВидыСобытий);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		Метаданные.РегистрыСведений.КадроваяИсторияСотрудников.Имя,
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСотрудникиПериоды", "ФизическоеЛицо"),
		ПараметрыПостроения);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	КадроваяИсторияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадроваяИсторияСотрудников.РегистраторЗаписи КАК Регистратор,
		|	КадроваяИсторияСотрудников.Период КАК Период
		|ИЗ
		|	ВТКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников";
	
	РезультатЗапроса = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОписаниеБлокировки = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников);
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл 
		ОписаниеБлокировки.ПоляБлокировки.Регистратор = Выборка.Регистратор;
		Если ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Набор = РегистрыСведений.ДистанционнаяРаботаСотрудников.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Пока Выборка.Следующий() Цикл 
				Запись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
			КонецЦикла;		
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, , , Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		Иначе
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);		
		КонецЕсли;	
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудниковИнтервальный;
	
КонецПроцедуры

Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления) Экспорт
	
	РегистрыСведений.ДистанционнаяРаботаСотрудников.ЗаполнитьИнтервальныйРегистр(ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокументов

Процедура ДобавитьКомандыПечатиПереводаНаДистанционнуюРаботу(КомандыПечати, ЭтоКадровыйПеревод = Ложь) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКадровыйПеревод Тогда
		ДобавитьКомандуПечатиДопСоглашенияКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу(КомандыПечати);
	КонецЕсли;
	
	ДобавитьКомандуПечатиЗаявленияОПереводеНаДистанционнуюРаботу(КомандыПечати, ЭтоКадровыйПеревод);
	
КонецПроцедуры

Процедура ДобавитьУсловиеВидимостиКоманды(КомандаПечати, ЗначениеУсловия, ИмяУсловия = "РаботаетДистанционно") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, ИмяУсловия, ЗначениеУсловия);
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаДокументов

Процедура ДобавитьКомандыРассылки(Команды) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "ПриемНаРаботу");
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "ПриемНаРаботуСписком");
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "КадровыйПеревод", Истина);
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "КадровыйПереводСписком", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДанныеСотрудников

Функция ДобавитьПолеСведенийОДистанционнойРаботеСотрудников(ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСведенияОДистанционнойРаботеСотрудников(ИмяПоля) Тогда
		
		ДобавленоПолеСведений = Истина;
		ИсточникиДанных.Вставить("СведенияОДистанционнойРаботеСотрудников", Истина);
		
		ПутьКДанным = ПутьКДаннымСведенийОДистанционнойРаботеСотрудников(ИмяПоля);
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
		
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция ДобавитьКритерийПоискаПоСведениямОДистанционнойРаботеСотрудников(КритерииПоиска, УсловиеПоиска) Экспорт
	
	КритерийДобавлен = Ложь;
	Если НеобходимыСведенияОДистанционнойРаботеСотрудников(УсловиеПоиска.ЛевоеЗначение) Тогда
		
		ИмяПоля = ВРег(УсловиеПоиска.ЛевоеЗначение);
		Если ИмяПоля = ВРег("РаботаетДистанционноПериодРегистрации") Тогда
			УсловиеПоиска.ЛевоеЗначение = "Период";
		ИначеЕсли ИмяПоля = ВРег("РаботаетДистанционноРегистратор") Тогда
			УсловиеПоиска.ЛевоеЗначение = "Регистратор";
		КонецЕсли;
		
		КадровыйУчет.ДобавитьКритерийПоискаСотрудников(КритерииПоиска, "РегистрСведений.ДистанционнаяРаботаСотрудников", УсловиеПоиска);
		КритерийДобавлен = Истина;
		
	КонецЕсли; 
	
	Возврат КритерийДобавлен;
	
КонецФункции

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхСотрудников(ДополнительныеПоляПредставлений, ПутьКПолямСотрудника) Экспорт
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РаботаетДистанционно";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЛОЖЬ";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РаботаетДистанционно";
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РаботаетДистанционноПериодРегистрации";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ДАТАВРЕМЯ(1, 1, 1)";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РаботаетДистанционноДатаРегистрации";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВТСведенияОДистанционнойРаботеСотрудников(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИсточникиДанных) Экспорт
	
	Если ИсточникиДанных.Получить("СведенияОДистанционнойРаботеСотрудников") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросВТ = ЗапросВТСведенияОДистанционнойРаботеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СкопироватьПараметрыЗапроса(Запрос, ЗапросВТ);
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ЗапросВТ.Текст);
	ЧастиЗапроса.Добавить(ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов());
	ЧастиЗапроса.Добавить(Запрос.Текст);
	
	ЧастиЗапроса.Добавить(
		"		{ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДистанционнойРаботеСотрудников КАК СведенияОДистанционнойРаботеСотрудников
		|		ПО ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляСотрудник + " = СведенияОДистанционнойРаботеСотрудников.Сотрудник
		|			И ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляПериод + " = СведенияОДистанционнойРаботеСотрудников.Период}");
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "ВТКУничтожению", "ВТСведенияОДистанционнойРаботеСотрудников");
	
КонецПроцедуры

Процедура УстановитьЗапросНабораДанныхПечатнойФормыТ1(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			НаборДанных.Запрос =
				"ВЫБРАТЬ
				|	ПриемНаРаботу.Ссылка КАК СсылкаНаОбъект,
				|	ПриемНаРаботу.ДатаПриема КАК Период,
				|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
				|	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
				|	ПриемНаРаботу.УсловияПриема КАК УсловияПриема
				|ПОМЕСТИТЬ ВТСсылкиНаДокумент
				|ИЗ
				|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
				|ГДЕ
				|	ПриемНаРаботу.Ссылка В (&СсылкиНаОбъекты)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ПриемНаРаботуСпискомСотрудники.Ссылка,
				|	ПриемНаРаботуСпискомСотрудники.ДатаПриема,
				|	ПриемНаРаботуСпискомСотрудники.Сотрудник,
				|	ПриемНаРаботуСпискомСотрудники.ДлительностьИспытательногоСрока,
				|	ПриемНаРаботуСпискомСотрудники.УсловияПриема
				|ИЗ
				|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
				|ГДЕ
				|	ПриемНаРаботуСпискомСотрудники.Ссылка В (&СсылкиНаОбъекты)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	"""" КАК ФИОПолные,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПриема,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоговораКонтракта,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
				|	"""" КАК НомерДоговораКонтракта,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЛОЖЬ КАК РаботаетДистанционно,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	0 КАК ТарифнаяСтавка,
				|	0 КАК Надбавка
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СсылкиНаДокумент.СсылкаНаОбъект.Руководитель КАК ФизическоеЛицо,
				|	СсылкиНаДокумент.Период КАК Период
				|ПОМЕСТИТЬ ВТОтветственныеЛица
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
				|	"""" КАК ИОФамилия
				|ПОМЕСТИТЬ Представления_КадровыеДанныеФизическихЛиц
				|ИЗ
				|	ВТОтветственныеЛица КАК ОтветственныеЛица
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СсылкиНаДокумент.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	Представления_КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
				|	Представления_КадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
				|	Представления_КадровыеДанныеСотрудников.Организация КАК Организация,
				|	Представления_КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
				|	Представления_КадровыеДанныеСотрудников.Должность КАК Должность,
				|	Представления_КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
				|	Представления_КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно,
				|	Представления_КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
				|	Представления_КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
				|	Представления_КадровыеДанныеСотрудников.Надбавка КАК Надбавка,
				|	Представления_КадровыеДанныеСотрудников.ДатаОкончания КАК ДатаОкончания,
				|	КадровыеДанныеФизическихЛиц.ИОФамилия КАК РуководительРасшифровкаПодписи,
				|	СсылкиНаДокумент.СсылкаНаОбъект.Организация КАК СсылкаНаОбъектОрганизация,
				|	СсылкиНаДокумент.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
				|	СсылкиНаДокумент.УсловияПриема КАК УсловияПриема
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК Представления_КадровыеДанныеСотрудников
				|		ПО СсылкиНаДокумент.Период = Представления_КадровыеДанныеСотрудников.Период
				|		И СсылкиНаДокумент.Сотрудник = Представления_КадровыеДанныеСотрудников.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
				|		ПО СсылкиНаДокумент.Период = КадровыеДанныеФизическихЛиц.Период
				|		И СсылкиНаДокумент.СсылкаНаОбъект.Руководитель = КадровыеДанныеФизическихЛиц.ФизическоеЛицо";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗапросНабораДанныхПечатнойФормыТ1А(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			НаборДанных.Запрос =
				"ВЫБРАТЬ
				|	ПриемНаРаботуСпискомСотрудники.Ссылка КАК СсылкаНаОбъект,
				|	ПриемНаРаботуСпискомСотрудники.ДатаПриема КАК Период,
				|	ПриемНаРаботуСпискомСотрудники.Сотрудник КАК Сотрудник,
				|	ПриемНаРаботуСпискомСотрудники.НомерСтроки КАК НомерСтроки,
				|	ПриемНаРаботуСпискомСотрудники.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
				|	ПриемНаРаботуСпискомСотрудники.УсловияПриема КАК УсловияПриема,
				|	ПриемНаРаботуСпискомСотрудники.РазрешениеНаРаботу КАК РазрешениеНаРаботу,
				|	ПриемНаРаботуСпискомСотрудники.РазрешениеНаПроживание КАК РазрешениеНаПроживание,
				|	ПриемНаРаботуСпискомСотрудники.УсловияОказанияМедпомощи КАК УсловияОказанияМедпомощи
				|ПОМЕСТИТЬ ВТСотрудникиДокумента
				|ИЗ
				|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
				|ГДЕ
				|	ПриемНаРаботуСпискомСотрудники.Ссылка В (&СсылкиНаОбъекты)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	"""" КАК ФИОПолные,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПриема,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоговораКонтракта,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
				|	"""" КАК НомерДоговораКонтракта,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	ЛОЖЬ КАК РаботаетДистанционно,
				|	0 КАК ТарифнаяСтавка,
				|	0 КАК Надбавка
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиДокумента.СсылкаНаОбъект.Руководитель КАК ФизическоеЛицо,
				|	СотрудникиДокумента.Период КАК Период
				|ПОМЕСТИТЬ ВТОтветственныеЛица
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
				|	"""" КАК ИОФамилия
				|ПОМЕСТИТЬ Представления_КадровыеДанныеФизическихЛиц
				|ИЗ
				|	ВТОтветственныеЛица КАК ОтветственныеЛица
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СотрудникиДокумента.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	Представления_КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
				|	Представления_КадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
				|	Представления_КадровыеДанныеСотрудников.Организация КАК Организация,
				|	Представления_КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
				|	Представления_КадровыеДанныеСотрудников.Должность КАК Должность,
				|	Представления_КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
				|	Представления_КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно,
				|	Представления_КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
				|	Представления_КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
				|	Представления_КадровыеДанныеСотрудников.Надбавка КАК Надбавка,
				|	Представления_КадровыеДанныеСотрудников.ДатаОкончания КАК ДатаОкончания,
				|	КадровыеДанныеФизическихЛиц.ИОФамилия КАК РуководительРасшифровкаПодписи,
				|	СотрудникиДокумента.Период КАК Период,
				|	СотрудникиДокумента.НомерСтроки КАК НомерСтроки,
				|	СотрудникиДокумента.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
				|	СотрудникиДокумента.УсловияПриема КАК УсловияПриема,
				|	СотрудникиДокумента.РазрешениеНаРаботу КАК РазрешениеНаРаботу,
				|	СотрудникиДокумента.РазрешениеНаПроживание КАК РазрешениеНаПроживание,
				|	СотрудникиДокумента.УсловияОказанияМедпомощи КАК УсловияОказанияМедпомощи,
				|	СотрудникиДокумента.СсылкаНаОбъект.Организация КАК СсылкаНаОбъектОрганизация
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК Представления_КадровыеДанныеСотрудников
				|		ПО СотрудникиДокумента.Период = Представления_КадровыеДанныеСотрудников.Период
				|		И СотрудникиДокумента.Сотрудник = Представления_КадровыеДанныеСотрудников.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
				|		ПО СотрудникиДокумента.Период = КадровыеДанныеФизическихЛиц.Период
				|		И СотрудникиДокумента.СсылкаНаОбъект.Руководитель = КадровыеДанныеФизическихЛиц.ФизическоеЛицо";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗапросНабораДанныхПечатнойФормыТ5(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			НаборДанных.Запрос =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КадровыйПеревод.Ссылка КАК СсылкаНаОбъект,
				|	КадровыйПеревод.Сотрудник КАК Сотрудник,
				|	ИСТИНА КАК ДанныеПеревода,
				|	КадровыйПеревод.ДатаНачала КАК ДатаНачалаПеревода,
				|	КадровыйПеревод.ДатаОкончания КАК ДатаОкончанияПеревода,
				|	КадровыйПеревод.ОснованиеПеревода КАК ОснованиеПеревода,
				|	КадровыйПеревод.ПричинаПеревода КАК ПричинаПеревода,
				|	ЕСТЬNULL(КадроваяИсторияСотрудников.Период, ЕСТЬNULL(ДистанционнаяРаботаСотрудников.Период,
				|		КОНЕЦПЕРИОДА(КадровыйПеревод.ДатаНачала, ДЕНЬ))) КАК Период
				|ПОМЕСТИТЬ ВТСсылкиНаДокумент
				|ИЗ
				|	Документ.КадровыйПеревод КАК КадровыйПеревод
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
				|		ПО КадровыйПеревод.Ссылка = КадроваяИсторияСотрудников.Регистратор
				|		И КадровыйПеревод.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
				|		И КадровыйПеревод.ДатаНачала = НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период, ДЕНЬ)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДистанционнаяРаботаСотрудников КАК ДистанционнаяРаботаСотрудников
				|		ПО КадровыйПеревод.Ссылка = ДистанционнаяРаботаСотрудников.Регистратор
				|		И КадровыйПеревод.Сотрудник = ДистанционнаяРаботаСотрудников.Сотрудник
				|		И КадровыйПеревод.ДатаНачала = НАЧАЛОПЕРИОДА(ДистанционнаяРаботаСотрудников.Период, ДЕНЬ)
				|ГДЕ
				|	КадровыйПеревод.Ссылка В (&СсылкиНаОбъекты)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	КадровыйПереводСпискомСотрудники.Ссылка,
				|	КадровыйПереводСпискомСотрудники.Сотрудник,
				|	ИСТИНА,
				|	КадровыйПереводСпискомСотрудники.ДатаНачала,
				|	КадровыйПереводСпискомСотрудники.ДатаОкончания,
				|	КадровыйПереводСпискомСотрудники.ОснованиеПеревода,
				|	КадровыйПереводСпискомСотрудники.ПричинаПеревода,
				|	ЕСТЬNULL(КадроваяИсторияСотрудников.Период, ЕСТЬNULL(ДистанционнаяРаботаСотрудников.Период,
				|		КОНЕЦПЕРИОДА(КадровыйПереводСпискомСотрудники.ДатаНачала, ДЕНЬ)))
				|ИЗ
				|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыйПереводСпискомСотрудники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
				|		ПО КадровыйПереводСпискомСотрудники.Ссылка = КадроваяИсторияСотрудников.Регистратор
				|		И КадровыйПереводСпискомСотрудники.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
				|		И КадровыйПереводСпискомСотрудники.ДатаНачала = НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период, ДЕНЬ)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДистанционнаяРаботаСотрудников КАК ДистанционнаяРаботаСотрудников
				|		ПО КадровыйПереводСпискомСотрудники.Ссылка = ДистанционнаяРаботаСотрудников.Регистратор
				|		И КадровыйПереводСпискомСотрудники.Сотрудник = ДистанционнаяРаботаСотрудников.Сотрудник
				|		И КадровыйПереводСпискомСотрудники.ДатаНачала = НАЧАЛОПЕРИОДА(ДистанционнаяРаботаСотрудников.Период, ДЕНЬ)
				|ГДЕ
				|	КадровыйПереводСпискомСотрудники.Ссылка В (&СсылкиНаОбъекты)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ПеремещениеВДругоеПодразделениеСотрудники.Ссылка,
				|	ПеремещениеВДругоеПодразделениеСотрудники.Сотрудник,
				|	ИСТИНА,
				|	ПеремещениеВДругоеПодразделениеСотрудники.Ссылка.ДатаПеремещения,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЕСТЬNULL(КадроваяИсторияСотрудников.Период,
				|		КОНЕЦПЕРИОДА(ПеремещениеВДругоеПодразделениеСотрудники.Ссылка.ДатаПеремещения, ДЕНЬ))
				|ИЗ
				|	Документ.ПеремещениеВДругоеПодразделение.Сотрудники КАК ПеремещениеВДругоеПодразделениеСотрудники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
				|		ПО ПеремещениеВДругоеПодразделениеСотрудники.Ссылка = КадроваяИсторияСотрудников.Регистратор
				|		И ПеремещениеВДругоеПодразделениеСотрудники.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
				|		И
				|			ПеремещениеВДругоеПодразделениеСотрудники.Ссылка.ДатаПеремещения = НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период,
				|			ДЕНЬ)
				|ГДЕ
				|	ПеремещениеВДругоеПодразделениеСотрудники.Ссылка В (&СсылкиНаОбъекты)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СсылкиНаДокумент.Сотрудник КАК Сотрудник,
				|	ДОБАВИТЬКДАТЕ(СсылкиНаДокумент.Период, СЕКУНДА, -1) КАК Период
				|ПОМЕСТИТЬ ВТСсылкиНаДокументПрежние
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЛОЖЬ КАК РаботаетДистанционно,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	0 КАК ТарифнаяСтавка,
				|	0 КАК Надбавка
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников_Прежние
				|ИЗ
				|	ВТСсылкиНаДокументПрежние КАК СсылкиНаДокумент
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|	И ""ФормироватьСПериодичностьДень"" = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	"""" КАК ФИОПолные,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоговораКонтракта,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
				|	"""" КАК НомерДоговораКонтракта,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЛОЖЬ КАК РаботаетДистанционно,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	0 КАК ТарифнаяСтавка,
				|	0 КАК Надбавка
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|	И ""ФормироватьСПериодичностьДень"" = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СсылкиНаДокумент.СсылкаНаОбъект.Руководитель КАК ФизическоеЛицо,
				|	СсылкиНаДокумент.Период КАК Период
				|ПОМЕСТИТЬ ВТОтветственныеЛица
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
				|	"""" КАК ИОФамилия
				|ПОМЕСТИТЬ Представления_КадровыеДанныеФизическихЛиц
				|ИЗ
				|	ВТОтветственныеЛица КАК ОтветственныеЛица
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СсылкиНаДокумент.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
				|	КадровыеДанныеСотрудников.Организация КАК Организация,
				|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
				|	КадровыеДанныеСотрудников.Должность КАК Должность,
				|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
				|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
				|	КадровыеДанныеСотрудников.Надбавка КАК Надбавка,
				|	КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно,
				|	КадровыеДанныеСотрудниковПрежние.Организация КАК ОрганизацияПрежняя,
				|	КадровыеДанныеСотрудниковПрежние.Подразделение КАК ПодразделениеПрежнее,
				|	КадровыеДанныеСотрудниковПрежние.Должность КАК ДолжностьПрежняя,
				|	КадровыеДанныеСотрудниковПрежние.РазрядКатегория КАК РазрядКатегорияПрежняя,
				|	КадровыеДанныеСотрудниковПрежние.РаботаетДистанционно КАК РаботаетДистанционноПрежняя,
				|	КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
				|	КадровыеДанныеСотрудников.ДатаОкончания КАК ДатаОкончания,
				|	КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
				|	КадровыеДанныеФизическихЛиц.ИОФамилия КАК РуководительРасшифровкаПодписи,
				|	КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
				|	СсылкиНаДокумент.СсылкаНаОбъект.Организация КАК СсылкаНаОбъектОрганизация,
				|	СсылкиНаДокумент.ДатаНачалаПеревода КАК ДатаНачалаПеревода,
				|	СсылкиНаДокумент.ДатаОкончанияПеревода КАК ДатаОкончанияПеревода,
				|	СсылкиНаДокумент.ОснованиеПеревода КАК ОснованиеПеревода,
				|	СсылкиНаДокумент.ПричинаПеревода КАК ПричинаПеревода
				|ИЗ
				|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
				|		ПО СсылкиНаДокумент.Период = КадровыеДанныеСотрудников.Период
				|		И СсылкиНаДокумент.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников_Прежние КАК КадровыеДанныеСотрудниковПрежние
				|		ПО ДОБАВИТЬКДАТЕ(СсылкиНаДокумент.Период, СЕКУНДА, -1) = КадровыеДанныеСотрудниковПрежние.Период
				|		И СсылкиНаДокумент.Сотрудник = КадровыеДанныеСотрудниковПрежние.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
				|		ПО СсылкиНаДокумент.Период = КадровыеДанныеФизическихЛиц.Период
				|		И СсылкиНаДокумент.СсылкаНаОбъект.Руководитель = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
				|ГДЕ
				|	СсылкиНаДокумент.ДанныеПеревода";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗапросНабораДанныхПечатнойФормыТ5А(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			НаборДанных.Запрос =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КадровыйПереводСпискомСотрудники.Ссылка КАК СсылкаНаОбъект,
				|	КадровыйПереводСпискомСотрудники.ДатаНачала КАК ДатаНачалаПеревода,
				|	КадровыйПереводСпискомСотрудники.ДатаОкончания КАК ДатаОкончанияПеревода,
				|	КадровыйПереводСпискомСотрудники.Сотрудник КАК Сотрудник,
				|	КадровыйПереводСпискомСотрудники.НомерСтроки КАК НомерСтроки,
				|	ЕСТЬNULL(КадроваяИсторияСотрудников.Период, ЕСТЬNULL(ДистанционнаяРаботаСотрудников.Период,
				|		КОНЕЦПЕРИОДА(КадровыйПереводСпискомСотрудники.ДатаНачала, ДЕНЬ))) КАК Период
				|ПОМЕСТИТЬ ВТСотрудникиДокумента
				|ИЗ
				|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыйПереводСпискомСотрудники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
				|		ПО КадровыйПереводСпискомСотрудники.Ссылка = КадроваяИсторияСотрудников.Регистратор
				|		И КадровыйПереводСпискомСотрудники.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
				|		И КадровыйПереводСпискомСотрудники.ДатаНачала = НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период, ДЕНЬ)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДистанционнаяРаботаСотрудников КАК ДистанционнаяРаботаСотрудников
				|		ПО КадровыйПереводСпискомСотрудники.Ссылка = ДистанционнаяРаботаСотрудников.Регистратор
				|		И КадровыйПереводСпискомСотрудники.Сотрудник = ДистанционнаяРаботаСотрудников.Сотрудник
				|		И КадровыйПереводСпискомСотрудники.ДатаНачала = НАЧАЛОПЕРИОДА(ДистанционнаяРаботаСотрудников.Период, ДЕНЬ)
				|ГДЕ
				|	КадровыйПереводСпискомСотрудники.Ссылка В (&СсылкиНаОбъекты)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиДокумента.Сотрудник КАК Сотрудник,
				|	ДОБАВИТЬКДАТЕ(СотрудникиДокумента.Период, СЕКУНДА, -1) КАК Период
				|ПОМЕСТИТЬ ВТСотрудникиДокументаПрежние
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	ЛОЖЬ КАК РаботаетДистанционно,
				|	0 КАК ТарифнаяСтавка,
				|	0 КАК Надбавка
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников_Прежние
				|ИЗ
				|	ВТСотрудникиДокументаПрежние КАК СотрудникиДокумента
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|	И ""ФормироватьСПериодичностьДень"" = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	"""" КАК ФИОПолные,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоговораКонтракта,
				|	"""" КАК НомерДоговораКонтракта,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	ЛОЖЬ КАК РаботаетДистанционно,
				|	0 КАК ТарифнаяСтавка,
				|	0 КАК Надбавка
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|	И ""ФормироватьСПериодичностьДень"" = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиДокумента.СсылкаНаОбъект.Руководитель КАК ФизическоеЛицо,
				|	СотрудникиДокумента.Период КАК Период
				|ПОМЕСТИТЬ ВТОтветственныеЛица
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
				|	"""" КАК ИОФамилия
				|ПОМЕСТИТЬ Представления_КадровыеДанныеФизическихЛиц
				|ИЗ
				|	ВТОтветственныеЛица КАК ОтветственныеЛица
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СотрудникиДокумента.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	СотрудникиДокумента.НомерСтроки КАК НомерСтроки,
				|	Представления_КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
				|	СотрудникиДокумента.ДатаНачалаПеревода КАК ДатаНачалаПеревода,
				|	СотрудникиДокумента.ДатаОкончанияПеревода КАК ДатаОкончанияПеревода,
				|	Представления_КадровыеДанныеСотрудников.Организация КАК Организация,
				|	Представления_КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
				|	Представления_КадровыеДанныеСотрудников.Должность КАК Должность,
				|	Представления_КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
				|	Представления_КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно,
				|	Представления_КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
				|	Представления_КадровыеДанныеСотрудников.Надбавка КАК Надбавка,
				|	КадровыеДанныеСотрудниковПрежние.Организация КАК ОрганизацияПрежняя,
				|	КадровыеДанныеСотрудниковПрежние.Подразделение КАК ПодразделениеПрежнее,
				|	КадровыеДанныеСотрудниковПрежние.Должность КАК ДолжностьПрежняя,
				|	КадровыеДанныеСотрудниковПрежние.РазрядКатегория КАК РазрядКатегорияПрежняя,
				|	КадровыеДанныеСотрудниковПрежние.РаботаетДистанционно КАК РаботаетДистанционноПрежнее,
				|	Представления_КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
				|	КадровыеДанныеФизическихЛиц.ИОФамилия КАК РуководительРасшифровкаПодписи,
				|	Представления_КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
				|	СотрудникиДокумента.СсылкаНаОбъект.Организация КАК СсылкаНаОбъектОрганизация
				|ИЗ
				|	ВТСотрудникиДокумента КАК СотрудникиДокумента
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК Представления_КадровыеДанныеСотрудников
				|		ПО СотрудникиДокумента.Период = Представления_КадровыеДанныеСотрудников.Период
				|		И СотрудникиДокумента.Сотрудник = Представления_КадровыеДанныеСотрудников.Сотрудник
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников_Прежние КАК КадровыеДанныеСотрудниковПрежние
				|		ПО ДОБАВИТЬКДАТЕ(СотрудникиДокумента.Период, СЕКУНДА, -1) = КадровыеДанныеСотрудниковПрежние.Период
				|		И СотрудникиДокумента.Сотрудник = КадровыеДанныеСотрудниковПрежние.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
				|		ПО СотрудникиДокумента.Период = КадровыеДанныеФизическихЛиц.Период
				|		И СотрудникиДокумента.СсылкаНаОбъект.Руководитель = КадровыеДанныеФизическихЛиц.ФизическоеЛицо";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗапросНабораДанныхОтчетаПоСотрудникам(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			НаборДанных.Запрос =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Сотрудники.Ссылка КАК Сотрудник,
				|	ВЫБОР
				|		КОГДА &ВыводитьДанныеПредстоящихПриемов
				|		И &Период < ТекущиеКадровыеДанныеСотрудников.ДатаПриема
				|			ТОГДА ТекущиеКадровыеДанныеСотрудников.ДатаПриема
				|		ИНАЧЕ &Период
				|	КОНЕЦ КАК Период
				|ПОМЕСТИТЬ ВТСотрудники
				|{ВЫБРАТЬ
				|	Сотрудник.*}
				|ИЗ
				|	Справочник.Сотрудники КАК Сотрудники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
				|		ПО Сотрудники.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
				|		И Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
				|ГДЕ
				|	Сотрудники.Ссылка = Сотрудники.ГоловнойСотрудник
				|{ГДЕ
				|	Сотрудники.Ссылка.* КАК Сотрудник,
				|	Сотрудники.Код КАК ТабельныйНомер,
				|	Сотрудники.ФизическоеЛицо.*,
				|	Сотрудники.ГоловнаяОрганизация.*,
				|	Сотрудники.ТекущийПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки,
				|	Сотрудники.ФизическоеЛицо.Пол КАК Пол,
				|	Сотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
				|	Сотрудники.ФизическоеЛицо.ИНН КАК ИНН,
				|	Сотрудники.ФизическоеЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
				|	Сотрудники.ФизическоеЛицо.МестоРождения КАК МестоРождения}
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
				|	"""" КАК ТабельныйНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК РабочееМестоПериодРегистрации,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК РабочееМестоРегистратор,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка) КАК ДолжностьПоШтатномуРасписанию,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ГрафикРаботыПериодРегистрации,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК ГрафикРаботыРегистратор,
				|	ЗНАЧЕНИЕ(Справочник.ГрафикиРаботыСотрудников.ПустаяСсылка) КАК ГрафикРаботы,
				|	0 КАК КоличествоСтавок,
				|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости,
				|	ЗНАЧЕНИЕ(Справочник.ТарифныеСетки.ПустаяСсылка) КАК ТарифнаяСетка,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК РазрядКатегорияПериодРегистрации,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК РазрядКатегорияРегистратор,
				|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
				|	ЗНАЧЕНИЕ(Справочник.ТарифныеСетки.ПустаяСсылка) КАК ТарифнаяСеткаНадбавки,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК СостояниеПериодРегистрации,
				|	ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ПустаяСсылка) КАК Состояние,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ОплатаТрудаПериодЗаписи,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК ОплатаТрудаРегистратор,
				|	0 КАК ТарифнаяСтавка,
				|	ЗНАЧЕНИЕ(Справочник.ПоказателиРасчетаЗарплаты.ПустаяСсылка) КАК ПоказательТарифнойСтавки,
				|	0 КАК ДоляНеполногоРабочегоВремени,
				|	0 КАК Надбавка,
				|	0 КАК ФОТ,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК АвансПериодРегистрации,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК АвансРегистратор,
				|	0 КАК Аванс,
				|	ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаАванса.ПустаяСсылка) КАК СпособРасчетаАванса,
				|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(4, 2)) КАК ПроцентСевернойНадбавки,
				|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияСеверныхНадбавок.ПустаяСсылка) КАК ПорядокИсчисленияПроцентаСевернойНадбавки,
				|	ИСТИНА КАК ПроцентСевернойНадбавкиИзменяется,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПриема,
				|	"""" КАК ТрудовойДоговорНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ТрудовойДоговорДата,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК ПриказОПриеме,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ПриказОПриемеДатаЗавершенияТрудовогоДоговора,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения,
				|	ЗНАЧЕНИЕ(Документ.Увольнение.ПустаяСсылка) КАК ПриказОбУвольнении,
				|	ЗНАЧЕНИЕ(Справочник.ОснованияУвольнения.ПустаяСсылка) КАК ПриказОбУвольненииСтатьяТКРФ,
				|	"""" КАК ПриказОбУвольненииНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ПриказОбУвольненииДата,
				|	ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка) КАК Пол,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРождения,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ИНН,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК СтраховойНомерПФР,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК МестоРождения,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ГражданствоПериодРегистрации,
				|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК Страна,
				|	"""" КАК ИННВСтранеГражданства,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ВидЗастрахованногоЛицаПериодРегистрации,
				|	ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПустаяСсылка) КАК ВидЗастрахованногоЛица,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ФИОПериодРегистрации,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК Фамилия,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК Имя,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК Отчество,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ФИОПолные,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДокументПериодРегистрации,
				|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПустаяСсылка) КАК ДокументВид,
				|	"""" КАК ДокументКодМВД,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ДокументСерия,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ДокументНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДокументДатаВыдачи,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДокументСрокДействия,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ДокументКемВыдан,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ДокументКодПодразделения,
				|	"""" КАК ДокументПредставление,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК АдресПоПрописке,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК АдресПоПропискеПредставление,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистрации,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК АдресМестаПроживания,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК АдресМестаПроживанияПредставление,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ТелефонМобильныйПредставление,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ТелефонДомашнийПредставление,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК ТелефонРабочийПредставление,
				|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК EMailПредставление,
				|	ЗНАЧЕНИЕ(Справочник.ЯзыкиНародовМира.ПустаяСсылка) КАК ВладеемыйЯзык1,
				|	ЗНАЧЕНИЕ(Справочник.СтепениЗнанияЯзыка.ПустаяСсылка) КАК ВладеемыйЯзык1СтепеньЗнания,
				|	ЗНАЧЕНИЕ(Справочник.ЯзыкиНародовМира.ПустаяСсылка) КАК ВладеемыйЯзык2,
				|	ЗНАЧЕНИЕ(Справочник.СтепениЗнанияЯзыка.ПустаяСсылка) КАК ВладеемыйЯзык2СтепеньЗнания,
				|	ЗНАЧЕНИЕ(Справочник.ПрофессииРабочих.ПустаяСсылка) КАК Профессия1,
				|	ЗНАЧЕНИЕ(Справочник.ПрофессииРабочих.ПустаяСсылка) КАК Профессия2,
				|	0 КАК ОбщийСтажДней,
				|	0 КАК ОбщийСтажМесяцев,
				|	0 КАК ОбщийСтажЛет,
				|	0 КАК НепрерывныйСтажДней,
				|	0 КАК НепрерывныйСтажМесяцев,
				|	0 КАК НепрерывныйСтажЛет,
				|	0 КАК СтажНаНадбавкуЗаВыслугуЛетДней,
				|	0 КАК СтажНаНадбавкуЗаВыслугуЛетМесяцев,
				|	0 КАК СтажНаНадбавкуЗаВыслугуЛетЛет,
				|	0 КАК СтраховойСтажДней,
				|	0 КАК СтраховойСтажМесяцев,
				|	0 КАК СтраховойСтажЛет,
				|	0 КАК РасширенныйСтраховойСтажДней,
				|	0 КАК РасширенныйСтраховойСтажМесяцев,
				|	0 КАК РасширенныйСтраховойСтажЛет,
				|	0 КАК ПрочийСтажДней,
				|	0 КАК ПрочийСтажМесяцев,
				|	0 КАК ПрочийСтажЛет,
				|	0 КАК ОбщийНаучноПедагогическийСтажДней,
				|	0 КАК ОбщийНаучноПедагогическийСтажМесяцев,
				|	0 КАК ОбщийНаучноПедагогическийСтажЛет,
				|	0 КАК ПедагогическийСтажДней,
				|	0 КАК ПедагогическийСтажМесяцев,
				|	0 КАК ПедагогическийСтажЛет,
				|	0 КАК СеверныйСтажДней,
				|	0 КАК СеверныйСтажМесяцев,
				|	0 КАК СеверныйСтажЛет,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК СостояниеВБракеПериодРегистрации,
				|	ЗНАЧЕНИЕ(Справочник.СостояниеВБраке.ПустаяСсылка) КАК СостояниеВБраке,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ВоинскийУчетПериодРегистрации,
				|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗапасаВоеннообязанных.ПустаяСсылка) КАК ВоинскийУчетКатегорияЗапаса,
				|	ЗНАЧЕНИЕ(Справочник.ЗванияГражданскогоВоинскогоУчета.ПустаяСсылка) КАК ВоинскийУчетЗвание,
				|	ЗНАЧЕНИЕ(Справочник.СоставыВоеннослужащих.ПустаяСсылка) КАК ВоинскийУчетСостав,
				|	"""" КАК ВоинскийУчетВУС,
				|	ЗНАЧЕНИЕ(Перечисление.ГодностьКВоеннойСлужбе.ПустаяСсылка) КАК ВоинскийУчетГодность,
				|	ЗНАЧЕНИЕ(Справочник.Военкоматы.ПустаяСсылка) КАК ВоинскийУчетВоенкомат,
				|	"""" КАК ВоинскийУчетНомерКомандыПартии,
				|	ЗНАЧЕНИЕ(Справочник.ПереченьДолжностейДляБронированияГраждан.ПустаяСсылка) КАК ВоинскийУчетПунктПеречня,
				|	ИСТИНА КАК ВоинскийУчетНаличиеМобпредписания,
				|	ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.ПустаяСсылка) КАК ВоинскийУчетОтношениеКВоинскойОбязанности,
				|	ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.ПустаяСсылка) КАК ВоинскийУчетОтношениеКВоинскомуУчету,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ВоинскийУчетЗабронированОрганизациейПериодРегистрации,
				|	ЗНАЧЕНИЕ(Документ.БронированиеГражданПребывающихВЗапасе.ПустаяСсылка) КАК
				|		ВоинскийУчетЗабронированОрганизациейРегистратор,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ВоинскийУчетЗабронированОрганизацией,
				|	ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка) КАК ПослеВузовскоеОбразованиеУчебноеЗаведение,
				|	ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка) КАК ПослеВузовскоеОбразованиеВидОбразования,
				|	ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка) КАК
				|		ПослеВузовскоеОбразованиеВидПослевузовскогоОбразования,
				|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовОбОбразовании.ПустаяСсылка) КАК ПослеВузовскоеОбразованиеВидДокумента,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ПослеВузовскоеОбразованиеНачало,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ПослеВузовскоеОбразованиеОкончание,
				|	"""" КАК ПослеВузовскоеОбразованиеСерия,
				|	"""" КАК ПослеВузовскоеОбразованиеНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ПослеВузовскоеОбразованиеДатаВыдачи,
				|	ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка) КАК
				|		ПослеВузовскоеОбразованиеСпециальность,
				|	"""" КАК ПослеВузовскоеОбразованиеКвалификация,
				|	ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка) КАК Образование1УчебноеЗаведение,
				|	ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка) КАК Образование1ВидОбразования,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Образование1Начало,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Образование1Окончание,
				|	ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка) КАК Образование1Специальность,
				|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовОбОбразовании.ПустаяСсылка) КАК Образование1ВидДокумента,
				|	"""" КАК Образование1Серия,
				|	"""" КАК Образование1Номер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Образование1ДатаВыдачи,
				|	"""" КАК Образование1Квалификация,
				|	ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка) КАК Образование2УчебноеЗаведение,
				|	ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка) КАК Образование2ВидОбразования,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Образование2Начало,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Образование2Окончание,
				|	ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка) КАК Образование2Специальность,
				|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовОбОбразовании.ПустаяСсылка) КАК Образование2ВидДокумента,
				|	"""" КАК Образование2Серия,
				|	"""" КАК Образование2Номер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК Образование2ДатаВыдачи,
				|	"""" КАК Образование2Квалификация,
				|	ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка) КАК ВысшееОбразованиеУчебноеЗаведение,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ВысшееОбразованиеНачало,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ВысшееОбразованиеОкончание,
				|	ЗНАЧЕНИЕ(Справочник.УченыеСтепени.ПустаяСсылка) КАК УченаяСтепень,
				|	ЗНАЧЕНИЕ(Справочник.ОтраслиНауки.ПустаяСсылка) КАК УченаяСтепеньОтрасльНауки,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК УченаяСтепеньДатаПрисуждения,
				|	"""" КАК УченаяСтепеньДиссертационныйСовет,
				|	"""" КАК УченаяСтепеньДипломСерияНомер,
				|	"""" КАК УченаяСтепеньОрганизация,
				|	ЗНАЧЕНИЕ(Справочник.УченыеЗвания.ПустаяСсылка) КАК УченоеЗвание,
				|	"""" КАК УченоеЗваниеАттестатСерия,
				|	"""" КАК УченоеЗваниеАттестатНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК УченоеЗваниеДатаПрисвоения,
				|	"""" КАК УченоеЗваниеОрганизация,
				|	ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка) КАК УченоеЗваниеСпециальность,
				|	ЛОЖЬ КАК ИмеетНаучныеТруды,
				|	ЛОЖЬ КАК ИмеетИзобретения,
				|	ЗНАЧЕНИЕ(Справочник.Награды.ПустаяСсылка) КАК ПочетноеЗвание,
				|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка) КАК ВидДоговора,
				|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка) КАК ТекущийВидДоговора,
				|	"""" КАК ПолученныеОбразования,
				|	"""" КАК Награды,
				|	"""" КАК Документы,
				|	"""" КАК ЗнанияЯзыков,
				|	"""" КАК Профессии,
				|	"""" КАК Специальности,
				|	"""" КАК ТрудоваяДеятельность,
				|	"""" КАК СоставСемьи,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоговораКонтракта,
				|	"""" КАК НомерДоговораКонтракта,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ПредставительНанимателя,
				|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК ДолжностьПредставителяНанимателя,
				|	"""" КАК ОснованиеПредставителя,
				|	"""" КАК ВидАктаГосоргана,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
				|	ЛОЖЬ КАК СрочныйДоговор,
				|	ЛОЖЬ КАК СезонныйДоговор,
				|	"""" КАК СрокЗаключенияДоговора,
				|	"""" КАК ОборудованиеРабочегоМеста,
				|	"""" КАК ИныеУсловияДоговора,
				|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК ВладелецМестаВыплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВидыМестВыплатыЗарплаты.ПустаяСсылка) КАК ВидМестаВыплаты,
				|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК МестоВыплаты,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК СтатусНалогоплательщикаПериодРегистрации,
				|	ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ПустаяСсылка) КАК СтатусНалогоплательщика,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК УчетЗатратПериодРегистрации,
				|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
				|	ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка) КАК СпособОтраженияЗарплатыВБухучете,
				|	ИСТИНА КАК ОтношениеКЕНВД,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ЗарплатныйПроектДатаОткрытияЛицевогоСчета,
				|	ЗНАЧЕНИЕ(Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников) КАК ЗарплатныйПроектРегистратор,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ЗарплатныйПроект,
				|	"""" КАК НомерЛицевогоСчета,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ИнвалидностьПериодРегистрации,
				|	ИСТИНА КАК Инвалидность,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ИнвалидностьДатаВыдачи,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ИнвалидностьСрокДействияСправки,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ТерриторияПериодРегистрации,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) КАК ТерриторияРегистратор,
				|	ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка) КАК Территория,
				|	ЛОЖЬ КАК РаботаетДистанционно
				|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
				|ИЗ
				|	ВТСотрудники КАК ВТСотрудники
				|ГДЕ
				|	""ТолькоРазрешенные"" = ИСТИНА
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.КадровыйПеревод.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.КадровыйПеревод.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
				|	NULL,
				|	ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.ИзменениеГрафикаРаботыСписком.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.ИзменениеКвалификационногоРазряда.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
				|	NULL,
				|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботуСписком.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботуСписком.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	ЗНАЧЕНИЕ(Справочник.ЗарплатныеПроекты.ПустаяСсылка),
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL,
				|	NULL
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Представления_КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
				|	Представления_КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
				|	Представления_КадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
				|	Представления_КадровыеДанныеСотрудников.ТабельныйНомер КАК ТабельныйНомер,
				|	Представления_КадровыеДанныеСотрудников.РабочееМестоПериодРегистрации КАК РабочееМестоПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.РабочееМестоРегистратор КАК РабочееМестоРегистратор,
				|	Представления_КадровыеДанныеСотрудников.Организация КАК Организация,
				|	Представления_КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
				|	Представления_КадровыеДанныеСотрудников.Должность КАК Должность,
				|	Представления_КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
				|	Представления_КадровыеДанныеСотрудников.ГрафикРаботыПериодРегистрации КАК ГрафикРаботыПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.ГрафикРаботыРегистратор КАК ГрафикРаботыРегистратор,
				|	Представления_КадровыеДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
				|	Представления_КадровыеДанныеСотрудников.КоличествоСтавок КАК КоличествоСтавок,
				|	Представления_КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
				|	Представления_КадровыеДанныеСотрудников.ТарифнаяСетка КАК ТарифнаяСетка,
				|	Представления_КадровыеДанныеСотрудников.РазрядКатегорияПериодРегистрации КАК РазрядКатегорияПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.РазрядКатегорияРегистратор КАК РазрядКатегорияРегистратор,
				|	Представления_КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
				|	Представления_КадровыеДанныеСотрудников.ТарифнаяСеткаНадбавки КАК ТарифнаяСеткаНадбавки,
				|	Представления_КадровыеДанныеСотрудников.СостояниеПериодРегистрации КАК СостояниеПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.Состояние КАК Состояние,
				|	Представления_КадровыеДанныеСотрудников.ОплатаТрудаПериодЗаписи КАК ОплатаТрудаПериодЗаписи,
				|	Представления_КадровыеДанныеСотрудников.ОплатаТрудаРегистратор КАК ОплатаТрудаРегистратор,
				|	Представления_КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
				|	Представления_КадровыеДанныеСотрудников.ПоказательТарифнойСтавки КАК ПоказательТарифнойСтавки,
				|	Представления_КадровыеДанныеСотрудников.ДоляНеполногоРабочегоВремени КАК ДоляНеполногоРабочегоВремени,
				|	Представления_КадровыеДанныеСотрудников.Надбавка КАК Надбавка,
				|	Представления_КадровыеДанныеСотрудников.ФОТ КАК ФОТ,
				|	Представления_КадровыеДанныеСотрудников.АвансПериодРегистрации КАК АвансПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.АвансРегистратор КАК АвансРегистратор,
				|	Представления_КадровыеДанныеСотрудников.Аванс КАК Аванс,
				|	Представления_КадровыеДанныеСотрудников.СпособРасчетаАванса КАК СпособРасчетаАванса,
				|	Представления_КадровыеДанныеСотрудников.ПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки,
				|	Представления_КадровыеДанныеСотрудников.ПорядокИсчисленияПроцентаСевернойНадбавки КАК
				|		ПорядокИсчисленияПроцентаСевернойНадбавки,
				|	Представления_КадровыеДанныеСотрудников.ПроцентСевернойНадбавкиИзменяется КАК ПроцентСевернойНадбавкиИзменяется,
				|	Представления_КадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
				|	Представления_КадровыеДанныеСотрудников.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
				|	Представления_КадровыеДанныеСотрудников.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
				|	Представления_КадровыеДанныеСотрудников.ПриказОПриеме КАК ПриказОПриеме,
				|	Представления_КадровыеДанныеСотрудников.ПриказОПриемеДатаЗавершенияТрудовогоДоговора КАК
				|		ПриказОПриемеДатаЗавершенияТрудовогоДоговора,
				|	ВЫБОР
				|		КОГДА Представления_КадровыеДанныеСотрудников.ДатаУвольнения <= &Период
				|			ТОГДА Представления_КадровыеДанныеСотрудников.ДатаУвольнения
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ДатаУвольнения,
				|	Представления_КадровыеДанныеСотрудников.ПриказОбУвольнении КАК ПриказОбУвольнении,
				|	Представления_КадровыеДанныеСотрудников.ПриказОбУвольненииСтатьяТКРФ КАК ПриказОбУвольненииСтатьяТКРФ,
				|	Представления_КадровыеДанныеСотрудников.ПриказОбУвольненииНомер КАК ПриказОбУвольненииНомер,
				|	Представления_КадровыеДанныеСотрудников.ПриказОбУвольненииДата КАК ПриказОбУвольненииДата,
				|	Представления_КадровыеДанныеСотрудников.Пол КАК Пол,
				|	Представления_КадровыеДанныеСотрудников.ДатаРождения КАК ДатаРождения,
				|	Представления_КадровыеДанныеСотрудников.ИНН КАК ИНН,
				|	Представления_КадровыеДанныеСотрудников.СтраховойНомерПФР КАК СтраховойНомерПФР,
				|	Представления_КадровыеДанныеСотрудников.МестоРождения КАК МестоРождения,
				|	Представления_КадровыеДанныеСотрудников.ГражданствоПериодРегистрации КАК ГражданствоПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.Страна КАК Страна,
				|	Представления_КадровыеДанныеСотрудников.ИННВСтранеГражданства КАК ИННВСтранеГражданства,
				|	Представления_КадровыеДанныеСотрудников.ВидЗастрахованногоЛицаПериодРегистрации КАК
				|		ВидЗастрахованногоЛицаПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
				|	Представления_КадровыеДанныеСотрудников.ФИОПериодРегистрации КАК ФИОПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.Фамилия КАК Фамилия,
				|	Представления_КадровыеДанныеСотрудников.Имя КАК Имя,
				|	Представления_КадровыеДанныеСотрудников.Отчество КАК Отчество,
				|	Представления_КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
				|	Представления_КадровыеДанныеСотрудников.ДокументПериодРегистрации КАК ДокументПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.ДокументВид КАК ДокументВид,
				|	Представления_КадровыеДанныеСотрудников.ДокументКодМВД КАК ДокументКодМВД,
				|	Представления_КадровыеДанныеСотрудников.ДокументСерия КАК ДокументСерия,
				|	Представления_КадровыеДанныеСотрудников.ДокументНомер КАК ДокументНомер,
				|	Представления_КадровыеДанныеСотрудников.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
				|	Представления_КадровыеДанныеСотрудников.ДокументСрокДействия КАК ДокументСрокДействия,
				|	Представления_КадровыеДанныеСотрудников.ДокументКемВыдан КАК ДокументКемВыдан,
				|	Представления_КадровыеДанныеСотрудников.ДокументКодПодразделения КАК ДокументКодПодразделения,
				|	Представления_КадровыеДанныеСотрудников.ДокументПредставление КАК ДокументПредставление,
				|	Представления_КадровыеДанныеСотрудников.АдресПоПрописке КАК АдресПоПрописке,
				|	Представления_КадровыеДанныеСотрудников.АдресПоПропискеПредставление КАК АдресПоПропискеПредставление,
				|	Представления_КадровыеДанныеСотрудников.ДатаРегистрации КАК ДатаРегистрации,
				|	Представления_КадровыеДанныеСотрудников.АдресМестаПроживания КАК АдресМестаПроживания,
				|	Представления_КадровыеДанныеСотрудников.АдресМестаПроживанияПредставление КАК АдресМестаПроживанияПредставление,
				|	Представления_КадровыеДанныеСотрудников.ТелефонМобильныйПредставление КАК ТелефонМобильныйПредставление,
				|	Представления_КадровыеДанныеСотрудников.ТелефонДомашнийПредставление КАК ТелефонДомашнийПредставление,
				|	Представления_КадровыеДанныеСотрудников.ТелефонРабочийПредставление КАК ТелефонРабочийПредставление,
				|	Представления_КадровыеДанныеСотрудников.EMailПредставление КАК EMailПредставление,
				|	Представления_КадровыеДанныеСотрудников.ВладеемыйЯзык1 КАК ВладеемыйЯзык1,
				|	Представления_КадровыеДанныеСотрудников.ВладеемыйЯзык1СтепеньЗнания КАК ВладеемыйЯзык1СтепеньЗнания,
				|	Представления_КадровыеДанныеСотрудников.ВладеемыйЯзык2 КАК ВладеемыйЯзык2,
				|	Представления_КадровыеДанныеСотрудников.ВладеемыйЯзык2СтепеньЗнания КАК ВладеемыйЯзык2СтепеньЗнания,
				|	Представления_КадровыеДанныеСотрудников.Профессия1 КАК Профессия1,
				|	Представления_КадровыеДанныеСотрудников.Профессия2 КАК Профессия2,
				|	Представления_КадровыеДанныеСотрудников.ОбщийСтажДней КАК ОбщийСтажДней,
				|	Представления_КадровыеДанныеСотрудников.ОбщийСтажМесяцев КАК ОбщийСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.ОбщийСтажЛет КАК ОбщийСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.НепрерывныйСтажДней КАК НепрерывныйСтажДней,
				|	Представления_КадровыеДанныеСотрудников.НепрерывныйСтажМесяцев КАК НепрерывныйСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.НепрерывныйСтажЛет КАК НепрерывныйСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.СтажНаНадбавкуЗаВыслугуЛетДней КАК СтажНаНадбавкуЗаВыслугуЛетДней,
				|	Представления_КадровыеДанныеСотрудников.СтажНаНадбавкуЗаВыслугуЛетМесяцев КАК СтажНаНадбавкуЗаВыслугуЛетМесяцев,
				|	Представления_КадровыеДанныеСотрудников.СтажНаНадбавкуЗаВыслугуЛетЛет КАК СтажНаНадбавкуЗаВыслугуЛетЛет,
				|	Представления_КадровыеДанныеСотрудников.СтраховойСтажДней КАК СтраховойСтажДней,
				|	Представления_КадровыеДанныеСотрудников.СтраховойСтажМесяцев КАК СтраховойСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.СтраховойСтажЛет КАК СтраховойСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.РасширенныйСтраховойСтажДней КАК РасширенныйСтраховойСтажДней,
				|	Представления_КадровыеДанныеСотрудников.РасширенныйСтраховойСтажМесяцев КАК РасширенныйСтраховойСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.РасширенныйСтраховойСтажЛет КАК РасширенныйСтраховойСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.ПрочийСтажДней КАК ПрочийСтажДней,
				|	Представления_КадровыеДанныеСотрудников.ПрочийСтажМесяцев КАК ПрочийСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.ПрочийСтажЛет КАК ПрочийСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.ОбщийНаучноПедагогическийСтажДней КАК ОбщийНаучноПедагогическийСтажДней,
				|	Представления_КадровыеДанныеСотрудников.ОбщийНаучноПедагогическийСтажМесяцев КАК
				|		ОбщийНаучноПедагогическийСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.ОбщийНаучноПедагогическийСтажЛет КАК ОбщийНаучноПедагогическийСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.ПедагогическийСтажДней КАК ПедагогическийСтажДней,
				|	Представления_КадровыеДанныеСотрудников.ПедагогическийСтажМесяцев КАК ПедагогическийСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.ПедагогическийСтажЛет КАК ПедагогическийСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.СеверныйСтажДней КАК СеверныйСтажДней,
				|	Представления_КадровыеДанныеСотрудников.СеверныйСтажМесяцев КАК СеверныйСтажМесяцев,
				|	Представления_КадровыеДанныеСотрудников.СеверныйСтажЛет КАК СеверныйСтажЛет,
				|	Представления_КадровыеДанныеСотрудников.СостояниеВБракеПериодРегистрации КАК СостояниеВБракеПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.СостояниеВБраке КАК СостояниеВБраке,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетПериодРегистрации КАК ВоинскийУчетПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетКатегорияЗапаса КАК ВоинскийУчетКатегорияЗапаса,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетЗвание КАК ВоинскийУчетЗвание,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетСостав КАК ВоинскийУчетСостав,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетВУС КАК ВоинскийУчетВУС,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетГодность КАК ВоинскийУчетГодность,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетВоенкомат КАК ВоинскийУчетВоенкомат,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетНомерКомандыПартии КАК ВоинскийУчетНомерКомандыПартии,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетНаличиеМобпредписания КАК ВоинскийУчетНаличиеМобпредписания,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетПунктПеречня КАК ВоинскийУчетПунктПеречня,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетОтношениеКВоинскойОбязанности КАК
				|		ВоинскийУчетОтношениеКВоинскойОбязанности,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетОтношениеКВоинскомуУчету КАК
				|		ВоинскийУчетОтношениеКВоинскомуУчету,
				|	ВЫБОР
				|		КОГДА Представления_КадровыеДанныеСотрудников.ВоинскийУчетОтношениеКВоинскомуУчету В
				|		(ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту),
				|			ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья))
				|			ТОГДА Представления_КадровыеДанныеСотрудников.ВоинскийУчетОтношениеКВоинскомуУчету
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК ВоинскийУчетОтметкаОСнятиеСУчета,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетЗабронированОрганизациейПериодРегистрации КАК
				|		ВоинскийУчетЗабронированОрганизациейПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетЗабронированОрганизациейРегистратор КАК
				|		ВоинскийУчетЗабронированОрганизациейРегистратор,
				|	Представления_КадровыеДанныеСотрудников.ВоинскийУчетЗабронированОрганизацией КАК
				|		ВоинскийУчетЗабронированОрганизацией,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеУчебноеЗаведение КАК
				|		ПослеВузовскоеОбразованиеУчебноеЗаведение,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеВидОбразования КАК
				|		ПослеВузовскоеОбразованиеВидОбразования,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеВидПослевузовскогоОбразования КАК
				|		ПослеВузовскоеОбразованиеВидПослевузовскогоОбразования,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеВидДокумента КАК
				|		ПослеВузовскоеОбразованиеВидДокумента,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеНачало КАК ПослеВузовскоеОбразованиеНачало,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеОкончание КАК ПослеВузовскоеОбразованиеОкончание,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеСерия КАК ПослеВузовскоеОбразованиеСерия,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеНомер КАК ПослеВузовскоеОбразованиеНомер,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеДатаВыдачи КАК ПослеВузовскоеОбразованиеДатаВыдачи,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеСпециальность КАК
				|		ПослеВузовскоеОбразованиеСпециальность,
				|	Представления_КадровыеДанныеСотрудников.ПослеВузовскоеОбразованиеКвалификация КАК
				|		ПослеВузовскоеОбразованиеКвалификация,
				|	Представления_КадровыеДанныеСотрудников.Образование1ВидОбразования КАК Образование,
				|	Представления_КадровыеДанныеСотрудников.Образование1УчебноеЗаведение КАК Образование1УчебноеЗаведение,
				|	Представления_КадровыеДанныеСотрудников.Образование1ВидОбразования КАК Образование1ВидОбразования,
				|	Представления_КадровыеДанныеСотрудников.Образование1Начало КАК Образование1Начало,
				|	Представления_КадровыеДанныеСотрудников.Образование1Окончание КАК Образование1Окончание,
				|	Представления_КадровыеДанныеСотрудников.Образование1Специальность КАК Образование1Специальность,
				|	Представления_КадровыеДанныеСотрудников.Образование1ВидДокумента КАК Образование1ВидДокумента,
				|	Представления_КадровыеДанныеСотрудников.Образование1Серия КАК Образование1Серия,
				|	Представления_КадровыеДанныеСотрудников.Образование1Номер КАК Образование1Номер,
				|	Представления_КадровыеДанныеСотрудников.Образование1ДатаВыдачи КАК Образование1ДатаВыдачи,
				|	Представления_КадровыеДанныеСотрудников.Образование1Квалификация КАК Образование1Квалификация,
				|	Представления_КадровыеДанныеСотрудников.Образование2УчебноеЗаведение КАК Образование2УчебноеЗаведение,
				|	Представления_КадровыеДанныеСотрудников.Образование2ВидОбразования КАК Образование2ВидОбразования,
				|	Представления_КадровыеДанныеСотрудников.Образование2Начало КАК Образование2Начало,
				|	Представления_КадровыеДанныеСотрудников.Образование2Окончание КАК Образование2Окончание,
				|	Представления_КадровыеДанныеСотрудников.Образование2Специальность КАК Образование2Специальность,
				|	Представления_КадровыеДанныеСотрудников.Образование2ВидДокумента КАК Образование2ВидДокумента,
				|	Представления_КадровыеДанныеСотрудников.Образование2Серия КАК Образование2Серия,
				|	Представления_КадровыеДанныеСотрудников.Образование2Номер КАК Образование2Номер,
				|	Представления_КадровыеДанныеСотрудников.Образование2ДатаВыдачи КАК Образование2ДатаВыдачи,
				|	Представления_КадровыеДанныеСотрудников.Образование2Квалификация КАК Образование2Квалификация,
				|	Представления_КадровыеДанныеСотрудников.ВысшееОбразованиеУчебноеЗаведение КАК ВысшееОбразованиеУчебноеЗаведение,
				|	Представления_КадровыеДанныеСотрудников.ВысшееОбразованиеНачало КАК ВысшееОбразованиеНачало,
				|	Представления_КадровыеДанныеСотрудников.ВысшееОбразованиеОкончание КАК ВысшееОбразованиеОкончание,
				|	Представления_КадровыеДанныеСотрудников.УченаяСтепень КАК УченаяСтепень,
				|	Представления_КадровыеДанныеСотрудников.УченаяСтепеньОтрасльНауки КАК УченаяСтепеньОтрасльНауки,
				|	Представления_КадровыеДанныеСотрудников.УченаяСтепеньДатаПрисуждения КАК УченаяСтепеньДатаПрисуждения,
				|	Представления_КадровыеДанныеСотрудников.УченаяСтепеньДиссертационныйСовет КАК УченаяСтепеньДиссертационныйСовет,
				|	Представления_КадровыеДанныеСотрудников.УченаяСтепеньДипломСерияНомер КАК УченаяСтепеньДипломСерияНомер,
				|	Представления_КадровыеДанныеСотрудников.УченаяСтепеньОрганизация КАК УченаяСтепеньОрганизация,
				|	Представления_КадровыеДанныеСотрудников.УченоеЗвание КАК УченоеЗвание,
				|	Представления_КадровыеДанныеСотрудников.УченоеЗваниеАттестатСерия КАК УченоеЗваниеАттестатСерия,
				|	Представления_КадровыеДанныеСотрудников.УченоеЗваниеАттестатНомер КАК УченоеЗваниеАттестатНомер,
				|	Представления_КадровыеДанныеСотрудников.УченоеЗваниеДатаПрисвоения КАК УченоеЗваниеДатаПрисвоения,
				|	Представления_КадровыеДанныеСотрудников.УченоеЗваниеОрганизация КАК УченоеЗваниеОрганизация,
				|	Представления_КадровыеДанныеСотрудников.УченоеЗваниеСпециальность КАК УченоеЗваниеСпециальность,
				|	Представления_КадровыеДанныеСотрудников.ИмеетНаучныеТруды КАК ИмеетНаучныеТруды,
				|	Представления_КадровыеДанныеСотрудников.ИмеетИзобретения КАК ИмеетИзобретения,
				|	Представления_КадровыеДанныеСотрудников.ПочетноеЗвание КАК ПочетноеЗвание,
				|	Представления_КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговора,
				|	Представления_КадровыеДанныеСотрудников.ТекущийВидДоговора КАК ТекущийВидДоговора,
				|	Представления_КадровыеДанныеСотрудников.ПолученныеОбразования КАК ПолученныеОбразования,
				|	Представления_КадровыеДанныеСотрудников.Награды КАК Награды,
				|	Представления_КадровыеДанныеСотрудников.Документы КАК Документы,
				|	Представления_КадровыеДанныеСотрудников.ЗнанияЯзыков КАК ЗнанияЯзыков,
				|	Представления_КадровыеДанныеСотрудников.Профессии КАК Профессии,
				|	Представления_КадровыеДанныеСотрудников.Специальности КАК Специальности,
				|	Представления_КадровыеДанныеСотрудников.ТрудоваяДеятельность КАК ТрудоваяДеятельность,
				|	Представления_КадровыеДанныеСотрудников.СоставСемьи КАК СоставСемьи,
				|	Представления_КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
				|	Представления_КадровыеДанныеСотрудников.ДатаНачала КАК ДатаНачала,
				|	Представления_КадровыеДанныеСотрудников.ПредставительНанимателя КАК ПредставительНанимателя,
				|	Представления_КадровыеДанныеСотрудников.ДолжностьПредставителяНанимателя КАК ДолжностьПредставителяНанимателя,
				|	Представления_КадровыеДанныеСотрудников.ОснованиеПредставителя КАК ОснованиеПредставителя,
				|	Представления_КадровыеДанныеСотрудников.ВидАктаГосоргана КАК ВидАктаГосоргана,
				|	Представления_КадровыеДанныеСотрудников.ДатаОкончания КАК ДатаОкончания,
				|	Представления_КадровыеДанныеСотрудников.СрочныйДоговор КАК СрочныйДоговор,
				|	Представления_КадровыеДанныеСотрудников.СезонныйДоговор КАК СезонныйДоговор,
				|	Представления_КадровыеДанныеСотрудников.СрокЗаключенияДоговора КАК СрокЗаключенияДоговора,
				|	Представления_КадровыеДанныеСотрудников.ОборудованиеРабочегоМеста КАК ОборудованиеРабочегоМеста,
				|	Представления_КадровыеДанныеСотрудников.ИныеУсловияДоговора КАК ИныеУсловияДоговора,
				|	Представления_КадровыеДанныеСотрудников.ВладелецМестаВыплаты КАК ВладелецМестаВыплаты,
				|	Представления_КадровыеДанныеСотрудников.ВидМестаВыплаты КАК ВидМестаВыплаты,
				|	Представления_КадровыеДанныеСотрудников.МестоВыплаты КАК МестоВыплаты,
				|	Представления_КадровыеДанныеСотрудников.СтатусНалогоплательщикаПериодРегистрации КАК
				|		СтатусНалогоплательщикаПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
				|	Представления_КадровыеДанныеСотрудников.УчетЗатратПериодРегистрации КАК УчетЗатратПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.СтатьяФинансирования КАК СтатьяФинансирования,
				|	Представления_КадровыеДанныеСотрудников.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
				|	Представления_КадровыеДанныеСотрудников.ОтношениеКЕНВД КАК ОтношениеКЕНВД,
				|	Представления_КадровыеДанныеСотрудников.ЗарплатныйПроектДатаОткрытияЛицевогоСчета КАК
				|		ЗарплатныйПроектДатаОткрытияЛицевогоСчета,
				|	Представления_КадровыеДанныеСотрудников.ЗарплатныйПроектРегистратор КАК ЗарплатныйПроектРегистратор,
				|	Представления_КадровыеДанныеСотрудников.ЗарплатныйПроект КАК ЗарплатныйПроект,
				|	Представления_КадровыеДанныеСотрудников.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
				|	Представления_КадровыеДанныеСотрудников.ИнвалидностьПериодРегистрации КАК ИнвалидностьПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.Инвалидность КАК Инвалидность,
				|	Представления_КадровыеДанныеСотрудников.ИнвалидностьДатаВыдачи КАК ИнвалидностьДатаВыдачи,
				|	Представления_КадровыеДанныеСотрудников.ИнвалидностьСрокДействияСправки КАК ИнвалидностьСрокДействияСправки,
				|	Представления_КадровыеДанныеСотрудников.ТерриторияПериодРегистрации КАК ТерриторияПериодРегистрации,
				|	Представления_КадровыеДанныеСотрудников.ТерриторияРегистратор КАК ТерриторияРегистратор,
				|	Представления_КадровыеДанныеСотрудников.Территория КАК Территория,
				|	Представления_КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно,
				|	1 КАК Количество
				|ИЗ
				|	Представления_КадровыеДанныеСотрудников КАК Представления_КадровыеДанныеСотрудников";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудниковИнтервальный, Истина);
	
КонецПроцедуры

#КонецОбласти

// Заполняет наборы записей регистра ДистанционнаяРаботаСотрудников.
//
// Параметры:
//		Движения - коллекция движений регистратора.
//		ДанныеДляПроведения - Структура данных для проведения документа, в которую добавляются данные по испытательному сроку.
//
Процедура СформироватьДвиженияПоДистанционнойРаботе(Движения, ДанныеДляПроведения) Экспорт
	
	Если Не ДанныеДляПроведения.Свойство("ДистанционнаяРаботаСотрудников")
		Или Не ЗначениеЗаполнено(ДанныеДляПроведения.ДистанционнаяРаботаСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДанныхДляПроведения Из ДанныеДляПроведения.ДистанционнаяРаботаСотрудников Цикл
		СтрокаДвижений = Движения.ДистанционнаяРаботаСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДанныхДляПроведения);
	КонецЦикла;
	
	Если Движения.ДистанционнаяРаботаСотрудников.Количество() > 0 Тогда
		Движения.ДистанционнаяРаботаСотрудников.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает таблицу для проведения документов ПриемНаРаботу/ПриемНаРаботуСписком.
//
// Параметры:
//		ДанныеДляПроведения - Структура, в которую добавляются данные по испытательному сроку.
//		ДокументСсылка - Ссылка на документ, для которого требуется подготовить таблицу для проведения.
//
//
Процедура ПриемНаРаботуСведенияОДистанционнойРаботе(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриемНаРаботу.ДатаПриема КАК Период,
		|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
		|	ПриемНаРаботу.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПриемНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПриемНаРаботу.РаботаетДистанционно КАК РаботаетДистанционно
		|ИЗ
		|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
		|ГДЕ
		|	ПриемНаРаботу.Ссылка = &Ссылка";
	
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗЛИЧНЫЕ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриемНаРаботу", "Документ.ПриемНаРаботуСписком.Сотрудники");
	КонецЕсли;
	
	// Набор сведений для проведения по дистанционной работе сотрудников
	СведенияОДистанционнойРаботеСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДистанционнаяРаботаСотрудников", СведенияОДистанционнойРаботеСотрудников);
		
КонецПроцедуры

// Подготавливает таблицу для проведения документов КадровыйПеревод/КадровыйПереводСписком.
//
// Параметры:
//		ДанныеДляПроведения - Структура, в которую добавляются данные по испытательному сроку.
//		ДокументСсылка - Ссылка на документ, для которого требуется подготовить таблицу для проведения.
//
//
Процедура КадровыйПереводСведенияОДистанционнойРаботе(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.ДатаНачала КАК Период,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.РаботаетДистанционно КАК РаботаетДистанционно,
		|	ВЫБОР
		|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ Сотрудники.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо
		|ИЗ
		|	Документ.КадровыйПеревод КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Ссылка
		|	И Сотрудники.ИзменитьДистанционнуюРаботу";
		
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗЛИЧНЫЕ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком.Сотрудники");
	КонецЕсли;
		
	// Набор сведений для проведения по дистанционной работе сотрудников
	СведенияОДистанционнойРаботеСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДистанционнаяРаботаСотрудников", СведенияОДистанционнойРаботеСотрудников);
		
КонецПроцедуры

// Подготавливает таблицу для проведения документа НачальнаяШтатнаяРасстановка.
//
// Параметры:
//		ДанныеДляПроведения - Структура, в которую добавляются данные по испытательному сроку.
//		ДокументСсылка - Ссылка на документ, для которого требуется подготовить таблицу для проведения.
//
//
Процедура НачальнаяШтатнаяРасстановкаСведенияОДистанционнойРаботе(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачальнаяШтатнаяРасстановка.Ссылка.Месяц КАК Период,
		|	НачальнаяШтатнаяРасстановка.Сотрудник КАК Сотрудник,
		|	НачальнаяШтатнаяРасстановка.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НачальнаяШтатнаяРасстановка.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЛОЖЬ КАК РаботаетДистанционно
		|ИЗ
		|	Документ.НачальнаяШтатнаяРасстановка.Сотрудники КАК НачальнаяШтатнаяРасстановка
		|ГДЕ
		|	НачальнаяШтатнаяРасстановка.Ссылка = &Ссылка";
	
	// Набор сведений для проведения по дистанционной работе сотрудников
	СведенияОДистанционнойРаботеСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДистанционнаяРаботаСотрудников", СведенияОДистанционнойРаботеСотрудников);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КадровыеДанныеСотрудников

Функция ЗапросВТСведенияОДистанционнойРаботеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИмяВТСведенияОДистанционнойРаботеСотрудников = "ВТСведенияОДистанционнойРаботеСотрудников")
	
	ПоляОтбора = Неопределено;
	Если ПоляОтбораПериодическихДанных <> Неопределено Тогда
		ПоляОтбораПериодическихДанных.Свойство("ДистанционнаяРаботаСотрудников", ПоляОтбора);
	КонецЕсли;
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ОписательВременнойТаблицыОтборов.ИмяВременнойТаблицыОтборовСотрудников, "Сотрудник");
	
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период", ОписательВременнойТаблицыОтборов.ИмяПоляПериод);
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Сотрудник", ОписательВременнойТаблицыОтборов.ИмяПоляСотрудник);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Отборы = ПоляОтбора;
	ПараметрыПостроения.ФормироватьСПериодичностьДень = ФормироватьСПериодичностьДень;
	
	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ДистанционнаяРаботаСотрудников", 
		ТолькоРазрешенные,
		ОписаниеФильтра,
		ПараметрыПостроения,
		Истина,
		ИмяВТСведенияОДистанционнойРаботеСотрудников);
	
	Возврат ЗапросВТИмяРегистраСрез;
	
КонецФункции

Функция НеобходимыСведенияОДистанционнойРаботеСотрудников(Знач ИмяПоля)
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("РаботаетДистанционноПериодРегистрации")
		Или ИмяПоля = ВРег("РаботаетДистанционноРегистратор")
		Или ИмяПоля = ВРег("РаботаетДистанционно");
		
КонецФункции

Функция ПутьКДаннымСведенийОДистанционнойРаботеСотрудников(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	ПутьКДанным = "";
	
	Если ИмяПоляВВерхнемРегистре = ВРег("РаботаетДистанционноПериодРегистрации") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.ПериодЗаписи";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РаботаетДистанционноРегистратор") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.Регистратор";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РаботаетДистанционно") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.РаботаетДистанционно";
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

#КонецОбласти

#Область ПечатьДокументов

Процедура ДобавитьКомандуПечатиДопСоглашенияКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу(КомандыПечати)
	
	Если Не ПравоДоступа("Использование", Метаданные.Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу) Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьДокументовДляПереводаНаДистанционнуюРаботу";
	КомандаПечати.Идентификатор = "ПФ_MXL_ДопСоглашениеКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу";
	КомандаПечати.Представление = НСтр("ru = 'Доп. соглашение к трудовому договору при переводе на дистанционную работу'");
	КомандаПечати.Порядок = 120;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина);
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина, "ИзменитьДистанционнуюРаботу");
	
КонецПроцедуры

Процедура ДобавитьКомандуПечатиЗаявленияОПереводеНаДистанционнуюРаботу(КомандыПечати, ЭтоКадровыйПеревод)
	
	Если Не ПравоДоступа("Использование", Метаданные.Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу) Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьДокументовДляПереводаНаДистанционнуюРаботу";
	КомандаПечати.Идентификатор = "ПФ_MXL_ЗаявлениеОПереводеНаДистанционнуюРаботу";
	КомандаПечати.Представление = НСтр("ru = 'Заявление о переводе на дистанционную работу'");
	КомандаПечати.Порядок = 130;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина);
	Если ЭтоКадровыйПеревод Тогда
		ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина, "ИзменитьДистанционнуюРаботу");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаДокументов

Процедура ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, ИмяДокумента, ЭтоКадровыйПеревод = Ложь)
	
	Команда = Команды.Добавить();
	Команда.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка." + ИмяДокумента);
	Команда.Представление = НСтр("ru = 'Рассылка документов для перевода на дистанционную работу'");
	Команда.Назначение = РассылкаДокументов.ВидыНазначенияКомандыРассылки().ДляСписка;
	Команда.РежимЗаписи = РассылкаДокументов.РежимыЗаписиОбъектаПередВыполнениемКомандыРассылки().Проводить;
	Команда.ТемаПисьма = НСтр("ru = 'Документы для перевода на дистанционную работу'");
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	Команда.ТекстПисьма = 
		НСтр("ru = 'Добрый день!
			 |
			 |Во вложении комплект документов для оформления перевода на дистанционную работу.
			 |Пожалуйста, распечатайте его, поставьте свою подпись в обозначенных местах и пришлите нам фотографию или скан-копию в ответ на это письмо.
			 |
			 |С уважением, Администрация.'");
	// АПК:374-вкл

	Команда.ПечатныеФормы = Новый Массив;
	
	Команда.ПечатныеФормы.Вставить(0, РассылкаДокументов.НоваяПечатнаяФорма());
	Команда.ПечатныеФормы[0].ОбработчикПолученияДанных =
		"Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу.ТаблицаДанныхПечатиЗаявленияОПереводеНаДистанционнуюРаботу";
	Команда.ПечатныеФормы[0].Идентификатор = "ПФ_MXL_ЗаявлениеОПереводеНаДистанционнуюРаботу";
	ДобавитьУсловиеВидимостиКоманды(Команда, Истина);
	
	Если Не ЭтоКадровыйПеревод Тогда
		Возврат;
	КонецЕсли;
	
	Команда.ПечатныеФормы.Вставить(1, РассылкаДокументов.НоваяПечатнаяФорма());
	Команда.ПечатныеФормы[1].ОбработчикПолученияДанных =
		"Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу.ТаблицаДанныхПечатиДопСоглашенияПриПереводеДистанционнуюРаботу";
	Команда.ПечатныеФормы[1].Идентификатор = "ПФ_MXL_ДопСоглашениеКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу";
	ДобавитьУсловиеВидимостиКоманды(Команда, Истина, "ИзменитьДистанционнуюРаботу");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

