#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ТекущееСостояниеВакансий(Вакансии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВакансий.Период,
		|	СостоянияВакансий.Вакансия,
		|	СостоянияВакансий.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияВакансий.СрезПоследних(, Вакансия В (&Вакансии)) КАК СостоянияВакансий";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		Соответствие.Вставить(СтрокаТаблицы.Вакансия, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы));
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли