
#Область СлужебныеПроцедурыИФункции

Функция МассивСтрокВидовПериодов() Экспорт
	
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить("МЕСЯЦ");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГоризонтГодДляПоказателейЭффективности") Тогда
		МассивСтрок.Добавить("ГОД");
	КонецЕсли; 
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГоризонтКварталДляПоказателейЭффективности") Тогда
		МассивСтрок.Добавить("КВАРТАЛ");
	КонецЕсли; 
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГоризонтПолугодиеДляПоказателейЭффективности") Тогда
		МассивСтрок.Добавить("ПОЛУГОДИЕ");
	КонецЕсли; 
	
	Возврат МассивСтрок;
	
КонецФункции

#КонецОбласти