#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВакансииКандидатов = Новый Массив;
	ОтменитьРешениеПоКандидатамНаСервере(ПараметрКоманды, ВакансииКандидатов);
	
	// Отражаем изменения в открытых формах.
	ПараметрыОповещения = Новый Структура("Кандидаты, Вакансии");
	ПараметрыОповещения.Кандидаты = ПараметрКоманды;
	ПараметрыОповещения.Вакансии = ВакансииКандидатов;
	
	Оповестить("РешениеПоКандидату", ПараметрыОповещения, ПараметрыВыполненияКоманды.Источник);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ПараметрыОповещения.Кандидаты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьРешениеПоКандидатамНаСервере(Кандидаты, ВакансииКандидатов)
	
	ПодборПерсонала.ОтменитьРешениеПоКандидатам(Кандидаты);
	ПодборПерсонала.ЗаполнитьВакансииКандидатов(Кандидаты, ВакансииКандидатов);
	
КонецПроцедуры

#КонецОбласти