
#Область СлужебныеПроцедурыИФункции

Функция HeadHunter() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.HeadHunter();
	
КонецФункции

Функция SuperJob() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.SuperJob();
	
КонецФункции

Функция Rabota() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.Rabota();
	
КонецФункции

Функция Zarplata() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.Zarplata();
	
КонецФункции

Функция СоответствиеПоФиксированномуСоответствию(ФиксСоответствие) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.СоответствиеПоФиксированномуСоответствию(ФиксСоответствие);
	
КонецФункции

Функция НайтиВСтроке(СтрокаДляПоиска, ИскомаяСтрока, НаправлениеПоискаЧисло = 1) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.НайтиВСтроке(СтрокаДляПоиска, ИскомаяСтрока, НаправлениеПоискаЧисло);
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуHeadHunter(Идентификатор) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ВидОбразованияПоИдентификаторуHeadHunter(Идентификатор);
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуRabota(Идентификатор) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ВидОбразованияПоИдентификаторуRabota(Идентификатор);
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуSuperJob(Идентификатор) Экспорт 
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ВидОбразованияПоИдентификаторуSuperJob(Идентификатор);
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуZarplata(Идентификатор) Экспорт 
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ВидОбразованияПоИдентификаторуZarplata(Идентификатор);
	
КонецФункции

Функция СреднееПолноеОбщееОбразование() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.СреднееПолноеОбщееОбразование();
	
КонецФункции

Функция МужскойПол() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.МужскойПол();
	
КонецФункции

Функция ЖенскийПол() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ЖенскийПол();
	
КонецФункции

Функция ИмяСправочникаКандидатов() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ИмяСправочникаКандидатов();
	
КонецФункции

Функция УникальноеИмяРеквизита() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.УникальноеИмяРеквизита();
	
КонецФункции

Функция ГруппаКнопокДляЗагрузкиССайта(Форма) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовВнутреннийКлиентСервер.ГруппаКнопокДляЗагрузкиССайта(Форма);
	
КонецФункции

Функция СоответствиеПутиИКлассификатораHeadHunter()
	
	СоответствиеПутиИКлассификатора = Новый Соответствие;
	
	СоответствиеПутиИКлассификатора.Вставить("specializations.id", "specializations");	
	СоответствиеПутиИКлассификатора.Вставить("area.id", "areas");	
	СоответствиеПутиИКлассификатора.Вставить("type.id", "vacancy_type");	
	СоответствиеПутиИКлассификатора.Вставить("billing_type.id", "vacancy_billing_type");
	СоответствиеПутиИКлассификатора.Вставить("site.id", "vacancy_site");
	СоответствиеПутиИКлассификатора.Вставить("salary.currency", "currency");
	СоответствиеПутиИКлассификатора.Вставить("experience.id", "experience");
	СоответствиеПутиИКлассификатора.Вставить("schedule.id", "schedule");
	СоответствиеПутиИКлассификатора.Вставить("address.id", "addresses");
	СоответствиеПутиИКлассификатора.Вставить("manager.id", "managers");
	СоответствиеПутиИКлассификатора.Вставить("department.id", "departments");
	СоответствиеПутиИКлассификатора.Вставить("employment.id", "employment");
	
	Возврат СоответствиеПутиИКлассификатора;
	
КонецФункции

Функция СоответствиеПутиИКлассификатораRabota()
	
	СоответствиеПутиИКлассификатора = Новый Соответствие;
	
	СоответствиеПутиИКлассификатора.Вставить("offerTrades", "offer_trades");
	СоответствиеПутиИКлассификатора.Вставить("currency", "currencies");
	СоответствиеПутиИКлассификатора.Вставить("region", "regions");
	СоответствиеПутиИКлассификатора.Вставить("operatingSchedule", "operating_schedules");
	СоответствиеПутиИКлассификатора.Вставить("experienceYearCount", "experience");
	СоответствиеПутиИКлассификатора.Вставить("education", "offer_educations");
	СоответствиеПутиИКлассификатора.Вставить("gender", "gender");
	СоответствиеПутиИКлассификатора.Вставить("address", "representations");
	СоответствиеПутиИКлассификатора.Вставить("offerLanguage", "offer_languages");
	СоответствиеПутиИКлассификатора.Вставить("offerLanguageLevel", "offer_language_levels");
	СоответствиеПутиИКлассификатора.Вставить("additionalInformation.drivingLicense", "driving_licence");
	
	Возврат СоответствиеПутиИКлассификатора;
	
КонецФункции

Функция СоответствиеПутиИКлассификатораSuperJob()
	
	СоответствиеПутиИКлассификатора = Новый Соответствие;
	
	СоответствиеПутиИКлассификатора.Вставить("type_of_work", "type_of_work");	
	СоответствиеПутиИКлассификатора.Вставить("place_of_work", "place_of_work");	
	СоответствиеПутиИКлассификатора.Вставить("education", "education");	
	СоответствиеПутиИКлассификатора.Вставить("experience", "experience");
	СоответствиеПутиИКлассификатора.Вставить("maritalstatus", "maritalstatus");
	СоответствиеПутиИКлассификатора.Вставить("children", "children");
	СоответствиеПутиИКлассификатора.Вставить("id_language", "language");
	СоответствиеПутиИКлассификатора.Вставить("level", "lang_level");
	СоответствиеПутиИКлассификатора.Вставить("gender", "gender");
	СоответствиеПутиИКлассификатора.Вставить("id_user", "users");
	СоответствиеПутиИКлассификатора.Вставить("town", "towns");
	СоответствиеПутиИКлассификатора.Вставить("catalogues", "catalogues");
	СоответствиеПутиИКлассификатора.Вставить("driving_licence", "driving_licence");
	СоответствиеПутиИКлассификатора.Вставить("resumesubscription_kwc", "resumesubscription_kwc");
	СоответствиеПутиИКлассификатора.Вставить("resumesubscription_rws", "resumesubscription_rws");
	СоответствиеПутиИКлассификатора.Вставить("published", "published");	   	
			
	Возврат СоответствиеПутиИКлассификатора;
	
КонецФункции

Функция СоответствиеПутиИКлассификатораZarplata()
	
	СоответствиеПутиИКлассификатора = Новый Соответствие;
	СоответствиеПутиИКлассификатора.Вставить("rubrics.id", "rubrics");
	СоответствиеПутиИКлассификатора.Вставить("payment_type_alias", "payment_type_alias");
	СоответствиеПутиИКлассификатора.Вставить("contact.city", "geo");
	СоответствиеПутиИКлассификатора.Вставить("currency", "payment_per_month");
	СоответствиеПутиИКлассификатора.Вставить("working_type", "workingTypes");
	СоответствиеПутиИКлассификатора.Вставить("schedule", "scheduler");
	СоответствиеПутиИКлассификатора.Вставить("education", "education_vacancy");
	СоответствиеПутиИКлассификатора.Вставить("experience_length", "workLength");
	
	Возврат СоответствиеПутиИКлассификатора;
	
КонецФункции

Функция СоответствиеПутиИКлассификатораПоСайту(Сайт) Экспорт
	
	Если Сайт = HeadHunter() Тогда
		Возврат СоответствиеПутиИКлассификатораHeadHunter();
	ИначеЕсли Сайт = Rabota() Тогда
		Возврат СоответствиеПутиИКлассификатораRabota();
	ИначеЕсли Сайт = SuperJob() Тогда
		Возврат СоответствиеПутиИКлассификатораSuperJob();
	ИначеЕсли Сайт = Zarplata() Тогда
		Возврат СоответствиеПутиИКлассификатораZarplata();
	КонецЕсли;
	
КонецФункции

Функция ИменаСвойствЗнанияЯзыкаRabota()
	
	ИменаСвойств = Новый Структура;
	
	ИменаСвойств.Вставить("ИдЯзыка", "id");
	ИменаСвойств.Вставить("ИдУровня", "id");
	ИменаСвойств.Вставить("НазваниеЯзыка", "name");
	ИменаСвойств.Вставить("НазваниеУровня", "name");
	ИменаСвойств.Вставить("ОбъектЯзык", "offerLanguage");
	ИменаСвойств.Вставить("ОбъектУровень", "offerLanguageLevel");
	
	Возврат ИменаСвойств;
	
КонецФункции

Функция ИменаСвойствЗнанияЯзыкаSuperJob()
	
	ИменаСвойств = Новый Структура;
	
	ИменаСвойств.Вставить("ИдЯзыка", "id");
	ИменаСвойств.Вставить("ИдУровня", "id");
	ИменаСвойств.Вставить("НазваниеЯзыка", "title");
	ИменаСвойств.Вставить("НазваниеУровня", "title");
	ИменаСвойств.Вставить("ОбъектЯзык", "id_language");
	ИменаСвойств.Вставить("ОбъектУровень", "level");
	
	Возврат ИменаСвойств;
	
КонецФункции

Функция ИменаСвойствЗнанияЯзыка(Сайт) Экспорт 
	
	ИменаСвойств = Неопределено;
	
	Если Сайт = Rabota() Тогда
		ИменаСвойств = ИменаСвойствЗнанияЯзыкаRabota();
	ИначеЕсли Сайт = SuperJob() Тогда
		ИменаСвойств = ИменаСвойствЗнанияЯзыкаSuperJob();
	КонецЕсли;
	
	Возврат ИменаСвойств;
	
КонецФункции

Функция ИзвлечьТекстИзHTML(Знач ТекстHTML) Экспорт
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "</p>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "</li>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<br>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<br/>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<br />", Символы.ПС);
	
	Возврат СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	
КонецФункции

#КонецОбласти