
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	кдРезультаты = кдИнтеграцияЗУП_УТ.ПолучитьТекущееСостояниеДокумента(ПараметрКоманды);
	Если ЗначениеЗаполнено(кдРезультаты.РезультатБП) Тогда
		ПараметрыФормы = Новый Структура("Ключ", кдРезультаты.РезультатБП);
		ОткрытьФорму("Справочник.кдРезультаты.Форма.ФормаЭлемента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет результатов по документу",,"Номер");
	КонецЕсли;
	
КонецПроцедуры
