#Область СлужебныйПрограммныйИнтерфейс

// Показывает форму с результатами отправки.
// 
// Параметры:
// 	ФормаВладелец - ФормаКлиентскогоПриложения - форма-владелец, из которой открывается форма с результатами.
// 	ПараметрыФормы - Структура - параметры формы результатов отправки.
// 	* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо рассылаемого документа.
// 	* Получатель - СправочникСсылка.ФизическиеЛица - получатель сообщения.
// 	* РассылаемыйДокумент - ОпределяемыйТип.РассылаемыйДокумент - отправляемый документ.
//
Процедура ПоказатьРезультатыОтправки(ФормаВладелец, ПараметрыФормы) Экспорт
	ОткрытьФорму("РегистрСведений.РезультатыРассылкиДокументов.Форма.РезультатОтправки", ПараметрыФормы, ФормаВладелец);
КонецПроцедуры

#КонецОбласти