#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		ЭкземплярТипаПредмета = Справочники.РассылкиУведомлений.ЭкземплярТипаПредмета(ВидУведомления);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		Если ПометкаУдаления Тогда
			Подготовлена = Ложь;
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидУведомления, "ПометкаУдаления") Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли