//Этап = 0 Отзыв документа, Этап = 1 Создание файлов, Этап 2, 3 и т.д. Создание БП

Процедура ПриЗаписи(Отказ, Замещение)
	Для каждого записи из ЭтотОбъект Цикл
		Если НЕ записи.Действует Тогда
			МенеджерЗаписи = РегистрыСведений.кдИнтеграцияЗУП_УТ.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Документ = записи.Документ;
			МенеджерЗаписи.Период = записи.Период;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Действует = Ложь;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

