
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция РешениеПринято(Состояние) Экспорт
	Возврат СостоянияРешениеПринято().Найти(Состояние) <> Неопределено;
КонецФункции

Функция СостоянияРешениеПринято() Экспорт
	
	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.СостоянияСогласования.Согласовано);
	Состояния.Добавить(Перечисления.СостоянияСогласования.Отклонено);
	
	Возврат Состояния;
	
КонецФункции

#КонецОбласти

#КонецЕсли