////////////////////////////////////////////////////////////////////////////////
// Подсистема "Бронирование командировок".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Определяет видимость полей ФамилияЛатиницей, ИмяЛатиницей для документа физического лица.
// См. СотрудникиКлиентСервер.УстановитьВидимостьГруппыФамилияИмяЛатиницей.
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма, на которую выведен менеджер записи регистра ДокументыФизическихЛиц.
//	ПутьКДанным - Строка - имя реквизита формы, содержащего менеджер записи.
//	Видимость - Булево - переопределяемый признак необходимости вывода полей.
//
Процедура ОпределитьВидимостьГруппыФамилияИмяЛатиницей(Форма, ПутьКДанным, Видимость) Экспорт
	
	МенеджерЗаписи = Форма[ПутьКДанным];
	
	Если Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьБронированиеКомандировок") 
		И МенеджерЗаписи.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ") Тогда
		
		Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
