#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Возвращает коллекцию вариантов настроек
//
// Возвращаемое значение:
//  Массив -  коллекция объектов со свойствами Имя и Представление (см. ВариантНастроекКомпоновкиДанных).
//
Функция ВариантыНастроек() Экспорт
	
	ВариантыНастроек = Новый Массив;
	
	ПоляНастройки = "Имя, Представление";
	ВариантыНастроек.Добавить(
		Новый Структура(ПоляНастройки, "ПлановыеИФактическиеЗначенияПоказателейПодразделений", НСтр("ru = 'Анализ плановых и фактических значений показателей подразделений.'")));
	
	Возврат ВариантыНастроек;
	
КонецФункции

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПлановыеИФактическиеЗначенияПоказателейПодразделений");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Анализ плановых и фактических значений показателей подразделений.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли
